{"intents": [
        {"tag": "A la",
        "response": "In the style of, (ex., a la Francaise =in the style of France)"},
        {"tag": "A La Brasa",
        "response": "Charcoal grilled"},
        {"tag": "a la carte",
        "response": "A list of food items each priced separately"},
        {"tag": "A La Marinera",
        "response": "Cooked with white wine, onions, and tomatoes"},
        {"tag": "A la minut",
        "response": "Cooked to order"},
        {"tag": "a la mode",
        "response": "In the fashion"},
        {"tag": "A La Parilla",
        "response": "Broiled"},
        {"tag": "A La Plancha",
        "response": "Broiled on a hot surface, especially fish, shellfish, and meat"},
        {"tag": "A La Romana",
        "response": "Deep-fried in a light batter - especially calemares, hake or merluza"},
        {"tag": "Aachar",
        "response": "Spicy and strong “Indian pickles” made from vegetables, mango, lime, and green chilies"},
        {"tag": "Abaisse",
        "response": "A piece of dough rolled to required size"},
        {"tag": "Abalone",
        "response": "A mollusk, related to a sea snail, similar in flavor to a clam. It may be cooked by various methods and is best suited to very long or very short cooking times. called “Awabi” in Japanese cuisine and “Loco” in South American cuisine. It has been over-harvested and is very expensive when available. A small amount is being commercial raised."},
        {"tag": "Abattis",
        "response": "Winglets, giblets of poultry"},
        {"tag": "Abricot",
        "response": "Apricot"},
        {"tag": "Aburage",
        "response": "Deep-fried Bean Curd, or tofu, cooked in sweet Sake, Soy Sauce, and water. A primary ingredient in Miso Soup."},
        {"tag": "Aceite",
        "response": "Oil"},
        {"tag": "Aceite De Oliva",
        "response": "Olive oil"},
        {"tag": "Aceite De Oliva Extra Virgin",
        "response": "Quality cold pressed olive oil with an acidity level below .75 percent and a distinctive flavor"},
        {"tag": "Aceite De Oliva Puro",
        "response": "A processed neutral olive oil with a small amount virgin olive oil added for flavor. A basic olive oil for frying"},
        {"tag": "Aceituna",
        "response": "Olive"},
        {"tag": "Acelga",
        "response": "Swiss chard"},
        {"tag": "Achar",
        "response": "Very spice relish from the cuisine of India and the Caribbean Islands. Achar may be made from fruits and vegetables"},
        {"tag": "Acidulated Water",
        "response": "A mixture of water and a small amount of vinegar or lemon juice, used to purify or prevent discoloration in meats and vegetables."},
        {"tag": "Adafina",
        "response": "Sephardic dish similar to a cocido or stew"},
        {"tag": "Aderezar",
        "response": "To season or dress a salad"},
        {"tag": "Adobar",
        "response": "To Marinate"},
        {"tag": "Adobo",
        "response": "A marinade made from vinegar, garlic, and seasoning used to preserve the flavor of raw meat."},
        {"tag": "Adzuki Beans",
        "response": "Small reddish brown beans."},
        {"tag": "Aemono",
        "response": "A mixture of vegetables or meats topped with sauce."},
        {"tag": "Agar-Agar",
        "response": "Japanese gelatin made from dried seaweed."},
        {"tag": "Agari",
        "response": "The Japanese Sushi-bar term that refers to green tea."},
        {"tag": "Agemono",
        "response": "A term that refers to deep-fried or pan-fried foods."},
        {"tag": "Aging",
        "response": "What we all do but in cooking it means keeping meats or cheeses in a controlled environment for a certain amount of time to improve tenderness and flavor"},
        {"tag": "Agiter",
        "response": "To stir"},
        {"tag": "Agneau",
        "response": "Lamb"},
        {"tag": "Agnolotti",
        "response": "A small half-moon shaped ravioli."},
        {"tag": "Agridulce",
        "response": "Bittersweet, especially describing a type of Pimentón de la Vera"},
        {"tag": "Agrio",
        "response": "sour or bitter"},
        {"tag": "Agua",
        "response": "Water"},
        {"tag": "Aguacate",
        "response": "Avocado"},
        {"tag": "Aguardiente",
        "response": "A potent Spanish liqueur used sparingly in cooking which is especially popular in Galicia. Similar to Italian grappa which has a lower alcohol content."},
        {"tag": "Ahumado",
        "response": "Smoked"},
        {"tag": "Aigrefin",
        "response": "Haddock"},
        {"tag": "Aiguillette",
        "response": "Long, thin slices of poultry breast or some other meats."},
        {"tag": "Aiguillettes",
        "response": "Meat of fish cut into strips"},
        {"tag": "Ail",
        "response": "French word for “garlic”."},
        {"tag": "Aioli",
        "response": "A sauce made from olive oil, garlic and lemon juice, blended with a mortar and pestle. A common variation includes egg yolk and is similar to mayonnaise."},
        {"tag": "Airelle Rouge",
        "response": "Cranberry"},
        {"tag": "Aji",
        "response": "Filleted and marinated Spanish horse mackerel."},
        {"tag": "Aji-no-moto",
        "response": "Monosodium Glutamate (MSG)."},
        {"tag": "Aji-no-tataki",
        "response": "Filleted and marinated Spanish horse mackerel."},
        {"tag": "Ajo",
        "response": "Spanish for “garlic”"},
        {"tag": "Ajoarriero",
        "response": "Bacalao al ajoarriero, is a recipe from Navarra which includes a dish of salt cod with garlic"},
        {"tag": "Ajoblanco",
        "response": "Cold almond soup from Andalusia, often served with grapes"},
        {"tag": "Aka Miso",
        "response": "Red soy bean paste"},
        {"tag": "Akagai",
        "response": "Red clam"},
        {"tag": "Akami",
        "response": "Lean tuna"},
        {"tag": "Akuri",
        "response": "An Indian variation of scrambled eggs, with added onions and hot spices. Delicious with a hot Paratha."},
        {"tag": "Al Ajillo",
        "response": "Fried with garlic, as in ‘gambas al ajillo’ – garlic shrimp"},
        {"tag": "Al Carbon",
        "response": "Spanish term for a dish relating to grilled or containing meat."},
        {"tag": "Al Dente",
        "response": "A term meaning “to the bite”, used to describe the correct degree of doneness for pasta and vegetables. This is not exactly a procedure, but a sensory evaluation for deciding when the food is finished cooking. Pasta should retain a slight resistance when biting into it, but should not have a hard center."},
        {"tag": "Al Forno",
        "response": "Italian term describing a dish cooked in the oven."},
        {"tag": "Al Horno",
        "response": "Roasted or baked in the oven"},
        {"tag": "Al Pastor",
        "response": "A term used in Spanish and Italian referring to a dish cooked in the style of shepherd cooking, usually over a grill or spit."},
        {"tag": "Al Pil Pil",
        "response": "A Basque recipe for bacalao salt cod sauted slowly in oil with garlic. The gelatine under the skin of the fish combines with the oil to form a gelatine-like sauce"},
        {"tag": "Al Vapor",
        "response": "Steamed"},
        {"tag": "Albahaca",
        "response": "Sweet basil"},
        {"tag": "Albardilla",
        "response": "Batter"},
        {"tag": "Albondiga",
        "response": "Meatball"},
        {"tag": "Alboronia",
        "response": "A summer vegetable combination similar to pesto – typical Andalucian cuisine"},
        {"tag": "Albumen",
        "response": "The protein of egg whites."},
        {"tag": "Alcachofa",
        "response": "Artichoke"},
        {"tag": "Alcaparras",
        "response": "Capers"},
        {"tag": "Alfredo",
        "response": "A pasta sauce originally consisting of butter, cream, and the finest parmesan cheese available. Modern versions add garlic, peas, and less expensive parme All of these will make fine sauces, but nothing can compare to the original version."},
        {"tag": "Alimento",
        "response": "Food"},
        {"tag": "Alino",
        "response": "Dressing, seasoning"},
        {"tag": "Allemande",
        "response": "A sauce made of Veloute (usually veal), a liaison and lemon juice."},
        {"tag": "Allspice",
        "response": "An aromatic spice made from the dried berry of the West Indian allspice tree. This spice, used to flavor savory dishes, has the aroma and taste of cinnamon cloves, nutmeg, and pepper."},
        {"tag": "Allumettes",
        "response": "Match sized knife cut, (usually potatoes) same size as julienne"},
        {"tag": "Almazara",
        "response": "Olive oil mill"},
        {"tag": "Almejas",
        "response": "Clams"},
        {"tag": "Almendras",
        "response": "Almonds"},
        {"tag": "Almíbar",
        "response": "Syrup"},
        {"tag": "Almond Paste",
        "response": "A sweet paste made from finely ground blanched almonds mixed with powdered sugar and enough glucose or syrup to bind it together."},
        {"tag": "Almuerzo",
        "response": "Brunch, hearty second breakfast"},
        {"tag": "Alta Cocina",
        "response": "Haute cuisine"},
        {"tag": "Alubias",
        "response": "Beans grown for drying, can be white, red, or black"},
        {"tag": "Alubias Negras",
        "response": "Black beans"},
        {"tag": "Alubias Rojas",
        "response": "Kidney beans"},
        {"tag": "Ama Ebi",
        "response": "Sweet shrimp. Usually served raw with deep-fried shrimp shells."},
        {"tag": "Amandine",
        "response": "A French term for any dish with almonds. Alternate spelling is almondine."},
        {"tag": "Amchoor",
        "response": "Pulverized, sun-dried, unripe, wild green mango. This spice has a bitter, tangy, and refreshing taste. Amchoor has a slightly tropical aroma, and is similar to tamarind in flavor. Used mainly in Indian cooking."},
        {"tag": "An",
        "response": "Sweetened puree of cooked red beans"},
        {"tag": "Ana-kyu-maki",
        "response": "Conger eel and cucumber rolls"},
        {"tag": "Añadir",
        "response": "Add"},
        {"tag": "Anago",
        "response": "Saltwater Conger eel that is boiled and grilled before serving."},
        {"tag": "Anchoa",
        "response": "Anchovy"},
        {"tag": "Anchoiade",
        "response": "A dip made of pureed anchovies mixed with garlic and olive oil. Raw vegetables and bread are served with this dip."},
        {"tag": "Anchois",
        "response": "Anchovy"},
        {"tag": "Andouille",
        "response": "A sausage made from the stomach and the inText_Dictines of pork. The sausage is dried and smoked, then boiled or steamed to finish cooking. Andouille sausage is used regularly in Creole cooking, but it is popular in French cooking as well. The Creole version of this sausage is much spicier than those made in France."},
        {"tag": "Angelica",
        "response": "Licorice flavored stalks from these plants are candied and used primarily in pastry making. Angelica is also used to flavor liqueurs."},
        {"tag": "Anglaise",
        "response": "English style, (meaning bland plain cooked food)"},
        {"tag": "Animelle",
        "response": "Sweetbreads"},
        {"tag": "Anise",
        "response": "An aromatic, licorice-flavored herb belonging to the parsley family. It has feathery leaves and bears greenish-brown seeds, both of which are dried for use. Popularly used as a flavoring in cooking and liqueurs."},
        {"tag": "Anise Pepper",
        "response": "Hot, peppery dried red berries that are roasted and ground to produce a pungent and aromatic seasoning. Sichuan pepperis one of the spices of Chinese five-spice powder."},
        {"tag": "Anna Potatoes",
        "response": "The name for a potato pancake made of thin slices of potato which are assembled in concentric circles and cooked with liberal amounts of butter. The cake then baked until crisp and golden brown."},
        {"tag": "Annatto Seed",
        "response": "Also called achiote seed, these seeds are used as a food coloring and a spice in cooking from Latin America and Southeast Asia."},
        {"tag": "Annoncer",
        "response": "To announce (call out orders)"},
        {"tag": "Antipasto",
        "response": "The Italian word for snacks served before a meal, meant to pique one’s appetite. There are many diverse antipasti, but common elements of an antipasto t are cured meats and salamis, olives, marinated vegetables, and cheese."},
        {"tag": "Aoyagi",
        "response": "Red round clam"},
        {"tag": "Aperitivo",
        "response": "Aperitif or an appetizer"},
        {"tag": "Apio",
        "response": "celery"},
        {"tag": "Aplanar",
        "response": "Roll out"},
        {"tag": "Aplastar",
        "response": "Flatten"},
        {"tag": "Appam",
        "response": "A thin, round, “at wafer made from rice, potatoes, and/or various lentil flours."},
        {"tag": "Arándano",
        "response": "Cranberry"},
        {"tag": "Arborio",
        "response": "Starchy, short grain rice that develops a creamy consistency when cooked. Especially used for Risotto."},
        {"tag": "Arenque Ahumado",
        "response": "Kipper"},
        {"tag": "Argenteuil",
        "response": "District in France known for its asparagus"},
        {"tag": "Aromates",
        "response": "Herbs, spices & flavorings (aromatic)"},
        {"tag": "Arrenque",
        "response": "Herring"},
        {"tag": "Arrowroot",
        "response": "Starch obtained from the arrowroot plant. Can be used in place of cornstarch or flour."},
        {"tag": "Arroz",
        "response": "Rice"},
        {"tag": "Arroz A Banda",
        "response": "A saffron rice dish cooked in a paella pan, with a complex fish stock."},
        {"tag": "Arroz Calasparra",
        "response": "a short grain rice gown in the Calasparra region of Murcia in fresh mountain water. Due to slow maturation, the grains of rice are highly absorbent while retaining their integrity, making them a key ingredient in the making of paella. A sub-variety, Bomba rice from Calasparra,was rescued from extinction in the past fifty years and is prized by many chefs as the finest paella rice in Spain."},
        {"tag": "Artesa",
        "response": "Flat-based, long wooden container for kneading bread, mixing meat for sausages, and similar tasks."},
        {"tag": "Artichaut",
        "response": "Artichoke"},
        {"tag": "Artichoke",
        "response": "A name shared by three unrelated plants: the globe artichoke, Jerusalem artichoke and Chinese (or Japanese) artichoke. Considered the true artichoke, the globe artichoke is cultivated mainly in California’s mid-coastal region. It is the bud of a large plant from the thistle family and has tough, petal shaped leave They are available year-round, with the peak season March through May. Buy deep green, heavy for their size artichokes with a tight leaf formation."},
        {"tag": "Asado",
        "response": "Barbecuing techniques used in Argentina, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru and Uruguay."},
        {"tag": "Asafetida",
        "response": "A spice used in India and the Middle East for cooking or as a condiment to be sprinkled over food after it has been cooked. It has a bitter taste and a pungent aroma similar to garlic and truffles."},
        {"tag": "Asiago",
        "response": "A cheese similar to Provolone, but milder in flavor."},
        {"tag": "Asperge",
        "response": "Asparagus"},
        {"tag": "Aspic",
        "response": "A clear jelly made from the concentrated liquid in which meat, poultry or fish was cooked. These preparations are often elaborately decorated for use on buffets. Both savory and sweet foods are set in aspic."},
        {"tag": "Atar",
        "response": "Tie"},
        {"tag": "Atta",
        "response": "Whole-wheat flour"},
        {"tag": "Atún",
        "response": "Tuna"},
        {"tag": "Au bleu",
        "response": "A term to describe the cooking method of cooking live fish in court bouillon"},
        {"tag": "Au Four",
        "response": "In the oven"},
        {"tag": "Au Gratin",
        "response": "Cooked in the oven in a way that forms form a crust on the surface. This is expedited by placing the dish under the broiler. Bread crumbs and cheese are often sprinkled on top of these dishes to help form the crust."},
        {"tag": "Au Jus",
        "response": "French for “with juice.” Used to describe meat (usually beef) served in its own juice. The term is sometimes used as a name for the juice itself, usually obtained by deglazing a pan after cooking."},
        {"tag": "Aubergine",
        "response": "The French word for eggplant."},
        {"tag": "Aurore",
        "response": "This is a term associated with sauces that have tomato puree or concasse added to it."},
        {"tag": "Avena",
        "response": "Oatmeal"},
        {"tag": "Aves de Caza",
        "response": "Game Birds"},
        {"tag": "Avial",
        "response": "Vegetable curry from southern India"},
        {"tag": "Avocado Salad",
        "response": "A green salad typically served with avocado and ginger dressing"},
        {"tag": "Ayu",
        "response": "Sweet fish"},
        {"tag": "Azafrán",
        "response": "The toasted stigmas of a purple crocus flower. Saffron adds a deep color and a unique pungent flavor to rice dishes. Because of the labor intensive process of harvesting the flowers, removing the stamens and toasting them it is the most expensive spice in the world. Most of the world’s saffron comes from Spain, although less potent Iranian and Turkish saffron have been flooding the market under the guise of being from Spain. Economical “colorante” is a poor substitute, as it’s actually turmeric, a different spice entirely."},
        {"tag": "Azúcar",
        "response": "Sugar"},
        {"tag": "Azúcar Blanca Granulada Fino",
        "response": "Finely granulated sugar"},
        {"tag": "Azúcar Glace",
        "response": "Confectioner’s sugar; icing sugar"},
        {"tag": "Azuki",
        "response": "Small red beans"},
        {"tag": "Baba",
        "response": "A small cake made from enriched yeast dough, often flavored with candied fruits, and soaked with a rum or Kirsch syrup after baking. This dough is also used to make the larger savarin."},
        {"tag": "Bacalao",
        "response": "Dried, salt cod, highly popular in the Basque region of Spain. Bacalao must be soaked for about 24 hours before use to remove the excess salt, and to rehydrate the fish."},
        {"tag": "Baekenhofe",
        "response": "An alsacienne stew made of pork, lamb, and beef layered with potatoes and onions. The meat is first marinated in wine and herbs for a minimum of 24 ho then assembled and baked in a paste sealed casserole until the meat is buttery tender. The juices are reduced and the top is browned under the broiler. Crisp bacon and fried leeks are used to garnish this dish."},
        {"tag": "Baghar",
        "response": "A melange of spices, herbs, oil, and vegetables that flavors many Indian dishes."},
        {"tag": "Bagna Cauda",
        "response": "Meaning “warm bath”, this is a dip made of anchovies, olive oil, and garlic. Unlike the French anchoiade, this is served warm and is not emulsified. Bread and raw vegetables are served with this dip."},
        {"tag": "Baigai",
        "response": "Small water snails"},
        {"tag": "Bain-Marie",
        "response": "A double boiler used for cooking (insulated from direct heat)"},
        {"tag": "Baked Alaska",
        "response": "A dessert comprised of sponge cake topped with ice cream and covered with meringue. The dessert is then placed in a hot oven to brown the meringue before the ice cream can melt."},
        {"tag": "Baking Powder",
        "response": "A leavening agent combining an acid with bicarbonate of soda to form the gas which enables baked products to rise. The chemical reaction between the acid and the soda produces carbon dioxide to leaven the product. The most common form of baking powder is the double acting variety, which produces gas upon mixing and again at high temperatures. Always store this tightly covered."},
        {"tag": "Baking Soda",
        "response": "A leavening agent which is used as an essential ingredient in baking powder. When used alone as a leavener, recipes must include some type of acid to neutralize the resulting sodium carbonate in the finished product. Buttermilk, yogurt, sour cream, and citrus juice are adequate acid to use. You may also use baking soda to help neutralize the acid in recipes that call for large amounts of fruit."},
        {"tag": "Baklava",
        "response": "A very sweet dessert made of layers of flaky pastry filled with a mixture of ground nuts and sugar. The pastry is sliced, baked, and brushed with a honey syrup flavored with lemon or rose water."},
        {"tag": "Ballotine",
        "response": "Stuffed boneless game or domestic bird"},
        {"tag": "Balsam Pear",
        "response": "A long, green, shiny, slightly sour fruit that resembles a cucumber with bumpy skin."},
        {"tag": "Balsamic Vinegar",
        "response": "Sweet red-brown vinegar that is aged in wooden barrels."},
        {"tag": "Bamboo Shoots",
        "response": "Tender spear-shaped shoots from the base of bamboo plants often used in stir fried dishes to provide texture."},
        {"tag": "Bangers",
        "response": "British colloquial term for sausages. “Bangers and mash” are sausages and mashed potatoes."},
        {"tag": "Bar",
        "response": "1. Bass (fish) 2. gin mill"},
        {"tag": "Bar raye",
        "response": "Rock salmon"},
        {"tag": "Barbacoa",
        "response": "Barbeque"},
        {"tag": "Bard",
        "response": "To wrap thin sheets of fat or bacon around lean meat or poultry to prevent it from drying out while roasting"},
        {"tag": "Barder",
        "response": "To cover meats with fat during cooking proces"},
        {"tag": "Barding",
        "response": "The practice of wrapping lean cuts of meat to be with thin slices of back fat. The converse of this is larding, in which long strips of fat are inserted into the cut meat to keep it moist during cooking."},
        {"tag": "Barfi",
        "response": "A sweet fudge dessert flavored with saffron, vanilla essence, and cocoa. This popular after dinner treat is served in bite-sized pieces."},
        {"tag": "Baron",
        "response": "Mutton or lamb; the saddle with legs attached"},
        {"tag": "Barquette",
        "response": "A small oval shaped pastry shell with either sweet or savory fillings."},
        {"tag": "Barra",
        "response": "Loaf of bread/baguette"},
        {"tag": "Basil",
        "response": "The quintessential Mediterranean herb, and widely used in Italian kitchens. Consumed fresh, it adds fragrance and fresh flavor to pasta dishes, soups, vegetables, fish, poultry, salad dressings, and pesto sauces. Basil is a perfect topping for any tomato-based dish."},
        {"tag": "Basilic",
        "response": "Basil"},
        {"tag": "Basmati Rice",
        "response": "Fragrant, nutty, authentic, Indian long-grained white rice. A wide variety of dishes are served with basmati rice, including pulaos, pilafs, biryanis, meats, and vegetables."},
        {"tag": "Basquaise",
        "response": "Food prepared in the style of Basque which often includes tomatoes and sweet or hot red peppers."},
        {"tag": "Baste",
        "response": "To brush, squirt or pour drippings, fat or liquid, over food while broiling, roasting or baking to prevent drying out; develops a crusty exterior and improves flavor and appearance of product being cooked."},
        {"tag": "Batido De Leche",
        "response": "Milkshake"},
        {"tag": "Batir",
        "response": "Whisk"},
        {"tag": "Batonnet",
        "response": "(bah-toh-nay); A small diced strip: 1/4” x 1/4” x 2 1/2 – 3”"},
        {"tag": "Batter",
        "response": "A liquid dough, usually thin enough to pour"},
        {"tag": "Battera",
        "response": "Oshi Sushi topped with mackerel"},
        {"tag": "Batterie de cuisine",
        "response": "Equipment found in the kitchen"},
        {"tag": "Bavarian Cream",
        "response": "A cream made with pastry cream lightened with whipped cream and stabilized with gelatin. This cream may then be poured into molds, or used as a filling cakes or pastries. Bavarian cream is often flavored with fruit purees or alcohol."},
        {"tag": "Bean Curd",
        "response": "Also referred to as Dou Fu in Chinese and Tofu in Japanese, this soft cheese-like paste is made from boiled Soya bean liquid."},
        {"tag": "Bean Curd Cheese",
        "response": "A strong, salty cheese made by fermenting bean curd cubes in rice wine, salt, sesame oil, or chili."},
        {"tag": "Bean Sprouts",
        "response": "Highly nutritious sprouted green gram"},
        {"tag": "Bearnaise",
        "response": "This is the most notable of all the hollandaise sauce variations. It is made with a wine and vinegar reduction flavored with tarragon. This sauce makes a good companion to grilled meats and fish."},
        {"tag": "Bebidas",
        "response": "Drinks"},
        {"tag": "Becassine",
        "response": "Snipe"},
        {"tag": "Bechamel",
        "response": "Basic milk sauce(white); one of the five mother sauces"},
        {"tag": "Bechamel Sauce",
        "response": "This is a white sauce made with milk or cream and thickened with a roux. Bechamel sauce is generally used as a base for other more complex sauces, though may be used alone for binding or moistening."},
        {"tag": "Beef Negimaki",
        "response": "Sizzling, thin-sliced beef rolls wrapped around scallions and broiled with teriyaki sauce."},
        {"tag": "Beef Teriyaki",
        "response": "Broiled beef served with Teriyaki sauce"},
        {"tag": "Beignet",
        "response": "A French term for a type of doughnut. Dough or batter is deep fried and dusted w/sugar or glazed with a flavored syrup."},
        {"tag": "Beignets",
        "response": "Fritters"},
        {"tag": "Belle Helene",
        "response": "Best known as the name of a dessert with poached pears, ice cream, and chocolate sauce. It is also a term used in French cookery as a name for a garnish to grilled meat dishes."},
        {"tag": "Bellota",
        "response": "Acorn"},
        {"tag": "Beni Shoga",
        "response": "Red pickled ginger"},
        {"tag": "Benne Seeds",
        "response": "An African term for sesame seeds."},
        {"tag": "Bento",
        "response": "A boxed meal of rice, pickles, fish, poached egg, sausage, and beans."},
        {"tag": "Berenjena",
        "response": "Eggplant, aubergine"},
        {"tag": "Berro",
        "response": "Aatercress"},
        {"tag": "Besugo",
        "response": "Sea bream"},
        {"tag": "Betel Leaf",
        "response": "A thick, smooth, dark green leaf. In the Indian cuisine, this leaf is wrapped around fragrant spices, fennel seeds, slaked lime paste, tobacco leaves, colored shreds of coconut, and fine shreds of areca nut. Paan, which acts as a breath-freshener, digestive, antacid, and carminative, is eaten after a meal. It is garnished with Varak."},
        {"tag": "Beteragas",
        "response": "Beets"},
        {"tag": "Beurre",
        "response": "Butter"},
        {"tag": "Beurre Blanc",
        "response": "An emulsified sauce made of a wine or vinegar reduction blended with softened butter. This may be flavored in many ways, for fish, vegetables, and poultry dishes. This is a very tricky sauce and does not hold for long periods of time. Because of this, modern versions add a touch of cream to stabilize the sauce for longer periods of time."},
        {"tag": "Beurre Manie",
        "response": "A mixture of flour and butter kneaded to a smooth paste. This is then used in small quantities to adjust the thickness of sauces and stews. The sauce must be boiled briefly to remove the starchy taste of the flour. For this reason, beurre manie is used in situations where only a small quantity is needed."},
        {"tag": "Bhaaji",
        "response": "A general Indian term to describe vegetables."},
        {"tag": "Bhakri",
        "response": "An unleavened flatbread made from Sorghum flour and water. The dough is rolled out and baked on a tawa."},
        {"tag": "Bharta",
        "response": "A spicy, pulpy, mashed, vegetable dish. Most commonly served with Baingan (eggplant)."},
        {"tag": "Bhatura",
        "response": "Deep-fried leavened bread made from semolina and yogurt. After the bread ferments, it is mixed with maida to form dough."},
        {"tag": "Bhel Puri",
        "response": "A mixture of puffed rice, lentils, !finely chopped onions, and chopped coriander topped with both sweet and spicy onion chili chutneys."},
        {"tag": "Bhunao",
        "response": "To saute or stir fry in onions, tomatoes, ginger, garlic, green chilies, and oil."},
        {"tag": "Bien Cocido",
        "response": "Well cooked meat"},
        {"tag": "Bien Cuit",
        "response": "Well cooked"},
        {"tag": "Biiru",
        "response": "Beer"},
        {"tag": "Bind",
        "response": "To thicken a hot liquid or sauce by stirring in a roux, flour, cornstarch, egg yolks, cream or butter"},
        {"tag": "Biryani",
        "response": "This elaborate Indian dish, made from spiced saffron, is cooked with lamb, chicken, or vegetables."},
        {"tag": "Biscotti",
        "response": "Dry Italian cookies flavored with almonds, chocolate, or anise seed, used for dunking in coffee and sweet dessert wine."},
        {"tag": "Bisque",
        "response": "A rich shellfish soup made with the shells of the animal. The soup is enriched with cream and Cognac and garnished with pieces of the shellfish meat. This name is also used to describe vegetable soups prepared in the same manner as shellfish bisques."},
        {"tag": "Bistec",
        "response": "Beef steak"},
        {"tag": "Bistella",
        "response": "See pastilla for a definition."},
        {"tag": "Bitter Gourd",
        "response": "A long, green, shiny, slightly sour fruit that resembles a cucumber with bumpy skin."},
        {"tag": "Bitter Melon",
        "response": "A long, green, shiny, slightly sour fruit that resembles a cucumber with bumpy skin."},
        {"tag": "Black Bean Sauce",
        "response": "A flavorful and popular Chinese marinade consisting of fermented salted black beans and spices, such as garlic or chilies. This condiment gives a rich and distinctive aroma to steamed and stir fried Chinese dishes."},
        {"tag": "Blackened",
        "response": "Method of cooking that uses spices (sometimes butter) to coat fish or steak or chicken and then cooked in a very hot cast iron skillet"},
        {"tag": "Blanc",
        "response": "White"},
        {"tag": "Blanc d’Oeuf",
        "response": "Egg whites"},
        {"tag": "Blanch",
        "response": "Cooking foods in boiling water for a brief period of time. This applies primarily to vegetables so as to reduce their final cooking time. But blanching may be done to fish or meat as well."},
        {"tag": "Blanchir",
        "response": "To blanch, to par cook by immersion in water briefly, and “shocking” in ice water"},
        {"tag": "Blanquear",
        "response": "to blanch or pre-cook in boiling water"},
        {"tag": "Blanquette",
        "response": "A stew of white meats, usually veal, without initial browning. The sauce is thickened with roux and enriched with cream."},
        {"tag": "Bleu",
        "response": "Blue, applies to very rare cooked meat"},
        {"tag": "Blini",
        "response": "A small pancake made of buckwheat flour and leavened with yeast. These pancakes are often brushed with large amounts of melted butter and served with caviar and sour cream. Other versions may be made of vegetable purees or semolina flour."},
        {"tag": "Blintz",
        "response": "A stuffed crepe or thin pancake. The filling is usually made of a fresh cheese or cottage cheese, and often topped with fresh fruit or fruit preserves."},
        {"tag": "Bocadillo",
        "response": "Spanish sandwich, usually made from length of barra/baguette"},
        {"tag": "Bodino",
        "response": "Baked veal stuffed with layers of vegetables and Prosciutto."},
        {"tag": "Boeuf",
        "response": "Beef"},
        {"tag": "Boil",
        "response": "To cook at the boiling point keeping water or other liquids bubbling; rapid penetration of heat"},
        {"tag": "Bok Choy",
        "response": "a Chinese cabbage with long white stalks and narrow green leaves also called Chinese cabbage"},
        {"tag": "Boletus",
        "response": "A family of wild mushrooms known for their rich taste and meaty texture. Porcinis and cepes are two members of this family of mushroom."},
        {"tag": "Bolillos",
        "response": "French-style Rolls"},
        {"tag": "Bollito Misto",
        "response": "An Italian stew consisting of various cuts of meat, including zampone, boiled in a rich broth with vegetables. The whole dish is served with cornichons, pickled onions and a variation of chutney called mostarda di Cremona. These are whole or large pieces of fruit cooked in a spicy mustard flavored syrup. Other common sauces are salsa verde and mayonnaise."},
        {"tag": "Bolognese",
        "response": "A pasta meat sauce that is often made with wine and tomatoes."},
        {"tag": "Bombes",
        "response": "Ice cream dessert"},
        {"tag": "Bonarelli",
        "response": "Thin ribbons of pasta"},
        {"tag": "Bondas",
        "response": "A round deep-fried savory snack made from lentils and potatoes. Served with chutneys."},
        {"tag": "Bonito",
        "response": "A seasoning that is boiled, dried, and then shaved into fine strands of flakes to garnish salads and enhance flavor."},
        {"tag": "Boquerónes",
        "response": "Fresh white anchovies marinated in vinegar"},
        {"tag": "Bordelaise",
        "response": "This is a term primarily used to describe a brown sauce that includes shallots and red wine. Some versions of this sauce include slices of bone marrow added the end of cooking. Fish dishes with this name will be cooked with white Bordeaux wine."},
        {"tag": "Bordure",
        "response": "Border (usually applies to plate presentation)"},
        {"tag": "Borraja",
        "response": "borage"},
        {"tag": "Borscht",
        "response": "A rich soup from Eastern Europe containing beets or cabbage. Other ingredients may include potatoes, beans, meat or sausage. The best known of these soups is a cold version based on beets and served with sour cream, but hot versions are very common."},
        {"tag": "Boston Rolls",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around scallions, crab, and salmon."},
        {"tag": "Boti Kabab",
        "response": "Marinated boneless cubes of meat cooked in a tandoor."},
        {"tag": "Bouchee",
        "response": "A small round puff pastry shell used for sweet or savory fillings."},
        {"tag": "Bouchees",
        "response": "small puff pastries"},
        {"tag": "Boudin",
        "response": "Smooth sausages of two types. Boudin blanc contain veal, pork, and chicken. Boudin noir are made with blood and rice or potatoes. The latter type are popular in European and Creole cooking."},
        {"tag": "Boudin,Noir",
        "response": "Blood sausage, or black pudding"},
        {"tag": "Bouillabaisse",
        "response": "A rich fish stew from southern France. This was once a poor man’s meal made of any fish available. Modern versions include lobster and shrimp. The broth is flavored with garlic, orange peel, fennel, and saffron. Olive oil is added to the stew and rapidly boiled to blend it into the broth. The stew is served with croutons and rouille, a variation of aioli."},
        {"tag": "Bouillir, Bouilli",
        "response": "To boil, Boiled"},
        {"tag": "Bouillon",
        "response": "Reduced meat stock"},
        {"tag": "Boulanger",
        "response": "Baker"},
        {"tag": "Bouquet Garni",
        "response": "A sachet of herbs, containing parsley, thyme, and bay leaf; used to flavor stocks and soups. Variations may include rosemary, marjoram, fennel, leeks, celery leaves, and black pepper."},
        {"tag": "Bourgeoise",
        "response": "Meats served with vegetables"},
        {"tag": "Bourgogne",
        "response": "Burgundy"},
        {"tag": "Bourguignonne",
        "response": "Foods cooked in the style of Burgundy. This includes red wine, mushrooms, pearl onions, and bacon."},
        {"tag": "Bourride",
        "response": "Another fish stew from southern France. Here the broth, in which large pieces of fish are poached, is strained and thickened with aioli. The two are then served together in shallow bowls with bread or croutons."},
        {"tag": "Braise",
        "response": "A method of cooking that involves browning meat with vegetables in fat, oil or butter first, then slowly cooking the food in a small amount of liquid; a pot roast is often cooked this way"},
        {"tag": "Braiser",
        "response": "To braise"},
        {"tag": "Braisiere",
        "response": "Braising pan or stewing pan"},
        {"tag": "Bran",
        "response": "The outer husk of grains such as wheat, containing a high percentage of fiber. White flours have the bran removed. Whole wheat flours may contain all or part of the bran."},
        {"tag": "Brandade",
        "response": "A puree of salt cod mixed with olive oil and potatoes. Another version of brandade is covered with Gruyere cheese and browned in the oven. Both are served with croutons."},
        {"tag": "Bread",
        "response": "To coat the food with bread crumbs (usually the food is first dipped in flour and then beaten eggs, then bread crumbs)"},
        {"tag": "Break",
        "response": "The separation of fat from a liquid content of a sauce or soup; appears curdled"},
        {"tag": "Bresaola",
        "response": "A cured and dried beef filet from Italy with a more delicate texture but stronger flavor than that of prosciutto. A Swiss version of this is called bundnerfleisch. This style is pressed into a rectangular shape and has a bit drier texture than bresaola. Both are served thinly sliced with bread and fruit or pickled vegetables."},
        {"tag": "Brider",
        "response": "To truss or tie meat or poultry"},
        {"tag": "Brioche",
        "response": "A very rich bread with butter and eggs. Brioche is baked in many shapes though the brioche e tete is best known. The dough can be flavored with nuts or candied fruit, as well as herbs and spices. It may also be used to wrap foods like coulibiac. Slices of toasted brioche are the perfect companion to foie gras a gravlax."},
        {"tag": "Brochette",
        "response": "Skewers of meat, fish, or vegetables that are grilled over a flame."},
        {"tag": "Broil",
        "response": "A method of cooking where the food is placed directly underneath or above the source of high heat"},
        {"tag": "Brotes De Ajo",
        "response": "Garlic sprouts"},
        {"tag": "Broth",
        "response": "A liquid made by simmering meats or fish or poultry or vegetables or their by-products in water with herbs (also “stock”)"},
        {"tag": "Brown",
        "response": "Quickly searing food to enhance flavor; most often done at the beginning of the cooking process"},
        {"tag": "Brunoise",
        "response": "Vegetables cut into fine, small dice."},
        {"tag": "Bruschetta",
        "response": "A garlic and olive oil toasted bread that is usually topped with tomatoes and basil."},
        {"tag": "Brush",
        "response": "To coat food with a liquid such as melted butter or a glaze using a brush designed for this process"},
        {"tag": "Bruxelloise",
        "response": "In the Brussels style (with brussels sprouts}"},
        {"tag": "Bucatini",
        "response": "Long, narrow tubes of pasta usually served with a hearty meat sauce."},
        {"tag": "Budino",
        "response": "Baked veal stuffed with layers of vegetables and Prosciutto."},
        {"tag": "Buffet",
        "response": "A vast array of hot and cold foods, often elaborately garnished."},
        {"tag": "Bulghur",
        "response": "Cracked wheat made from the whole kernel that has been cooked and dried. Most commonly used in breads and tabbouleh salad."},
        {"tag": "Bullit De Peix",
        "response": "Mixed fish soup-stew, similar to sopa de marisco (Ibiza)"},
        {"tag": "Buri",
        "response": "Adult yellowtail"},
        {"tag": "Buri Toro",
        "response": "The fatty, rich, buttery, belly strip of the yellowtail"},
        {"tag": "Buta",
        "response": "Pork"},
        {"tag": "Butifarra",
        "response": "a mild pork sausage (white or black in color) used extensively in Catalán cooking. Spices, such as cinnemon, nutmeg and clove, are often used for flavoring – although they vary from region to region, and the sausage itself can be fresh or cured."},
        {"tag": "Butter",
        "response": "A cooking and eating fat that is made from sweet or sour cream and, by federal law, must contain a minimum of 80% butterfat. Butter absorbs odors easily is highly susceptible to rancidity. To avoid either of these problems, store butter in the refrigerator no longer than 2 weeks. For longer storage, butter may frozen for up to 6 months without deterioration."},
        {"tag": "Butterfly",
        "response": "To cut food down the center but not all the way through; done to spread the food apart for quicker cooking without burning"},
        {"tag": "Buttermilk",
        "response": "Originally a by-product of butter making, buttermilk is commercially produced by adding lactic acid culture to skimmed or partially skimmed milk"},
        {"tag": "Cabillaud",
        "response": "Cod fish"},
        {"tag": "Cabra",
        "response": "Goat"},
        {"tag": "Cabrilla",
        "response": "Sea Bass"},
        {"tag": "Cacahuates",
        "response": "Peanuts"},
        {"tag": "Cafe",
        "response": "Coffee"},
        {"tag": "Cafe Con Leche",
        "response": "Espresso coffee with steamed milk, café au lait"},
        {"tag": "Cafe Cortadito",
        "response": "Espresso coffee with a dash of steamed milk"},
        {"tag": "Cafe Solo",
        "response": "Espresso coffee alone, (no milk)"},
        {"tag": "Caille",
        "response": "Quail"},
        {"tag": "Cala",
        "response": "Rocky bay, cove"},
        {"tag": "Calabacita",
        "response": "A variety of summer squash found in Latin American and Mexican cooking."},
        {"tag": "Calabaza",
        "response": "Pumpkin, squash"},
        {"tag": "Calamari",
        "response": "The Italian word for squid"},
        {"tag": "Calcots",
        "response": "Spring onion (scallion)"},
        {"tag": "Caldereta",
        "response": "Casserole, most often based on lamb or kid (Extremadura) and lobster (Menorca)"},
        {"tag": "Caldero",
        "response": "Heavy iron pot, by association, or a fish and rice dish made in this pot"},
        {"tag": "Caldo",
        "response": "Stock, consomme, clear broth"},
        {"tag": "Caldo Verde",
        "response": "A Portuguese soup made from a sharp flavored cabbage, potatoes, broth, and olive oil. Sausage is then cooked in the soup."},
        {"tag": "Calentar",
        "response": "To heat or warm"},
        {"tag": "California Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around crab meat, smelt or flying fish roe, avocado, and cucumber."},
        {"tag": "Callos",
        "response": "Scallops"},
        {"tag": "Calzone",
        "response": "A savory turnover made with pizza dough. Traditionally stuffed with tomatoes, mozzarella, fresh ricotta, and/or meat, then folded, and baked or fried. Often served with sauce over the top rather than inside."},
        {"tag": "Camarones",
        "response": "Shrimp"},
        {"tag": "Camotes",
        "response": "Sweet Potatoes"},
        {"tag": "Cana",
        "response": "Small serving of draft beer"},
        {"tag": "Canapé",
        "response": "Small open-faced sandwiches served as snacks or for lunch. They may be served hot or cold, but they are often elaborately garnished."},
        {"tag": "Canard",
        "response": "Duck"},
        {"tag": "Canard Sauvage",
        "response": "Wild duck"},
        {"tag": "Canela",
        "response": "Cinnamon"},
        {"tag": "Canelones",
        "response": "“cannelloni,” pasta tubes stu#ed with minced meats and bechamel sauce"},
        {"tag": "Canestrini",
        "response": "Small pasta used in soup."},
        {"tag": "Cangrejo",
        "response": "Crab"},
        {"tag": "Cangrejo or Jaiba",
        "response": "Crab"},
        {"tag": "Cannaroni",
        "response": "Wide, hollow, tubular pasta. A larger version of Ziti pasta."},
        {"tag": "Cannelloni",
        "response": "“big pipes”; this hollow cylindrical pasta is stu#ed and baked."},
        {"tag": "Cannelloni beans",
        "response": "White oval shaped beans are frequently used in Italian dishes."},
        {"tag": "Cannoli",
        "response": "A Sicilian specialty pastry named for its cannon-like shape. This elaborately flavored dough is rolled and shaped around a metal cylinder, then deep fried. When cooled, the crisp cookie-like tubes are filled with a sweetened ricotta mixture, pastry whipped cream, or sugary almond pistachio paste, and enriched with candied fruits or small bits of chocolate."},
        {"tag": "Cantaloupe",
        "response": "Melon"},
        {"tag": "Cantucci",
        "response": "Tuscan almond cookies that resemble small Biscotti."},
        {"tag": "Cantuccini",
        "response": "Tuscan almond cookies that resemble small Biscotti."},
        {"tag": "Capa",
        "response": "Layer"},
        {"tag": "Capellini",
        "response": "Literally “fine hair”; fine strands of pasta that are usually used in soup."},
        {"tag": "Caperberries",
        "response": "The fruit of the caper bush, which appear after the flowers. They are usually preserved in brine, and are most often served in the same way as olives, as a garnish for salads, or in a martini."},
        {"tag": "Capers",
        "response": "Sun-dried flower buds that are pickled in vinegar and salt brine. The pungent flavor offers piquancy to many sauces and condiments. Traditionally used as a garnish for meat and vegetable dishes."},
        {"tag": "Capicolla",
        "response": "A coarse Italian pork sausage. Usually highly seasoned, this sausage is served cold, thinly sliced, as for prosciutto."},
        {"tag": "Capocolla",
        "response": "Seasoned cured ham that is thinly sliced and served in antipasto platters."},
        {"tag": "Capon",
        "response": "A castrated chicken that is savored for its delicate taste and texture. Once castrated, the chicken would become fattened, yielding tender, juicy flesh. This method of raising chickens is not practiced much anymore, since most chickens are butchered at a young age and still very tender."},
        {"tag": "Caponata",
        "response": "Best known as a spread or cold salad containing eggplant, celery, tomatoes, raisins, and pine nuts seasoned with vinegar and olive oil. Modern variations will add other vegetables such as zucchini and season it with fresh herbs."},
        {"tag": "Capsicum",
        "response": "The family name for sweet and hot peppers."},
        {"tag": "Caracol",
        "response": "Snail"},
        {"tag": "Caramel",
        "response": "Melted sugar to the brown stage"},
        {"tag": "Caramelize",
        "response": "A process of cooking sugar (usually with oil or butter) until it begins to color; foods containing natural sugars will caramelize in their own sugars"},
        {"tag": "Caramelize to",
        "response": "To cook to release natural sugars, or until reaching brown color"},
        {"tag": "Carbonara",
        "response": "A rich sauce made with cream, eggs, Parmesan or Pecorino Romano cheese, sauteed pieces of bacon, and vegetables."},
        {"tag": "Carbonnade",
        "response": "Braised steak"},
        {"tag": "Carcasse",
        "response": "Bone structure without the meat"},
        {"tag": "Cardamom",
        "response": "Aromatic seeds used for baking, flavoring coffee and exotic Scandinavian and Indian dishes. Excellent when freshly ground. Botanical name: Elettaria cardamomum."},
        {"tag": "Cardinal",
        "response": "Fish dishes which have sauces made with lobster fumet and are garnished with lobster meat."},
        {"tag": "Cardoon",
        "response": "A vegetable from the artichoke family that looks like celery. Cardoons may be eaten raw or cooked and served like any vegetable."},
        {"tag": "Carnaroli",
        "response": "Premium firm Risotto rice"},
        {"tag": "Carne",
        "response": "Meat"},
        {"tag": "Carne de Res",
        "response": "Beef"},
        {"tag": "Carne De Salchicha",
        "response": "Sausage meat"},
        {"tag": "Carne Picada",
        "response": "Minced meat"},
        {"tag": "Carnero",
        "response": "Lamb"},
        {"tag": "Carnes",
        "response": "Meats"},
        {"tag": "Carob",
        "response": "The seed from the carob tree which is dried, ground, and used primarily as a substitute for chocolate."},
        {"tag": "Carpaccio",
        "response": "A raw beef appetizer topped with a mustard-mayonnaise sauce or olive oil and parmesan cheese. Often paired with raw white truffles."},
        {"tag": "Carpe",
        "response": "Carp"},
        {"tag": "Carre",
        "response": "Rack of veal or lamb"},
        {"tag": "Carrelet",
        "response": "Flounder"},
        {"tag": "Cartouche",
        "response": "A greased round of paper used to cover meats during cooking process"},
        {"tag": "Cáscara",
        "response": "“Shell” in Spanish. Usually refers to citrus rinds."},
        {"tag": "Caserola",
        "response": "Saucepan, pan"},
        {"tag": "Casqueria",
        "response": "Variety meats, offal"},
        {"tag": "Casserole",
        "response": "A fireproof dish, or food prepared in a casserole dish"},
        {"tag": "Cassis",
        "response": "Black currant & black currant liqueur"},
        {"tag": "Cassoulet",
        "response": "A dish from southwest France consisting of white beans and an assortment of meats such as confit, lamb, pork, and Toulouse sausage. The dish is enriched with large amounts of duck fat and is baked until the top is brown and crispy. Can sometimes include seafood and lentils. Served alone or with a light, bitter salad."},
        {"tag": "Castaña",
        "response": "Chestnut"},
        {"tag": "Caul Fat",
        "response": "The stomach lining of pork which is used in place of back fat for pates and to encase crepinettes."},
        {"tag": "Cava",
        "response": "A type of quality Spanish sparkling white wine produced by the bottle fermentation method, Methode Champenoise."},
        {"tag": "Cavatelli",
        "response": "Small shell-shaped pasta with slightly rolled-in edges. Served best with chunky sauces, and salads requiring pasta that will hold sauces and dressings. Simil Gnocchetti and Rotini."},
        {"tag": "Caviar",
        "response": "These are the eggs of sturgeon that have been salted and cured. Grading for caviar is determined by the size and color of the roe and the species of the sturgeon. Beluga caviar, which is the most expensive of the three types of caviar, are dark gray in color and are the largest eggs. Ossetra caviar are light to medium brown and are smaller grains than beluga. Sevruga caviar are the smallest grains, the firmest in texture and are also gray in color. Pressed caviar is made of softer, lower quality eggs and have a stronger, fishier flavor. The term malossol is used to describe the amount of salt used in the initial curing process. The roe from other fish such as salmon, lumpfish, and whitefish are not considered caviar, regardless of their label. They should be addressed as roe. Caviar should be served as simply as possible. Traditional accompaniments, inspired by the Russians, are sour cream, blinis, and ice cold vodka. Lemon and mince onion are often served with caviar, but their flavors will only detract from the pure delicate flavor of the caviar."},
        {"tag": "Cayenne",
        "response": "A hot red pepper"},
        {"tag": "Cayenne Pepper",
        "response": "Made from drying and grinding the small orange-red fruits of several pungent species of the bell pepper family, native to the Cayenne region of French Guyana in northern South America. Due to its heat, it should be used sparingly. An ingredient in picante pimentón de la Vera."},
        {"tag": "Cazón",
        "response": "Dogfish, shark"},
        {"tag": "Cazuelas",
        "response": "Terra cotta earthenware dishes which are glazed on the inside and normally unfinished on the outside. They are the most common pieces of Spanish cooking equipment, it retains heat long after the dish has been removed from the stove. These dishes, usually wide and shallow, come in individual as well as casserole sizes. If earthenware frequently are in Spain, they should first be cured in water to prevent cracking. An alternative is to place a metal mesh burner cover over the flame to better distriute heat."},
        {"tag": "Cebolla",
        "response": "Onion"},
        {"tag": "Cebolla De Verdeo",
        "response": "Scallion (young onion)"},
        {"tag": "Cebolleta",
        "response": "Shallot"},
        {"tag": "Cebollita",
        "response": "Green Onion"},
        {"tag": "Cecina",
        "response": "Dry-cured beef, typical of Castilla-León, where it is salted, smoked, and cured. As with dry cured jamón serrano, cecina is served very thinly sliced."},
        {"tag": "Celeri-rave",
        "response": "Celeriac or celery root"},
        {"tag": "Celeriac",
        "response": "The root of a type of celery with a firm texture and a clean, sweet flavor of celery."},
        {"tag": "Cellophane Noodles",
        "response": "These thin, translucent, flavorless threads of noodle, made from green gram flour, provide texture to the base of soup and stir fried dishes."},
        {"tag": "Celsius",
        "response": "a temperature scale in which 0 (zero) is freezing and 100 degrees is boiling or steaming"},
        {"tag": "Cena",
        "response": "Supper, evening meal served later in the evening, after tapas"},
        {"tag": "Cepe",
        "response": "Edible fungus, native to the mushroom family"},
        {"tag": "Cepes",
        "response": "A wild mushroom of the boletus family known for their full flavor and meaty texture."},
        {"tag": "Cepillo",
        "response": "Brush"},
        {"tag": "Cerdo",
        "response": "Pork"},
        {"tag": "Cerdo Picado",
        "response": "Minced pork"},
        {"tag": "Cerfeuil",
        "response": "Chervil"},
        {"tag": "Cerise",
        "response": "Cherry"},
        {"tag": "Cerveceria",
        "response": "Beer bar"},
        {"tag": "Cervelle",
        "response": "Brain"},
        {"tag": "Cerveza",
        "response": "Beer"},
        {"tag": "Cervil",
        "response": "A mild-flavored member of the parsley family, this aromatic herb has curly, dark green leaves with an elusive anise flavor. Though most chervil is cultivated for its leaves alone, the root is edible and was, in fact, enjoyed by early Greeks and Romans. Today it is available dried but has the best flavor when fresh. Both forms can be found in most supermarkets. It can be used like parsley but its delicate flavor can be diminished when boiled."},
        {"tag": "Ceviche",
        "response": "A South American seafood dish typically made from fresh raw fish cured in citrus juices."},
        {"tag": "Chaat",
        "response": "Salty snacks served with an array of sweet and spicy chutneys."},
        {"tag": "Chai",
        "response": "The Indian name for tea, often served with milk and sugar."},
        {"tag": "Chakin Sushi",
        "response": "Vinegar rice wrapped in a thin egg crepe."},
        {"tag": "Chakin Zushi",
        "response": "Vinegar rice wrapped in a thin egg crepe."},
        {"tag": "Champignon",
        "response": "Mushroom"},
        {"tag": "Champiñones",
        "response": "Mushrooms"},
        {"tag": "Chanterelle",
        "response": "A wild mushroom with a golden color and a funnel-shaped cap. The whole mushroom is edible and is savored for its exquisite flavor and firm texture when cooked."},
        {"tag": "Chanterelles",
        "response": "Mushrooms"},
        {"tag": "Chantilly",
        "response": "This is a name for sweetened whipped cream flavored with vanilla. The term may also be used to describe sauces that have had whipped cream folded into them. This includes both sweet and savory sauces."},
        {"tag": "Chapelure",
        "response": "Bread crumbs"},
        {"tag": "Chappati",
        "response": "Unleavened Indian flatbread made from wheat flour, water, oil, and salt. This bread is traditionally cooked on a tawa, and then brushed with ghee."},
        {"tag": "Charcuterie",
        "response": "The French word for the variety of pork preparations that are cured, smoked, or processed. This includes sausages, hams, pates, and rillettes. This term may also be used to mean the shop in which these products are sold."},
        {"tag": "Charcutier",
        "response": "Butcher and sausage maker"},
        {"tag": "Charlotte",
        "response": "The name for two different desserts. The first preparation is made of slices of bread which are lined in a mold, filled with fruit, and baked until the bread acquires a golden color and crisp texture. The second version, similar to the first, lines a mold with cake or lady fingers and is filled with a bavarian cream. These may also be filled with whipped cream or even a fruit mousse. More elaborate versions layer the cake with jam, then slices of this cake is used to line the mold."},
        {"tag": "Charmoula",
        "response": "A sauce and marinade used in Middle Eastern cooking made of stewed onions flavored with vinegar, honey and a spice mixture called “rasel hanout”. This is a complex spice mixture containing cinnamon, black pepper, cloves, cumin and sometimes paprika and coriander. This sauce is used on meat and fish and can even be adjusted to make a unique vinaigrette."},
        {"tag": "Chateaubriand",
        "response": "A thick slice of beef from the heart of the tenderloin, grilled or sauteed and simply sauced. Many restaurants claim their chateaubriand to be the head of the tenderloin, cut for two, which is roasted and carved tableside."},
        {"tag": "Chaud-froid",
        "response": "hot, cold; Food coated with cold, white sauce"},
        {"tag": "Chawal",
        "response": "ice"},
        {"tag": "Chayote",
        "response": "A pear shaped squash, used in Latin American cooking, with a taste of zucchini. Chayote may be eaten raw or cooked as you would any summer squash."},
        {"tag": "Chef de Cuisine",
        "response": "Chef in charge/executive chef"},
        {"tag": "Chef de partie",
        "response": "Chef in charge of a section of the kitchen"},
        {"tag": "Cherimoya",
        "response": "Also called the custard apple, this is a tropical fruit with a creamy texture and sweet pineapple flavor."},
        {"tag": "Chevre",
        "response": "The French word for goat, generally referring to goat’s milk cheeses."},
        {"tag": "Chevreuil",
        "response": "Venison"},
        {"tag": "Chiboust",
        "response": "A custard made originally as the filling for the gâteau Saint-Honor, consisting of pastry cream lightened with Italian meringue and stabilized with gelatin."},
        {"tag": "Chicharron",
        "response": "Crispy fried pigskin used in Mexican cooking for salads, fillings and snacks."},
        {"tag": "Chicken Tempura",
        "response": "Chicken and vegetables lightly fried"},
        {"tag": "Chicoree",
        "response": "Endive"},
        {"tag": "Chicory",
        "response": "sometimes called curly endive; a type of lettuce (chicory root is sometimes used as a coffee substitute)"},
        {"tag": "Chiffon",
        "response": "a filling made light and fluffy with beaten egg whites or whipped cream"},
        {"tag": "Chiffonade",
        "response": "A very fine julienne of vegetables usually associated with leafy herbs, lettuces, or greens."},
        {"tag": "Chiffonnade",
        "response": "A ribbon like cut of leafy vegetables ie;lettuce"},
        {"tag": "Chikuwa",
        "response": "Browned fish cake with a length-long gap."},
        {"tag": "Chilaquiles",
        "response": "Crushed corn tortilla chips cooked with shredded chicken, enchilada salsa, stir fried onions, spices, and melted cheese."},
        {"tag": "Chili Bean Sauce",
        "response": "A thick, spicy sauce made from fermented soybeans, red chili peppers, vinegar, starch, salt, and garlic."},
        {"tag": "Chili Rellenos",
        "response": "A Mexican dish consisting of a batter-fried, cheese stuffed, pablano chili pepper."},
        {"tag": "Chilindrón",
        "response": "sauce of tomato, pepper, onion, and ham, most commonly applied to chicken and lamb, typical of Aragon"},
        {"tag": "Chimichanga",
        "response": "Fried flour tortilla stuffed with chicken, beef, lamb, pork or vegetables, and smothered with melted cheese and tomato salsa."},
        {"tag": "Chinese Dried Sausage",
        "response": "Sweet, salty, pork sausage that resembles pepperoni."},
        {"tag": "Chinois",
        "response": "A “China Cap,” a very fine conical strainer."},
        {"tag": "Chipirones",
        "response": "baby squid"},
        {"tag": "Chipirones En Su Tinta",
        "response": "baby squid cooked in their own ink"},
        {"tag": "Chipolata",
        "response": "A type of small sausage or/a type of pastry used for eclairs"},
        {"tag": "Chipotle",
        "response": "A dried and smoked jalapeño which can be found dried or reconstituted and sold in tomato sauce. These chiles are extremely hot and caution should be taken when using them in cooking."},
        {"tag": "Chirashi Sushi",
        "response": "Literally “scattered Sushi”; an assortment of sliced raw fish and vegetables served on a bed of Sushi rice."},
        {"tag": "Chirashi Zushi",
        "response": "Literally “scattered Sushi”; an assortment of sliced raw fish and vegetables served on a bed of Sushi rice."},
        {"tag": "Chiringuito",
        "response": "beach bar/shack"},
        {"tag": "Chive",
        "response": "Related to the onion and leek, this fragrant herb has slender, vivid green, hollow stems. Chives have a mild onion flavor and are available-round. They are a good source of vitamin A and also contain a fair amount of potassium and calcium.fresh year"},
        {"tag": "Chocolate",
        "response": "A product of cocoa beans in which the chocolate liquor is mixed with cocoa butter in various proportions to produce the different varieties of chocolate. Bitter chocolate has no additional ingredients added. Other varieties of chocolate have additional cocoa butter added, along with sugar, milk, and vanilla."},
        {"tag": "Chocolate de Taza",
        "response": "rich dark chocolate drink thickened with a slight amount of rice flour."},
        {"tag": "Chocos",
        "response": "small cuttlefish"},
        {"tag": "Chop",
        "response": "to cut into non-uniformed pieces or rough cut"},
        {"tag": "Chop Suey",
        "response": "A dish consisting of small pieces of meat or chicken cooked with bean sprouts and vegetables. Served with rice."},
        {"tag": "Chorizo",
        "response": "A spicy pork sausage common in Hispanic countries, ranging in seasoning from mild and sweet to fiercely hot. It comes in fresh, smoked, or cured versions."},
        {"tag": "Choron",
        "response": "A variation of Bearnaise sauce with tomato puree or concasse added."},
        {"tag": "Chorrito",
        "response": "dash"},
        {"tag": "Chou-fleur",
        "response": "Cauliflower"},
        {"tag": "Choucroute",
        "response": "French word for “sauerkraut.”"},
        {"tag": "Chounk",
        "response": "A melange of spices, herbs, oil, and vegetables that flavors many Indian dishes."},
        {"tag": "Chufa Nut Strainer",
        "response": "Used to make horchata, it is a conical strainer with an ultra-fine mesh which is used with a tapered wooden pestle to strain and press down chifa nuts to make a very smooth puree."},
        {"tag": "Churro",
        "response": "a fritter, deep-fried tube of batter, often eaten with thick drinking chocolate (chocolate de taza)"},
        {"tag": "Chutney",
        "response": "The name for a large range of sauces or relishes made with fruits, vegetables, and herbs. Commonly used in East Indian cooking. Fresh chutneys have a bright, clean flavor and are usually thin, smooth sauces. Cilantro, mint, and tamarind are common in fresh chutney. Cooked chutneys have a deeper, broader flavor."},
        {"tag": "Chutoro",
        "response": "A marbled-tuna roll"},
        {"tag": "Ciabatta",
        "response": "Flattish slipper-shaped loaves of bread with a pale crisp crust that is made with olive oil, and flavored with fresh or dried herbs, olives, or sun dried tomatoes. Delicious when served warm or used for sandwiches."},
        {"tag": "Cilantro",
        "response": "Fresh, green Coriander"},
        {"tag": "Cinnamon",
        "response": "The highly aromatic inner bark of several laurel trees native to Sri Lanka and the East Indies can be rolled and sold as quills or sticks, or ground into a spice. Cinnamon can be used to flavor both sweet and savory dishes."},
        {"tag": "Cioppino",
        "response": "A rich fish stew from San Francisco made with shrimp, clams, mussels, crabs, and any available fish. The broth is flavored with tomato, white wine, garlic, and chile flakes. This stew needs no other courses served but a simple green salad and a lot of sourdough bread."},
        {"tag": "Ciruela",
        "response": "plum"},
        {"tag": "Ciruela Seca",
        "response": "dried plum, prune"},
        {"tag": "Civet",
        "response": "A French stew usually containing game, though duck and goose are used. The meat is marinated in red wine for long periods of time, then stewed with pearl onions and bacon. The sauce was once thickened with blood, but that is a method not used much anymore."},
        {"tag": "Clafouti",
        "response": "A dessert of fruit, originally cherries, covered with a thick batter and baked until puffy. The dessert can be served hot or cold."},
        {"tag": "Clara De Huevo",
        "response": "egg white"},
        {"tag": "Clarify",
        "response": "a process of making a liquid clear; removing milk solids and impurities from butter resulting in a pure golden liquid butter used for many cooking purposes"},
        {"tag": "Clavo de Olor",
        "response": "clove"},
        {"tag": "Clotted Cream",
        "response": "This specialty of Devonshire, England (which is why it is also known as Devon cream) is made by gently heating rich, unpasteurized milk until a semisolid layer of cream forms on the surface. After cooling the thickened cream is removed. It can be spread on bread or spooned atop fresh fruit or desserts. The traditional English “cream tea” consists of clotted cream and jam served with scones and tea. Clotted cream can be refrigerated, tightly covered, for up to four days."},
        {"tag": "Clouter",
        "response": "Onion cloute; an onion studded with cloves; Verb"},
        {"tag": "Coat",
        "response": "to cover food with another product"},
        {"tag": "Cocer Al Horno",
        "response": "bake"},
        {"tag": "Cochinillo",
        "response": "suckling pig"},
        {"tag": "Cocido",
        "response": "long simmered stew based on chickpeas or other legumes, which includes vegetables, meats, and embutidos / sausages"},
        {"tag": "Cocina Casera",
        "response": "good home cooking, plain fare"},
        {"tag": "Cocinar",
        "response": "cook"},
        {"tag": "Cocinar A Fuego Lento",
        "response": "simmer"},
        {"tag": "Coco",
        "response": "Coconut"},
        {"tag": "Cocoa En Polvo",
        "response": "cocoa powder"},
        {"tag": "Cocoa Powder",
        "response": "This is the dried powder formed from chocolate liquor after the cocoa butter content has been reduced. This mixture is then dried and ground into a fine powder. Dutch process cocoa has been treated with alkali to give a darker appearance and less bitter taste. Breakfast cocoa has sugar, milk solids, and other flavorings added to it."},
        {"tag": "Coconut Milk",
        "response": "This is not the liquid that is found in the center of coconuts, but a thick liquid made by steeping fresh grated coconut in hot water. The hot water helps to extract the fat from the coconut meat, which carries so much of this flavor."},
        {"tag": "Cocotte",
        "response": "An oven proof dish (small)"},
        {"tag": "Codfish",
        "response": "A favorite in Spain since medieval times -brought by the vast Spanish fishing fleet. It has distinctive flavor which is best enjoyed when the bacalao is prepared with a sauce, such as the Basque bacalau al pil pil, or a parsley based green sauce alone. Look for cod that is well dried and white – preferably with the skin on for baked dishes, although cod that has been boned and skinned before drying is easier to handle. To rehydrate and remove the excess salt Bacalao needs a soaking period of about 24 hourst."},
        {"tag": "Codorniz",
        "response": "quail"},
        {"tag": "Coeur à la Crème",
        "response": "Meaning “the heart of the cream”, this is a soft cheese dessert where the mixture is drained in a mold to help it set. The cheese is then turned out onto a platter and served with fruit and bread."},
        {"tag": "Coeur e la Creme",
        "response": "Meaning “the heart of the cream”, this is a soft cheese dessert where the mixture is drained in a mold to help it set. The cheese is then turned out onto a platter and served with fruit and bread. Alternate versions use mixtures of ricotta and cream cheese and flavored with liquor and citrus juice. This is then molded and served with a berry coulis."},
        {"tag": "Cogollo",
        "response": "lettuce heart, also dwarf lettuce"},
        {"tag": "Col",
        "response": "cabbage"},
        {"tag": "Colar",
        "response": "strain"},
        {"tag": "Coliflor",
        "response": "cauliflower"},
        {"tag": "Collard Greens",
        "response": "One of a variety of “greens” with a firm leaf and sharp flavor."},
        {"tag": "Colombo",
        "response": "A West Indian stew seasoned with a spice mixture of the same name. This is similar to curry powder, containing coriander, chiles, cinnamon, nutmeg, saffron, and garlic. The stew may contain pork, chicken, or fish. Vegetables are cooked in the stew and rice and beans are served on the side."},
        {"tag": "Colorante Alimenticio",
        "response": "food coloring"},
        {"tag": "Combinar",
        "response": "combine"},
        {"tag": "Combine",
        "response": "mixing ingredients together"},
        {"tag": "Comedor",
        "response": "dining room"},
        {"tag": "Comida",
        "response": "meal, dinner, lunch"},
        {"tag": "Comida Chatarra",
        "response": "junk food"},
        {"tag": "Comino",
        "response": "cumin"},
        {"tag": "Comiso",
        "response": "packed lunch"},
        {"tag": "Commis",
        "response": "Apprentice in the kitchen or dining room"},
        {"tag": "Compangu",
        "response": "refers to meats and embutidos used in fabada with lamb"},
        {"tag": "Completamente",
        "response": "thoroughly"},
        {"tag": "Compote",
        "response": "A French dessert made from fresh or dried fruit cooked in sugar syrup."},
        {"tag": "Concasse",
        "response": "The term for chopping a vegetable coarsely. This is used most often when referring to chopped tomatoes."},
        {"tag": "Concasser",
        "response": "to chop roughly(usually tomatoes)"},
        {"tag": "Conchiglie",
        "response": "Large shell shaped pasta noodles. These are often stuffed and baked au gratin."},
        {"tag": "Concombre",
        "response": "cucumber"},
        {"tag": "Condimento",
        "response": "seasoning"},
        {"tag": "Conejo",
        "response": "rabbit"},
        {"tag": "Confit",
        "response": "This is a preparation for meat to preserve it for long periods of time when fresh meat would be scarce. The meat is first salted to remove moisture. It is then cooked at the lowest of simmers, submerged in fat, until the meat is buttery tender. After the meat is cooled, it is stored in crocks and covered with the fat to prevent exposure to air. The whole crock is stored to help age the meat. During this aging period the meat develops a new flavor, completely different from its original state. When ready to eat, the meat is fried in a skillet or grilled until the skin is crisp and the meat is warmed through. Duck confit was once served with potatoes fried in the same duck fat as the confit. This practice is less popular now, but good companions to the confit are lentils or bitter green salads to balance the richness of the meat. Fatty meats such as duck, goose, and pork work best in confit. Confit is an indispensable component in cassoulet."},
        {"tag": "Confiture",
        "response": "Jam"},
        {"tag": "Congelado",
        "response": "frozen"},
        {"tag": "Congelador",
        "response": "Freezer"},
        {"tag": "Congrio",
        "response": "conger eel"},
        {"tag": "Conservante",
        "response": "preservative"},
        {"tag": "Conservar",
        "response": "preserve"},
        {"tag": "Consistencia",
        "response": "consistency"},
        {"tag": "Consomme",
        "response": "A clarified broth used as a base for sauces and soups."},
        {"tag": "Copos De Avena",
        "response": "oats"},
        {"tag": "Coppa",
        "response": "The loin or shoulder of pork that is cured, cooked and dried. It is served thinly sliced for antipasto or on sandwiches or pizza."},
        {"tag": "Coq au Vin",
        "response": "A chicken stewed in red wine, flavored with bacon, mushrooms, and pearl onions."},
        {"tag": "Coquille",
        "response": "Cooked and served in a shell"},
        {"tag": "Coquille St Jacques",
        "response": "A scallop"},
        {"tag": "Corazones De Alcachofa",
        "response": "artichoke hearts"},
        {"tag": "Corbeille",
        "response": "Basket"},
        {"tag": "Cordero",
        "response": "lamb"},
        {"tag": "Core",
        "response": "remove the center of fruits"},
        {"tag": "Coriander",
        "response": "A dried, warm, sweet, light-brown, aromatic herb. This zesty combination of sage and citrus is considered one of the most memorable and versatile of all the spices. Coriander, typically blended with cumin, curry powders, chili powders, garam masala, berbere, fruit juices, and lemon, flavors marinades and enhances North American, Mediterranean, North African, Mexican, Indian, and Southeast Asian cuisines."},
        {"tag": "Corn Syrup",
        "response": "Dextrose, maltose, or glucose obtained by converting starch with acids. This syrup is used in baking, primarily to prevent the crystallization of sugar."},
        {"tag": "Corser",
        "response": "To flavor and enrich"},
        {"tag": "Cortado En Cuatro",
        "response": "quartered"},
        {"tag": "Cortar",
        "response": "trim"},
        {"tag": "Cortar En Cuadritos",
        "response": "diced"},
        {"tag": "Cortar En Lonchas Finas",
        "response": "thinly sliced"},
        {"tag": "Cortijo",
        "response": "country house, farmhouse, esp. in Andalusia"},
        {"tag": "Costillas",
        "response": "spare ribs"},
        {"tag": "Cote",
        "response": "A cut of meat; a piece of meat attached to the rib(cote de boeuf)"},
        {"tag": "Cotechino",
        "response": "A fresh pork sausage with a very fine consistency and delicate flavor. It contains a small amount of ground pork rind, coteca in Italian, thus giving it the name.It is a large sausage, about 3″X 9″, used in stews and pasta e fagioli."},
        {"tag": "Cotelette",
        "response": "cutlet"},
        {"tag": "Coulibiac",
        "response": "A Russian pie made with alternating layers of salmon, hard cooked eggs, rice, mushroom duxelle, and vesiga. Vesiga is the spinal marrow of sturgeon and has all but disappeared from commercial markets. The dough used to wrap the pie can be pate brisee, puff pastry, or brioche dough. Crepes are often layered in the bottom of the pie."},
        {"tag": "Coulis",
        "response": "A puree of fruit or vegetables, used as a sauce or flavoring agent to other sauces or soups. As sauces, they are thinned down just enough to reach the proper consistency, but not so much as to alter the intense flavor of the puree."},
        {"tag": "Couper",
        "response": "to cut"},
        {"tag": "Coupes",
        "response": "small bowls"},
        {"tag": "Courgette",
        "response": "The French word for zucchini."},
        {"tag": "Court Bouillon",
        "response": "A poaching liquid used to cook fish, etc."},
        {"tag": "Couscous",
        "response": "A pasta made from semolina (which itself is a flour made from Durum wheat).The name couscous also refers to the famous Maghreb dish in which semolina or cracked wheat is steamed in the perforated top part of a special pot called a couscoussiere, while chunks of meat (usually chicken or lamb), various vegetables, chickpeas and raisins simmer in the bottom part. The cooked semolina is heaped onto a large platter, with the meats and vegetables placed on top. Diners use chunks of bread to scoop the couscous from the platter."},
        {"tag": "Crackling",
        "response": "Crispy pieces of skin remaining after the fat is rendered. Commonly made from pork, duck, and goose it is used in salads, stuffings, and seasonings."},
        {"tag": "Cream",
        "response": "This is the portion of milk that rises to the top when milk has not been homogenized. Cream is defined by its varying amounts of butterfat content. Half and half cream is a mixture of milk and cream, resulting in a butterfat content of 12%. Sour cream and light cream have a butterfat content of 18-20%. Heavy cream will have no less than 30% butterfat, averages around 36%, and will go as high as 40%."},
        {"tag": "Crema",
        "response": "Cream"},
        {"tag": "Crema Catalana",
        "response": "a traditional Catalan custard with a caramel crust, similar to creme brulee"},
        {"tag": "Creme",
        "response": "cream"},
        {"tag": "Creme Anglaise",
        "response": "This is a custard made of milk and eggs. It is used both as a sauce for desserts and as a base for mousses."},
        {"tag": "Creme Caramel",
        "response": "Like the Spanish flan, this is a baked custard that is flavored with caramel. When the dish is inverted, the caramel creates a sauce for the dessert."},
        {"tag": "Creme Fraiche",
        "response": "A naturally thickened fresh cream that has a sharp, tangy flavor and rich texture. This is an expensive item to buy, but a good substitute can be made by mixing heavy cream with uncultured buttermilk and allowed to stand, well covered, in a tepid place until thickened."},
        {"tag": "Creme Patissierre",
        "response": "This is a thick pastry cream made of milk, eggs, and flour. Other versions of this use all or a portion of cornstarch."},
        {"tag": "Crepaze",
        "response": "A cake made of crepes layered with vegetables, cheese, or ham. The cake is then baked to blend the flavors and help set it so that it may be cut into wedges."},
        {"tag": "Crepe",
        "response": "A very thin pancake used for sweet and savory fillings."},
        {"tag": "Crepinette",
        "response": "A small sausage patty wrapped in caul fat. They are filled with ground pork, veal, or poultry and fried or grilled. Some are shaped into balls. You may also use cooked meat or vegetables to flavor a forcemeat in the crepinette."},
        {"tag": "Crespelle",
        "response": "An Italian pancake, similar to a crˆpe, used in place of pasta in preparations of dishes like manicotti and cannelloni."},
        {"tag": "Crevette (grise)",
        "response": "Shrimp"},
        {"tag": "Crevette (rose)",
        "response": "Prawn"},
        {"tag": "Croissants",
        "response": "Crescent shaped french rolls"},
        {"tag": "Croque-Monsieur",
        "response": "The French version of a grilled ham and cheese sandwich with Gruyere cheese."},
        {"tag": "Croquembouche",
        "response": "A grand dessert made up of cream puffs that are dipped in caramel and assembled into a large pyramid shape. The whole dessert is then brushed with more caramel and elaborately decorated."},
        {"tag": "Croquetas",
        "response": "breaded croquettes filled with a thick bechamel, incorporating chopped ham, boiled egg, chicken."},
        {"tag": "Croquette",
        "response": "A thick patty made up of cooked foods. These patties or balls are breaded and fried or saut‚ed. Vegetables, fish, or meat may be used in croquettes."},
        {"tag": "Crostini",
        "response": "Toasted bread slices which are brushed with olive oil and served with tomatoes, pumate, cheese, chicken liver mousse, bean puree, or tapenade. See also canapé."},
        {"tag": "Croustade",
        "response": "pastry crust"},
        {"tag": "Croutons",
        "response": "Bread that is cut into smaller pieces and toasted or fried until crisp. This includes cubes for salads and slices for soups and hors d’oeuvres."},
        {"tag": "Cru",
        "response": "raw"},
        {"tag": "Crudite",
        "response": "A selection of raw vegetables served with a dip."},
        {"tag": "Crudo",
        "response": "Term that often means raw or rare"},
        {"tag": "Crujiente, Crocante",
        "response": "crispy"},
        {"tag": "Crush",
        "response": "to reduce food to small particles using a tool (rolling pin or mortar and pestle)"},
        {"tag": "Cuajar",
        "response": "curdle"},
        {"tag": "Cuajo",
        "response": "rennet"},
        {"tag": "Cube",
        "response": "to cut up into regular sizes"},
        {"tag": "Cubrir",
        "response": "cover"},
        {"tag": "Cuchara",
        "response": "tablespoon"},
        {"tag": "Cuchara para Medir",
        "response": "measuring spoon"},
        {"tag": "Cucharada",
        "response": "tablespoon"},
        {"tag": "Cucharadita, Cucharilla",
        "response": "teaspoon"},
        {"tag": "Cucharones",
        "response": "ladles"},
        {"tag": "Cuenco",
        "response": "bowls"},
        {"tag": "Cuire",
        "response": "to cook"},
        {"tag": "Cuisine Brigade",
        "response": "Staff organization set up within the kitchen"},
        {"tag": "Cuit",
        "response": "cooked"},
        {"tag": "Culantro",
        "response": "An herb grown in Latin America. Not to be confused with cilantro. Though the two are related, culantro has a larger leaf and is usually used cooked."},
        {"tag": "Culatello",
        "response": "The heart of the prosciutto."},
        {"tag": "Cumberland Sauce",
        "response": "An English sauce used for ham, game, and pâtés. The sauce is made of currant jelly mixed with lemon and orange juice and port wine."},
        {"tag": "Cumin",
        "response": "indigenous to the eastern Mediterranean, cumin whole or ground cumin seeds to flavor savory dishes and breads. The pungent,nutty flavor can be enhanced by dry roasting before use."},
        {"tag": "Curry",
        "response": "A spicy powder made by grinding and blending various herbs and spices, including cardamom, cinnamon, cumin, cloves, fenugreek, red peppers, and nutmeg."},
        {"tag": "Curry Powder",
        "response": "This is a mix of spices that we have come to know of by the Muslim variety found in stores. Yet this is a mixture that is unique to everyone’s kitchen. They may be mild with spices like cumin, fennel, and coriander; or heated up a bit with chiles and pepper; or fragrant with cinnamon and saffron. All of these are considered curry powders and all of them have distinctly different applications. Look under the definition for garam masala for more information."},
        {"tag": "Cuscurro",
        "response": "crouton"},
        {"tag": "Cut In",
        "response": "the process of combining solid fat (such as butter or shortening) with a dry ingredient (such as flour) until small pea-size particles are formed; as is done when making pie crust or biscuits"},
        {"tag": "Cuttlefish",
        "response": "A cousin to the squid, that is also prized for its ink sac as well as its flesh."},
        {"tag": "Dacquoise",
        "response": "A cake made of nut meringues layered with whipped cream or buttercream. The nut meringue disks are also referred to as dacquoise."},
        {"tag": "Dahi",
        "response": "Yogurt"},
        {"tag": "Daikon",
        "response": "A sharp, but somewhat sweet-tasting, crunchy Chinese white radish often used to season salads, soups, vegetables, tofu, and stir fried dishes."},
        {"tag": "Dal",
        "response": "A puree of lentils, peas, and/or beans. Daal complements the main dish and serves as an essential protein supplement to meatless diets. Sometimes spelled as “daal” or “dhal.”"},
        {"tag": "Dalchini",
        "response": "Cinnamon"},
        {"tag": "Dango",
        "response": "Balls of Mochi served on bamboo skewers."},
        {"tag": "Darne",
        "response": "a thick steak cut of salmon"},
        {"tag": "Dash",
        "response": "about 1/16th of a teaspoon; a “pinch” or less"},
        {"tag": "Dashi",
        "response": "A basic soup and cooking Stock made from fish and seaweed. Often topped with dried Bonito tuna flakes."},
        {"tag": "Daube",
        "response": "A stew consisting of a single piece of meat such as a shoulder or joint. The meat is stewed in a rich, wine laden broth with herbs and vegetables. The broth is then thickened, reduced and served with the slices of meat and accompanying vegetables."},
        {"tag": "Dauphine",
        "response": "The name for little puffs made of potato puree, that are mixed with choux paste and deep fried."},
        {"tag": "Dauphinoise",
        "response": "The name of a potato gratin with lots of cream and garlic, all topped with Gruyere cheese."},
        {"tag": "De Grano Grueso",
        "response": "coarse"},
        {"tag": "De Horno",
        "response": "ovenproof"},
        {"tag": "Debarrasser",
        "response": "to clear away"},
        {"tag": "Debrider",
        "response": "to remove trussing twine after cooking process"},
        {"tag": "Deep Fry",
        "response": "to cook submerged in very hot fat (like French fries) until golden brown"},
        {"tag": "Deglacer",
        "response": "To dilute the roasting plaque with an acid (wine, etc.)"},
        {"tag": "Deglaze",
        "response": "A process of adding liquid to a hot pan in order to collect the bits of food which stick to the pan during cooking. This is most common with sautéed and roasted foods. Wine, stock, and vinegar are common deglazing liquids."},
        {"tag": "Degraisser",
        "response": "To skin off grease from stews, sauces etc."},
        {"tag": "Dégustacion",
        "response": "tasting or sampling of food or drink"},
        {"tag": "Dehuesado",
        "response": "boned"},
        {"tag": "Dejar En Adobo, Marinar",
        "response": "marinade, marinate"},
        {"tag": "Demi-glace",
        "response": "Half glaze, usually meaning Brown Sauce made from veal bones"},
        {"tag": "Demi-Tasse",
        "response": "meaning “half Cup”or, a small cup of black coffee"},
        {"tag": "Denomination De Origen",
        "response": "an official system of quality control and protecting the quality and authenticity of speciality products and wines"},
        {"tag": "Dentice",
        "response": "Snapper (fish)"},
        {"tag": "Depouiller",
        "response": "To remove scum from the surface of a cooking liquid"},
        {"tag": "Derretido",
        "response": "melted"},
        {"tag": "Derretir",
        "response": "melt"},
        {"tag": "Des",
        "response": "to dice"},
        {"tag": "Desalar",
        "response": "to remove the salt from a salt cured product, such as cod or bacalao, by soaking it in water"},
        {"tag": "Desayuno",
        "response": "breakfast"},
        {"tag": "Descamar",
        "response": "remove scales from fish"},
        {"tag": "Desgrasar",
        "response": "skimming fat from the surface of a soup"},
        {"tag": "Desosser",
        "response": "To debone poultry or fish"},
        {"tag": "Despensa",
        "response": "larder"},
        {"tag": "Despepar",
        "response": "to remove the seeds or stones from fruit or vegetables"},
        {"tag": "Devil",
        "response": "to add hot, spicy ingredients (pepper, Tabasco, cayenne, mustard) to a food"},
        {"tag": "Devon Cream",
        "response": "Please see “Clotted Cream”"},
        {"tag": "Dhania",
        "response": "Cilantro or coriander"},
        {"tag": "Dhokla",
        "response": "Steamed batter bread"},
        {"tag": "Diablotins",
        "response": "Small gnocchi or croutons topped with grated cheese and browned"},
        {"tag": "Diavolillo",
        "response": "The super hot chili typically infused into olive oil, soups, marinades, meat, poultry, and (most commonly) spaghetti sauce. Spaghetti al diavolillo is a hot, piquant Italian dish."},
        {"tag": "Dice",
        "response": "to cut into regular sized cubes; small, medium or large"},
        {"tag": "Dientes De Ajo",
        "response": "cloves of garlic"},
        {"tag": "Digestivo a liqueur",
        "response": "A strong liqueur typically consumed after dinner to help digestion"},
        {"tag": "Dijonnaise",
        "response": "This is a name given to dishes that contain mustard or are served with a sauce that contains mustard."},
        {"tag": "Dim Sum",
        "response": "A selection of small dishes served for snacks and lunch in China. These dishes include a wide selection of fried and steamed dumplings, as well as, various other sweet and savory items."},
        {"tag": "Dinde",
        "response": "Turkey"},
        {"tag": "Dindonneau",
        "response": "Young fresh turkey"},
        {"tag": "Direct Heat",
        "response": "a grilling method of cooking, allowing food to be cooked directly over a flame or heat source"},
        {"tag": "Dissolve",
        "response": "to stir a dry substance into a liquid until no solids remain"},
        {"tag": "Ditalini",
        "response": "Short pasta tubes."},
        {"tag": "Do Pyaza",
        "response": "A mildly flavored creamy dish cooked with onions and meat."},
        {"tag": "Doblar",
        "response": "fold"},
        {"tag": "Dolce",
        "response": "Sweet; dessert"},
        {"tag": "Dollop",
        "response": "a scoop or spoonful of food placed on top of another food"},
        {"tag": "Dolma",
        "response": "A cold hors d oeuvre made of grape leaves stuffed with cooked rice, lamb, and onion. They are marinated with olive oil and lemon. Vegetarian versions of this are also made."},
        {"tag": "Donburi",
        "response": "A large bowl used for noodle and rice dishes; dishes that are prefixed or suffixed with “don” are served in this type of bowl. These dishes typically feature a topping on a bed of rice."},
        {"tag": "Dorada",
        "response": "gilthead bream fish"},
        {"tag": "Dorado",
        "response": "browned, fried golden yellow"},
        {"tag": "Dorar",
        "response": "to brown"},
        {"tag": "Dosa",
        "response": "Southern Indian pancakes that have been cooked and oiled on a tawa. Although there are many variations, the basic batter is made from rice and daal, which have been soaked and wet-ground into a creamy batter. Various sweet or savory fillings are rolled into this popular delicacy."},
        {"tag": "Dough",
        "response": "a combination of flour, water or milk and sometimes a leaven (yeast) to make a mixture for baking"},
        {"tag": "Drain",
        "response": "to remove and discard the liquid contents from a cooking process (as in draining cooked potatoes or vegetables)"},
        {"tag": "Dredge",
        "response": "To lightly coat food to be pan-fried or sautéed (usually with flour, cornmeal or bread crumbs)."},
        {"tag": "Drippings",
        "response": "the juices and fat that is collected from the pan of cooked foods"},
        {"tag": "Dry Aging",
        "response": "A process usually referring to beef. This process not only adds flavor but tenderizes the beef through enzyme action. Maximum flavor and tenderness is acheived in 21 days."},
        {"tag": "du Jour",
        "response": "meaning literally “of the day”"},
        {"tag": "Duchess",
        "response": "The name for potato puree that is enriched with cream, then piped into decorative shapes and browned in the oven. They are often piped around the rim of a platter onto which a roast or whole fish may be served."},
        {"tag": "Dulce",
        "response": "sweet"},
        {"tag": "Dum",
        "response": "“to steam or mature”; a method of steaming foods, in a tightly covered or sealed pot, to retain the flavor and aroma."},
        {"tag": "Duraznos",
        "response": "Peaches"},
        {"tag": "Durian",
        "response": "A large fruit from southeast Asia that has a creamy, gelatinous texture and a nauseating smell similar to that of stinky feet. The flesh is savored by many from this area, but outsiders find it a difficult flavor to become accustomed."},
        {"tag": "Dutch Oven",
        "response": "a large, deep pot that is covered with a tight fitting lid"},
        {"tag": "Duxelle",
        "response": "Chopped shallots and mushrooms seasoned, cooked in butter"},
        {"tag": "Ebi",
        "response": "Fresh boiled shrimp"},
        {"tag": "Echalote",
        "response": "Shallot"},
        {"tag": "Eclairs",
        "response": "Choux pastry baked in the size of thick fingers, then filled with cream"},
        {"tag": "Ectended Meal Service",
        "response": "Customers eat at different times. Often called a la carte cooking b/c customers usually select items from a written menu. Ie: restaurants, short-order counters."},
        {"tag": "Écula",
        "response": "potato starch"},
        {"tag": "Edaimame",
        "response": "Boiled green soybeans"},
        {"tag": "Edomae Sushi",
        "response": "Small rice balls usually topped with fish and Wasabi. Although there are several varieties of Nigirizushi, the most common include tuna, shrimp, shellfish, eel, squid, and octopus."},
        {"tag": "Edomae Zushi",
        "response": "Small rice balls usually topped with fish and Wasabi. Although there are several varieties of Nigirizushi, the most common include tuna, shrimp, shellfish, eel, squid, and octopus."},
        {"tag": "Effiler",
        "response": "To remove the fibrous string from a string bean; to thinnly slice almonds."},
        {"tag": "Egg Salad Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around hard-cooked eggs, mayonnaise, and green onion strips."},
        {"tag": "Egg Threads",
        "response": "Lightly beaten eggs that are poured slowly into a hot broth, creating irregular shaped threads used to garnish soups."},
        {"tag": "Egg Wash",
        "response": "liquefied eggs; beaten eggs with milk or water sometimes added; used in the breading process, in sealing pieces of dough and to coat some baked goods for a shiny look when baked"},
        {"tag": "Ejotes",
        "response": "String Beans"},
        {"tag": "Eliche",
        "response": "Helical pasta"},
        {"tag": "Elote",
        "response": "Corn on the Cob"},
        {"tag": "Embutidos",
        "response": "a generic term for sausage meats, whether cured, cooked, or fresh."},
        {"tag": "Emincer",
        "response": "To cut into thin slices, shorter than for julienne. This term is most often used when referring to meats, but it also applies to fruits and vegetables."},
        {"tag": "Empanada",
        "response": "A small savory pie from Spain and South America. Fillings may be made of meat, seafood, or vegetables. The fillings can be seasoned in many ways. Those from around Spain are flavored with peppers, onions, and tomatoes. Those from South America have a sweet/sour undertone from the addition of raisins and green olives. Crusts may be made from bread dough or flaky dough like pate brisee and puff pastry."},
        {"tag": "Empanadilla",
        "response": "small empanada turnover stuffed with tuna, minced meat, spm,i, I raisins, etc."},
        {"tag": "Emulsion",
        "response": "small particles of oil or another liquid suspended in the other (e.g. vinaigrette salad dressing)"},
        {"tag": "en",
        "response": "In, meaning “served in”"},
        {"tag": "En Lata",
        "response": "tinned, in a can"},
        {"tag": "en Papillote",
        "response": "technique of cooking (usually fish) in parchment paper"},
        {"tag": "En Su Jugo",
        "response": "in its own juices"},
        {"tag": "En Trozos",
        "response": "sliced"},
        {"tag": "En Trozos Menudos",
        "response": "finely chopped"},
        {"tag": "En Vez De",
        "response": "instead of"},
        {"tag": "Encebollado",
        "response": "cooked with fried onion, especially liver or tuna"},
        {"tag": "Encender",
        "response": "to ingnite"},
        {"tag": "Enchiladas",
        "response": "Folded and baked corn tortillas stuffed with ground beef, shredded chicken, pork, or vegetables. Enchiladas are usually fairly mild and topped with red salsa, sour cream, and melted cheese."},
        {"tag": "Encina",
        "response": "holm oak"},
        {"tag": "Endibias",
        "response": "endives"},
        {"tag": "Endivia",
        "response": "chicory"},
        {"tag": "Endulzante",
        "response": "sweetener"},
        {"tag": "Endulzar",
        "response": "to sweeten"},
        {"tag": "Eneldo",
        "response": "dill"},
        {"tag": "Enfriar",
        "response": "chill"},
        {"tag": "Engrasado",
        "response": "greased"},
        {"tag": "Engrasar",
        "response": "to oil"},
        {"tag": "Enoki Mushrooms",
        "response": "Highly esteemed mushrooms that have long thin stems topped with a tiny white cap. They have a crisp and crunchy texture when fresh, but tend to become tough when heated."},
        {"tag": "Ensalada",
        "response": "salad"},
        {"tag": "Entero",
        "response": "whole"},
        {"tag": "Entradas",
        "response": "starters, hors d’oeuvres"},
        {"tag": "Entrecote",
        "response": "A steak cut from the rib section of beef. It is boneless and has a very thin layer of fat. Though steaks cut from the loin ends of the rib are a finer quality steak, the whole rib may be used for entrecete. The term is sometimes used referring to a strip steak. This is not an accurate description. This cut of beef is called the faux-filet or contre-filet."},
        {"tag": "Entrée",
        "response": "in France, this term refers to the first course of a meal after the soup but before the main course. In the United States, the entrée is the main dish."},
        {"tag": "Entremeses",
        "response": "starters, hors d’oeuvres"},
        {"tag": "Entremetier",
        "response": "a chef in which prepares vegetables & egg dishes"},
        {"tag": "Entremets",
        "response": "Desserts, or sweets"},
        {"tag": "Epaule",
        "response": "shoulder"},
        {"tag": "Eperlan",
        "response": "Smelt"},
        {"tag": "Epinards",
        "response": "Spinach"},
        {"tag": "Escabeche",
        "response": "A highly seasoned marinade used to flavor and preserve food. Fish and chicken are the most common foods used for escabeche. First the meat is fried and placed in a dish large enough to hold all of the food in one layer. Then a marinade made of onions, peppers, vinegar, and spices is poured over the food while hot. The whole dish is then allowed to rest overnight and served cold."},
        {"tag": "Escaldar",
        "response": "to scald"},
        {"tag": "Escalfado",
        "response": "poached"},
        {"tag": "Escalivada",
        "response": "salad of charcoal-grilled vegetables"},
        {"tag": "Escalope",
        "response": "A thinly sliced food similar to a scallopine. This may consist of meat, fish, or vegetables."},
        {"tag": "Escanciar",
        "response": "to aerate cider by pouring it from a height into a glass."},
        {"tag": "Escargot",
        "response": "edible snail"},
        {"tag": "Escurrir",
        "response": "drain"},
        {"tag": "Espagnole",
        "response": "Basic brown sauce"},
        {"tag": "Espagnole Sauce",
        "response": "This is the foundation of all of the brown sauces. A number of modifications have been made of this sauce since its conception. The sauce is now made of a rich brown veal stock thickened with a brown roux. The sauce is then simmered with a mirepoix, bouquet garni, and wine. The long, slow cooking help to purify and concentrate its flavor. It is finally strained through very fine muslin. Demi-glace and glace de viande are all structured around a fine espagnole sauce."},
        {"tag": "Espaguetis",
        "response": "spaghetti"},
        {"tag": "Espárrago",
        "response": "asparagus"},
        {"tag": "Especias",
        "response": "Spices"},
        {"tag": "Espesar",
        "response": "thicken"},
        {"tag": "Espeso",
        "response": "stiff"},
        {"tag": "Espina",
        "response": "Spine, specifically refers to fish bones or thorns"},
        {"tag": "Espinacas",
        "response": "spinach"},
        {"tag": "Espresso",
        "response": "One of the darkest and strongest types of coffee available. Usually produced by forcing steam through finely ground premium coffee beans."},
        {"tag": "Espuma",
        "response": "foam"},
        {"tag": "Espumadera",
        "response": "slotted spoon"},
        {"tag": "Estofado",
        "response": "stew"},
        {"tag": "Estouffade",
        "response": "Brown meat stock"},
        {"tag": "Estragon",
        "response": "tarragon"},
        {"tag": "Etuver",
        "response": "To cook slowly covered with a minimum amount of liquid"},
        {"tag": "Eviche",
        "response": "Raw fish marinated in lime juice. Often prepared in a chopped salad."},
        {"tag": "Exprimir",
        "response": "squeeze"},
        {"tag": "Extra virgin olive oil",
        "response": "The finest, strongest, fruitiest olive oil produced. To preserve its robust flavor, this olive oil is usually used exclusively in salads or unheated dishes."},
        {"tag": "Fagot",
        "response": "wood pile"},
        {"tag": "Fahrenheit",
        "response": "a temperature scale in which 32 degrees represents freezing and 212 degrees is the steam point( to convert Fahrenheit to Celsius, subtract 32 from the Fahrenheit reading, multiply by 5 and divide by 9; better yet have a thermometer that reads both scales)"},
        {"tag": "Faisan",
        "response": "Pheasant"},
        {"tag": "Falafel",
        "response": "A Middle Eastern specialty consisting of small, deep-fried croquettes or balls made of highly spiced, ground chickpeas. They are generally tucked inside pita bread, sandwich style, but can also be served as appetizers. A yogurt or tahini-based sauce is often served with falafel."},
        {"tag": "Farce",
        "response": "forcemeat"},
        {"tag": "Farfalle",
        "response": "Literally “butterflies;” also called “bow-tie pasta.” Normally has crinkled edges. Usually available ridged or plain, and in a variety of colors."},
        {"tag": "Farinaceous",
        "response": "Made from, rich in, or consisting of starch, or having a mealy or powdery texture"},
        {"tag": "Fatback",
        "response": "Fat from a pig’s back. Can be used as cooking fat, or rendered to produce lard."},
        {"tag": "Fava Bean",
        "response": "This tan, rather flat bean resembles a very large lima bean. It comes in a large pod which, unless very young, is inedible. Fava beans can be purchased dried, cooked in cans and, infrequently, fresh. If you find fresh fava beans, choose those with pods that are not bulging with beans, which indicates age. Fava beans have a very tough skin, which should be removed by blanching before cooking. They are very popular in Mediterranean and Middle Eastern dishes. They can be cooked in a variety of ways and are often used in soups. Also called faba bean, broad bean and horse bean."},
        {"tag": "Fedelini",
        "response": "Very thin, spaghetti-like pasta."},
        {"tag": "Feijoa",
        "response": "A fruit grown in New Zealand with a thin green skin and a flavor reminiscent of strawberry, banana, and pineapple."},
        {"tag": "Feijoada",
        "response": "A Brazilian dish very similar to cassoulet, made with black beans. Sausage, bacon, ham, and various cuts of pork are cooked in with the beans. The traditional accompaniments are plain white rice, cooked greens, fresh orange slices, and a very hot sauce, similar to pico de gallo, called molho carioca. Toasted cassava flour is used as a condiment, to be added by each diner. This too is a very substantial dish and needs little else to accompany it."},
        {"tag": "Feni",
        "response": "An alcoholic drink made from cashews or coconuts. Feni is usually distilled by locals in a disorganized fashion, akin to moonshine in the United States."},
        {"tag": "Fenouil",
        "response": "fennel"},
        {"tag": "Fenugreek",
        "response": "A very hard seed grown in the Middle East, which is used as a spice. Its dominant flavor and aroma is recognizable in commercial curry powders."},
        {"tag": "Fermented Bean Curd",
        "response": "A strong, salty cheese made by fermenting bean curd cubes in rice wine, salt, sesame oil, or chili."},
        {"tag": "Fermented Black Beans",
        "response": "Aromatic beans cooked with salt, ginger, and/or orange rind."},
        {"tag": "Fettuccine",
        "response": "Literally, “little ribbons.” Basic flat egg noodles."},
        {"tag": "Ficelle",
        "response": "The French word for string. This is a term used in cooking to describe foods that have been tied to a string and cooked in a broth. This was a practice in villages when a communal pot was used to cook food. The string was used in order to allow the owners to identify and recover their piece of meat. This is generally applied to tough cuts of meat that require long periods of cooking. Yet, some restaurants are using the term to describe a more tender cut of meat that is poached in a rich broth. Beef filet and duck breasts are two good choices for this type of preparation."},
        {"tag": "Fideo",
        "response": "thin macaroni-like pasta"},
        {"tag": "Fideua",
        "response": "pasta-based paella-type dish made in the paella, originating in Alicante."},
        {"tag": "Filet",
        "response": "Fillet; a thin cut of meat, fish, poultry removed from the bone"},
        {"tag": "Filet Mignon",
        "response": "Small center cut from the tenderloin of beef."},
        {"tag": "Fillet",
        "response": "to remove the bones from fish or meat before cooking (fish fillet, meat filet)"},
        {"tag": "Filter",
        "response": "to remove impurities or particles of food by pouring through cheesecloth or a strainer or “China Cap” (chinoise)"},
        {"tag": "Financier",
        "response": "A small cake or cookie that is made with ground nuts and whipped egg whites. These are soft like sponge cake, and have a rich flavor of nuts."},
        {"tag": "Fines herbes",
        "response": "A fine mixture of herbs used to season"},
        {"tag": "Finnan Haddie",
        "response": "The Scottish name for smoked haddock."},
        {"tag": "Fino",
        "response": "a pale crisp white sherry of around 15 per cent alcohol, generally from Jerez de la Frontera and Puerto de Santa María. It is the traditional Andalusian accompaniment to appetizers, tapas, and seafood"},
        {"tag": "Finocchio",
        "response": "Fennel"},
        {"tag": "Finocchiona",
        "response": "Flavorful Tuscan salami that enhances any antipasto platter. Made from finely ground pork flavored with fennel seeds, garlic, salt, and pepper."},
        {"tag": "Fish Sauce",
        "response": "A thin brown sauce made by fermenting fish with salt and soy sauce."},
        {"tag": "Five Spice Powder",
        "response": "A dry spice mix used in Chinese cooking consisting of cinnamon, star anise, pepper, clove, and fennel."},
        {"tag": "Five-spice Powder",
        "response": "A popular blend of ancient spices consisting of ground star anise, cloves, cinnamon, fennel seeds and Szechuan peppercorns."},
        {"tag": "Flake",
        "response": "to break food into small pieces (or allow it to do so when cooking)"},
        {"tag": "Flamber",
        "response": "To flame"},
        {"tag": "Flamebee",
        "response": "a method of cooking in which foods are splashed with liquor and ignited"},
        {"tag": "Flan",
        "response": "This is a term that may be used to describe two different preparations. The first use of this word is describes an open top tart that is filled with pastry cream and topped with fruit. In Spanish and Mexican cooking, “flan” is an egg custard that is baked in a large shallow dish, and flavored with caramel. The dish is inverted when served and the excess caramel is used as a sauce for the flan. The flan may be flavored with orange, anise, cinnamon, or liqueur."},
        {"tag": "Flauta",
        "response": "thin, crisp, baguette-style loaf of bread"},
        {"tag": "Fletan",
        "response": "Halibut"},
        {"tag": "Fleuron",
        "response": "A small crescent shaped pastry made of puff dough that is used to garnish fish dishes and soups."},
        {"tag": "Florentine",
        "response": "This is used to describe foods that are cooked in the style of Florence. The word is most commonly associated with dishes containing spinach and sometimes a cream sauce. Steak cooked ala Florentine is a large T-bone steak, rubbed with olive oil and garlic, grilled and served with fresh lemon on the side."},
        {"tag": "Flour",
        "response": "This is the finely ground grain of wheat, corn, rice, oat, rye, or barley. Unless specified, this term refers to wheat flour. Flour is milled from a variety of wheats containing different amounts of protein. The different levels of protein give each flour unique qualities. All-purpose flour is the most commonly used, especially by the domestic market. This flour is milled from both hard and soft wheats, giving it the strength needed in bread baking, but leaving it tender enough for cakes and pastries. Bread flour has a higher protein content so that it may withstand the constant expansion of the cell walls during proofing and baking. Cake flour is milled from soft wheat, thus containing a very low protein content and preventing the development of gluten. Pastry flour is of relatively low protein content, containing just enough to help stabilize the products during leavening. Whole wheat flours are milled from the whole kernel, thus giving it a higher fiber content and a substantial protein content. Semolina is milled from hard durum wheat, being used mainly for commercial baking and pasta production."},
        {"tag": "Flute",
        "response": "a decorative scalloped edge on pastry or pie crusts; vegetables can be fluted as a way to make them have more eye appeal"},
        {"tag": "Focaccia",
        "response": "An Italian flatbread often topped with olive oil, herbs, garlic, and cheese. Traditionally served as a complement to an antipasto."},
        {"tag": "Focaccio",
        "response": "An Italian flatbread made with pizza or bread dough, that can be baked plain or topped with onions, zucchini, eggplant, cheese, or whatever you choose."},
        {"tag": "Foie",
        "response": "Liver"},
        {"tag": "Foie Gras",
        "response": "Fattened duck or goose liver."},
        {"tag": "Fold",
        "response": "combining two or more products with a spatula or spoon using a side to side motion and a top to bottom motion"},
        {"tag": "Fond",
        "response": "Basic stock or essences"},
        {"tag": "Fond Blanc",
        "response": "white stock"},
        {"tag": "Fond brun",
        "response": "Brown stock"},
        {"tag": "Fonda",
        "response": "lodging house, in Catalonia, also implies restaurant"},
        {"tag": "Fondant",
        "response": "This is an icing made of sugar syrup and glucose, which is cooked to a specific temperature and then kneaded to a smooth, soft paste. This paste can then be colored or flavored and used as an icing for cakes and petit fours."},
        {"tag": "Fondente",
        "response": "Flourless cake; baking chocolate"},
        {"tag": "Fondo",
        "response": "pan juices after cooking meat or fish"},
        {"tag": "Fonds d’artichaut",
        "response": "artichoke bottoms"},
        {"tag": "Fondue",
        "response": "There are several different types of fondue, the most notable of which is cheese fondue. This is a Swiss specialty in which cheese is melted with wine, eggs, and seasonings and served with bread and fresh vegetables. Fondue Bourguignonne is a pot of hot oil into which the diners will cook strips of meat and dip them into an array of sauces on the table. Similar to this is fondue Chinois where the hot oil is replaced by a rich chicken or meat broth. The meat, and fish too, are then cooked in this stock and dipped in sauces. The Japanese have a dish called shabu shabu, which is similar to this type of fondue. Named for the swishing sound that the meat makes in the broth, this dish is also served with vegetables and noodles in to be eaten along with the meat. A chocolate fondue is a chocolate bath, flavored with liqueur and eaten with bread and fruit, like fresh berries. These are all dishes eaten as much for their social qualities as their culinary grandeur. Their popularity in the US has diminished over the last 15 years, only being seen in ski resorts and at private dinner parties."},
        {"tag": "Fonduta",
        "response": "An Italian style fondue made of Fontina cheese and served over toast or polenta. Exceptional with truffles."},
        {"tag": "Fontaine",
        "response": "A well made in dry flour to add liquid"},
        {"tag": "Fontina",
        "response": "A delicate, nutty, slightly smoky tasting cheese used for “fonduta”, or an Italian version of the Swiss “fondue”."},
        {"tag": "Foogat",
        "response": "A lightly cooked vegetable dish."},
        {"tag": "Formas",
        "response": "shapes"},
        {"tag": "Fouetter",
        "response": "to whisk"},
        {"tag": "Fougasse",
        "response": "A flatbread from France that was once served sweetened with sugar and orange water. It is now more commonly seen as a bread eaten with savory dishes. In this case, the dough is brushed with olive oil and sprinkled with herbs or salt before baking."},
        {"tag": "Foyot",
        "response": "This is a variation of a bearnaise sauce with the addition of a well reduced meat glaze."},
        {"tag": "Fraise",
        "response": "strawberry"},
        {"tag": "Framboise",
        "response": "Raspberry"},
        {"tag": "Frangipane",
        "response": "A pastry cream made of butter, eggs, flour, and finely ground almonds or macaroons. Modern versions will use a combination of cornstarch and flour. The nuts must be very finely ground for this to be successful. This type of raw cream is baked in the pastry shell or crepe. Frangipane is also the name for a type of panada used in making forcemeats."},
        {"tag": "Frappe",
        "response": "iced"},
        {"tag": "Freiduria",
        "response": "fried fish shop"},
        {"tag": "Fresa",
        "response": "strawberry"},
        {"tag": "Fresh Rice Noodles",
        "response": "Flat, thread-like, white noodles made from rice flour."},
        {"tag": "Fricandeau",
        "response": "Veal braised until very tender"},
        {"tag": "Fricando",
        "response": "traditional Catalan beef stew"},
        {"tag": "Fricassee",
        "response": "A stew prepared without the initial browning of the meat. Though chicken is the most common form of this type of stew, fish, vegetables, and other meats are prepared in this manner."},
        {"tag": "Frigorífico",
        "response": "refrigerator"},
        {"tag": "Frijol",
        "response": "lima bean"},
        {"tag": "Frijoles",
        "response": "beans"},
        {"tag": "Frijoles Refritos",
        "response": "Refried pinto beans boiled with seasoning until tender, then crushed and sauteed in canola oil."},
        {"tag": "Frire",
        "response": "to fry"},
        {"tag": "Frit",
        "response": "Fried"},
        {"tag": "Frito",
        "response": "fried in oil;often coated in egg and flour before frying as in fish and shell fish"},
        {"tag": "Frittata",
        "response": "An Italian open-faced omelet."},
        {"tag": "Fritter",
        "response": "Food that has been dipped in batter and deep fried or saut‚ed. These may consist of vegetables, meat, fish, shellfish, or fruit. The food may be dipped in the batter or mixed with the batter and dropped into the hot fat to form little balls. Japanese tempura fried foods are a type of fritter, though this term is not applied to it."},
        {"tag": "Fritto Misto",
        "response": "An Italian mixed fried platter, similar to the Japanese tempura platter. A mixture of vegetables, meat, and fish are dipped in a light batter and quickly deep fried to prevent a saturation of grease into the food."},
        {"tag": "Frizzle",
        "response": "to fry julienne vegetables in hot oil until crisp"},
        {"tag": "Frollini",
        "response": "Shortbread cookies"},
        {"tag": "Frotar",
        "response": "to rub"},
        {"tag": "Fruit Pectin",
        "response": "A substance found naturally in fruits such as apples, quince, and all citrus fruits. Pectins ability to gel liquids makes it a key ingredient in jelly and jam making. You can purchase pectin in powder or liquid form, or use high pectin fruits in the recipe."},
        {"tag": "Frullato",
        "response": "An Italian milkshake that is made with milk and fresh fruit."},
        {"tag": "Fruta",
        "response": "fruit"},
        {"tag": "Fuego Fuerte",
        "response": "high heat"},
        {"tag": "Fugu",
        "response": "A poisonous blowfish considered a delicacy. In Japan, only licensed Fugu chefs are allowed to prepare Fugu or puffer fish."},
        {"tag": "Fuki",
        "response": "A Japanese fibrous butterbur vegetable often simmered in broth."},
        {"tag": "Fumet",
        "response": "An aromatic broth made for use in soups and sauces. The flavor of a fumet is usually concentrated on one item, though multiple ingredients may be used. The stock is then reduced to concentrate this flavor. Fish and vegetable broths are more commonly called fumets, but meat may also be used."},
        {"tag": "Fungetiello",
        "response": "Pasta sauce made with black olives and Capers."},
        {"tag": "Funghi",
        "response": "Mushrooms"},
        {"tag": "Fusilli",
        "response": "Spiral shaped pasta. Some versions are shaped like a spring. Other versions are shaped like a twisted spiral."},
        {"tag": "Futo Maki",
        "response": "Large, oversized rolls"},
        {"tag": "Futomaki",
        "response": "Large, oversized rolls"},
        {"tag": "Gachas",
        "response": "savory porridge with fried tocino, panceta, etc.,"},
        {"tag": "Galanga",
        "response": "A root spice related to ginger, which has a musky flavor reminiscent of saffron. It is found dried whole or in slices, and also in powder."},
        {"tag": "Galantine",
        "response": "A pate-like dish made of the skin of a small animal, most often chicken or duck, which is stuffed with a forcemeat of this animal."},
        {"tag": "Galantines",
        "response": "Stuffed chicken or veal in the form of a large roll, usually glazed with"},
        {"tag": "Galette",
        "response": "This is French for pancake, usually sweet, made of batters, doughs, or potatoes. Brioche-type dough or puff pastry are often used. Small short butter cookies were once also called galettes."},
        {"tag": "Gallego",
        "response": "a native of Galicia, and the language spoken there."},
        {"tag": "Galleta",
        "response": "cookie"},
        {"tag": "Galleta Salada",
        "response": "pretzel"},
        {"tag": "Galletas",
        "response": "Cookies"},
        {"tag": "Gallina",
        "response": "hen"},
        {"tag": "Gamba",
        "response": "prawn, shrimp"},
        {"tag": "Gambero",
        "response": "Shrimp (or crayfish)"},
        {"tag": "Ganache",
        "response": "a chocolate coating made with chocolate, egg yolks and heavy cream; used as filling for truffles and coating for pies and other desserts"},
        {"tag": "Ganbas Al Ajillo",
        "response": "garlic shrimp fried in garlic and hot peppers"},
        {"tag": "Gancho De Carnicero",
        "response": "meat hook"},
        {"tag": "Garam Masala",
        "response": "Literally “warm spices;” a blend of spices used to flavor dishes. May include cumin, fennel, coriander, cardamom, cinnamon, saffron, pepper, chiles, and/or caraway."},
        {"tag": "Garbanzos",
        "response": "chick peas"},
        {"tag": "Garbure",
        "response": "a thick vegetable soup"},
        {"tag": "Garde Manger",
        "response": "Cold kitchen, a chef who is in charge of the cold foods in the kitchen"},
        {"tag": "Gari",
        "response": "A Sushi-bar term that refers to pickled ginger"},
        {"tag": "Garlic",
        "response": "A single aromatic bulb that can be easily separated into cloves, all individually wrapped in papery skins. It is pungent and slightly bitter flavored when raw, but becomes mild and sweet tasting when sauteed or baked."},
        {"tag": "Garlic Bread",
        "response": "Bread that has been spread with garlic butter and then baked or broiled. Instead of using garlic butter, the bread may be brushed with olive oil and sprinkled with minced garlic and herbs."},
        {"tag": "Garlic Toast",
        "response": "Slices of French or Italian bread that are flavored with garlic butter and herbs, then oven toasted to a crispy texture. This toast, which may also be flavored with olive oil, is often served as the bread that accompanies a main meal."},
        {"tag": "Garnish",
        "response": "a decorative touch added to dishes and beverages"},
        {"tag": "Garniture",
        "response": "to garnish"},
        {"tag": "Garrofo",
        "response": "large flat white bean, used in paella"},
        {"tag": "Gaza",
        "response": "game, game dishes"},
        {"tag": "Gazpacho",
        "response": "A cold vegetable soup served throughout all of the Spanish countries. The most common version is one made with a coarse puree of fresh tomatoes flavored with vinegar and olive oil, embellished with diced raw vegetables like onions, cucumbers, and peppers. A light gazpacho is made with a puree of cucumber, and served with an array of garnishes for the diner to choose from. Roasted almonds, avocadoes, and croutons are common garnishes."},
        {"tag": "Gelatin",
        "response": "A protein produced from animals, used to gel liquids. It is found in granular and sheet form."},
        {"tag": "Gelatina",
        "response": "jelly"},
        {"tag": "Gelato",
        "response": "Fine Italian ice cream"},
        {"tag": "Gelato di Crema",
        "response": "Smooth, fresh, lemony custard ice cream."},
        {"tag": "Gellan Gum",
        "response": "Gellan gum is a water-soluble anionic polysaccharide produced by the bacterium Sphingomonas elodea (formerly Pseudomonas elodea based on the taxonomic classification at the time of its discovery).. The gellan-producing bacterium was discovered and isolated by the former Kelco Division of Merck & Company, Inc."},
        {"tag": "Genoa Salami",
        "response": "A mild, spicy, Italian cured sausage often made of only pork, and typically seasoned with garlic, salt, peppercorns, and red wine. Included in most antipastos."},
        {"tag": "Genoise",
        "response": "A very rich sponge cake made with eggs and butter. This may be eaten as is with whipped cream or fruit, but also used as the foundation for many other cake preparations."},
        {"tag": "Geoduck",
        "response": "A long-neck, slightly crunchy sweet clam"},
        {"tag": "Geta",
        "response": "The wooden block used as a plate for Gari, Wasabi, and smaller pieces of Sushi."},
        {"tag": "Ghee",
        "response": "Clarified, nut-flavored butter. Made by slowly melting butter, skimming the foam, and saving the remaining golden liquid. Indian cooks simmer the butter until all the moisture evaporates. Ghee is used for cooking vegetables and meats."},
        {"tag": "Gibier",
        "response": "game"},
        {"tag": "Gigot d’Agneau",
        "response": "Leg of lamb"},
        {"tag": "Ginebra",
        "response": "Gin"},
        {"tag": "Ginkgo",
        "response": "A bright green and delicately sweet flavored nut."},
        {"tag": "Glace",
        "response": "A highly reduced stock used as an essence in flavoring sauces and enriching soups and stews. Veal glace is used for all meat preparations and stands up the best to the long reduction required. Fish and shellfish glaces are used, but their flavor can become edirtye tasting and bitter from too long of a reduction."},
        {"tag": "Glace de Poisson",
        "response": "fish glaze"},
        {"tag": "Glace de Viande",
        "response": "Meat glaze"},
        {"tag": "Glacer",
        "response": "to; (a) freeze or chill (b)to cook to acquire a shiny surface (c) To slightly brown food under a Salamander(broiler)"},
        {"tag": "Glasear",
        "response": "to glaze or coat with sugar or friut preserves"},
        {"tag": "Glaze",
        "response": "a liquid that gives a shiny surface to an item"},
        {"tag": "Gluten",
        "response": "The protein found in wheat flours."},
        {"tag": "Gnocchetti",
        "response": "Curved-shell pasta with ridges on the outer surface."},
        {"tag": "Gnocchi",
        "response": "These are small dumplings made with flour, potatoes, and eggs. Other versions include spinach, semolina, sweet potatoes, chopped herbs, and parmesan or ricotta cheese. Once the gnocchi are made they are cooked in boiling water, and then sauced or tossed with melted butter. Some recipes call for cooking the gnocchi in broth. Gnocchi is also the name of a pasta with a similar shape."},
        {"tag": "Gobo",
        "response": "Long, slender burdock root"},
        {"tag": "Gohan",
        "response": "Plain boiled rice."},
        {"tag": "Goma",
        "response": "Sesame seeds"},
        {"tag": "Gomoku Sushi",
        "response": "Literally “scattered Sushi”; an assortment of sliced raw fish and vegetables served on a bed of Sushi rice."},
        {"tag": "Gorgonzola",
        "response": "Creamy, pale yellow, mold-ripened cheese with streaks of blue veining and a lightly spicy flavor. Considered one of the best blue cheeses available, gorgonzola is usually served with slices of fruit or crumbled into salads."},
        {"tag": "Gougere",
        "response": "A savory pastry made of choux paste flavored with cheese. This may be made in individual puffs or piped into a ring of puffs, which is served with a pool of sauce in the center of the ring."},
        {"tag": "Goulash",
        "response": "A Hungarian soup/stew made with beef and liberally seasoned with paprika. Some versions add gremolata at the very end of cooking or sprinkled over the top."},
        {"tag": "Granita",
        "response": "A coarse fruit ice similar to sorbet, without the meringue, which is often flavored with liqueurs."},
        {"tag": "Granizado",
        "response": "water ice"},
        {"tag": "Granola",
        "response": "A combination of assorted toasted grain (oats), dried fruits and nuts usually served as a breakfast cereal. Some blends are sweetened with honey and/or brown sugar."},
        {"tag": "Granos De Pimienta",
        "response": "peppercorns"},
        {"tag": "Grappa",
        "response": "A strong Italian brandy made from grape skin and seed. Served as an after dinner drink to help digestion."},
        {"tag": "Grasa",
        "response": "grease"},
        {"tag": "Grate",
        "response": "to shred food into fine pieces"},
        {"tag": "Gratinado",
        "response": "Cooked au gratin."},
        {"tag": "Gratinar",
        "response": "to grill"},
        {"tag": "Grattoni",
        "response": "Small diamond-shaped egg pasta that is best used in soup. Similar to Pastina."},
        {"tag": "Gravlax/Gravadlax",
        "response": "Whole salmon fillets that have been cured with salt, sugar, and pepper, then flavored with dill. The salmon is then sliced paper thin and tradionally served with pumpernickel bread, sour cream, capers, onion, and lemon."},
        {"tag": "Gravy",
        "response": "a sauce made from pan drippings and thickened with a roux"},
        {"tag": "Grecque",
        "response": "Foods that are prepared in the style of Greece. This is usually used for dishes with lemon, garlic, and olive oil. But the addition of tomatoes, peppers, and fennel often allows a dish to be called … la grecque."},
        {"tag": "Green Tea",
        "response": "An aromatic relaxing tea considered the most healthy and popular beverage among Japanese people. Research suggests that this tea, which is rich in vitamins, minerals, and antioxidants, may help prevent cancer, high cholesterol, and other diseases."},
        {"tag": "Gremolata",
        "response": "A mixture of chopped parsley, garlic, and lemon peel. This is added to stews at the end of their cooking time to add a pungency to the dish. Used in some recipes for osso buco a la Milanese, and Hungarian goulash."},
        {"tag": "Grill",
        "response": "to cook directly over a heat source on metal racks"},
        {"tag": "Grisín",
        "response": "bread stick"},
        {"tag": "Grissini",
        "response": "Thin, crunchy bread sticks made from yeast dough, and enriched with olive oil and Parmesan. Complementary to soups, salads, and antipastos."},
        {"tag": "Groseille",
        "response": "Currant"},
        {"tag": "Gruyere",
        "response": "A moderate-fat cow milk cheese with a rich, sweet, nutty flavor that is prized for both out of hand eating and cooking. It is usually aged for 10 to 12 months and has a golden brown rind and a firm, pale yellow interior with well-spaced medium-size holes."},
        {"tag": "Guacamole",
        "response": "A fairly rich avocado-based dip made with onions, lemon, lime juice, and chopped garlic. Complementary dips are salsa and sour cream."},
        {"tag": "Guanciale",
        "response": "Meat from the cheek of the pig that is lightly rubbed with salt, freshly ground black pepper or chili peppers, then cured for three months."},
        {"tag": "Guarnición",
        "response": "garnish"},
        {"tag": "Guayaba",
        "response": "guava"},
        {"tag": "Guindillas",
        "response": "long, moderately hot Spanish chilis – especially popular in the Basque Country. Picked while still green, they are most commonly sold preserved in vinegar"},
        {"tag": "Guisado",
        "response": "braised, fried and then cooked in liquid"},
        {"tag": "Guisantes",
        "response": "peas"},
        {"tag": "Guitar Las Espinas",
        "response": "to fillet (fish)"},
        {"tag": "Gulab Jamun",
        "response": "Deep-fried balls of dough made from flour, milk curds, and aromatic sugary syrups."},
        {"tag": "Gumbo",
        "response": "A thick soup/stew made with meat or seafood served over plain white rice. Okra, filé powder, and roux. All methods are acceptable, and all are considered traditional."},
        {"tag": "Gundan Maki",
        "response": "The battleship roll; often used for oysters, quail eggs, Ikura, and Tobiko."},
        {"tag": "Gur",
        "response": "Dried sugarcane juice same meaning as jaggery"},
        {"tag": "Gyoza",
        "response": "A pan-fried, sauteed, and/or steamed stuffed Wonton. Typically contains a pork dumpling."},
        {"tag": "Habas",
        "response": "broad beans"},
        {"tag": "Habas Con Jamón",
        "response": "see recipe"},
        {"tag": "Habichuelas",
        "response": "green beans"},
        {"tag": "Hacer Puré",
        "response": "mash"},
        {"tag": "Hacher",
        "response": "To chop finely"},
        {"tag": "Hake",
        "response": "Merluza – a mild-flavored, large-flaked, white-fleshed fish very popular with Spanish cooks. Cod or another large-flaked white fish can be used as a substitute in recipes."},
        {"tag": "Halva",
        "response": "A congealed, translucent, small, squared-shaped, bright Indian sweet made from finely grated vegetables, fruits, syrups, milk, and sugar. This sweet, flavored with cardamom, has a thick pudding consistency. The most popular types are carrot, pistachio, and mango."},
        {"tag": "Hamachi",
        "response": "Young yellowtail tuna often served broiled."},
        {"tag": "Hamaguri",
        "response": "Clam"},
        {"tag": "Hamo",
        "response": "A Pike Conger sea eel"},
        {"tag": "Hanakatsuo",
        "response": "Dried bonito fish that is usually shaved or flaked."},
        {"tag": "Hard Taco",
        "response": "A large, crisp corn tortilla shell that usually contains minced beef, shredded lettuce, and grated cheese. Commonly topped with salsa, sour cream, or guacamole."},
        {"tag": "Haricot Blanc",
        "response": "Bean (white)"},
        {"tag": "Haricot Vert",
        "response": "Green bean"},
        {"tag": "Harina",
        "response": "flour"},
        {"tag": "Harina De Maíz",
        "response": "corn flour"},
        {"tag": "Harissa",
        "response": "A spice mixture used as both a condiment and a seasoning. Harissa contains chiles which are ground with cumin, garlic, coriander, and olive oil. It becomes a thick paste that is used as is in cooking or diluted with oil or stock to be used as a condiment."},
        {"tag": "Harusame",
        "response": "Thin, transparent bean gelatin noodles"},
        {"tag": "Hashi",
        "response": "Chopsticks"},
        {"tag": "Hatahata",
        "response": "Sandfish"},
        {"tag": "Helado",
        "response": "ice cream"},
        {"tag": "Herbal Tea",
        "response": "Tea flavored with herbs, such as mint or rosemary, to enhance the flavor."},
        {"tag": "Herboristeria",
        "response": "shop specializing in herbs, natural remedies, etc."},
        {"tag": "Hervir",
        "response": "boil"},
        {"tag": "Hichimi Togarashi",
        "response": "Mixed hot spices for table use. The flavors consist of red pepper (Togarashi), ground sansho pepper pods, dried mandarin orange peel, black hemp seeds or white poppy seeds, Nori seaweed bits, and white sesame seeds."},
        {"tag": "Hierba",
        "response": "herb"},
        {"tag": "Hierba Doncella",
        "response": "myrtle, periwinkle"},
        {"tag": "Hierbabuena",
        "response": "mint"},
        {"tag": "Hierbaluisa",
        "response": "lemon verbena"},
        {"tag": "Higado",
        "response": "liver"},
        {"tag": "Higo",
        "response": "fig"},
        {"tag": "Higo Chumbo",
        "response": "prickly pear"},
        {"tag": "Hijiki",
        "response": "Black seaweed in tiny threads."},
        {"tag": "Hikari Mono",
        "response": "A comprehensive term for “shiny” silver-skinned fish, such as mackerel."},
        {"tag": "Himo",
        "response": "The fringe around the inside of an ark shell"},
        {"tag": "Hinojo",
        "response": "fennel"},
        {"tag": "Hirame",
        "response": "Fluke, flounder, or halibut"},
        {"tag": "Hocho",
        "response": "The general Japanese term for knives."},
        {"tag": "Hoisin Sauce",
        "response": "A rich, dark, sweet barbecue sauce used in Chinese cooking for marinades and basting. Hoisin sauce is easily recognizable in Mu Shu pork and Peking duck. The sauce is made from soybean flour, chiles, red beans, and many other spices."},
        {"tag": "Hoja",
        "response": "Leaf"},
        {"tag": "Hoja de Laurel",
        "response": "Bay Leaf"},
        {"tag": "Hoja Del Cuchillo",
        "response": "blade of a knife"},
        {"tag": "Hojaldre",
        "response": "puff pastry"},
        {"tag": "Hojas",
        "response": "leaves"},
        {"tag": "Hokkigai",
        "response": "A thorn-shaped red-sided surf clam."},
        {"tag": "Holiday Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around cranberry salsa, turkey strips, and cream cheese strips."},
        {"tag": "Hollandaise Sauce",
        "response": "This is the most basic of the egg and oil emulsified sauces. The only flavoring is fresh lemon juice. This sauce must be kept warm, as excessive heat will cause it to break. Because this is kept warm, it is not safe to keep it for long periods of time and should never be reused from another meal period."},
        {"tag": "Homard",
        "response": "Lobster"},
        {"tag": "Hominy",
        "response": "corn kernels with the germ and bran removed"},
        {"tag": "Hongos",
        "response": "Mushrooms"},
        {"tag": "Horchata",
        "response": "Made from ground chufa nuts ( tiger nuts), it is a sweet cool milky drink originating in Valencia."},
        {"tag": "Horn of Plenty Mushroom",
        "response": "This is a wild mushroom with a hollow, funnel-shaped cap and is dark gray or black in color. Because of this, it also has the name etrumpet of deathe. This mushroom is somewhat stringy, but has a robust flavor and may be used to flavor sauces, soups, or any other mushroom preparation."},
        {"tag": "Horno",
        "response": "oven"},
        {"tag": "Horreo",
        "response": "A granite drying shed for corn, found in Galicia and Asturias"},
        {"tag": "Hors D’oeuvres",
        "response": "small portions of foods, canapÃ©s; appetizers"},
        {"tag": "Hot Bean Sauce",
        "response": "A combination of hot chili sauce and brown bean sauce used in spicy Szechuan and Hunan dishes."},
        {"tag": "Hot Mustard",
        "response": "A spicy condiment served with Chinese appetizers. Made by mixing dry mustard powder with water, causing a chemical reaction."},
        {"tag": "Hotatagai",
        "response": "Scallops"},
        {"tag": "Huachinango",
        "response": "Red Snapper"},
        {"tag": "Hueco",
        "response": "Hole"},
        {"tag": "Huerto/Huerta",
        "response": "Vegetable patch, especially a vegetable-producing garden close to the city"},
        {"tag": "Hueso/Espina",
        "response": "bone"},
        {"tag": "Hueva",
        "response": "Cured and pressed fish roe, normally tuna or grey mullet"},
        {"tag": "Huevo",
        "response": "Egg"},
        {"tag": "Huevo Duro",
        "response": "Hard boiled egg"},
        {"tag": "Huevos",
        "response": "Eggs"},
        {"tag": "Huevos Estrellados",
        "response": "Fried egg and potato hash"},
        {"tag": "Huitre",
        "response": "Oyster"},
        {"tag": "Hull",
        "response": "to remove the leafy parts of fruits"},
        {"tag": "Hyssop",
        "response": "Any of various herbs belonging to the mint family with aromatic, dark green leaves that have a slightly bitter, minty flavor. Hyssop adds intrigue to salads, fruit dishes, soups and stews. It is also used to flavor certain liqueurs such as Chartreuse."},
        {"tag": "Iago",
        "response": "A small British pastry or petit four."},
        {"tag": "Ibérico",
        "response": "A strain of black hoofed pig, cerdo Ibérico, that dates back to pre-history"},
        {"tag": "Ibrik",
        "response": "A small, long-handled Turkish pot with a bulbous bottom, narrow waist and flared top-handled Turkish pot with a bulbous bottom, narrow waist and flared top."},
        {"tag": "Icefish",
        "response": "See rainbow smelt."},
        {"tag": "Icelandic lobester",
        "response": "See Norway lobster."},
        {"tag": "Idiaxabal, Queso De",
        "response": "A smoked sheep’s-milk cheese from the Basque country and bought in small balls. There are two types"},
        {"tag": "Idli",
        "response": "Light, spongy, steamed dumplings made from a fermented batter of rice and daal. Generally served with sambar and chutney."},
        {"tag": "Ika",
        "response": "Squid; the body is usually served raw and the tentacles are usually toasted on a bed of rice."},
        {"tag": "Ikura",
        "response": "Large, orange, salty, salmon roe. Also means “How much?” in Japanese."},
        {"tag": "Inada",
        "response": "Very young yellowtail"},
        {"tag": "Inari",
        "response": "A simple dish consisting of Aburage bags stuffed with vinegar rice."},
        {"tag": "Inari Sushi",
        "response": "A simple dish consisting of Aburage bags stuffed with vinegar rice."},
        {"tag": "Inari Udon Soup",
        "response": "Fried soybean curd with noodle soup"},
        {"tag": "Inari Zushi",
        "response": "A simple dish consisting of Aburage bags stuffed with vinegar rice."},
        {"tag": "Inarizushi",
        "response": "A simple dish consisting of Aburage bags stuffed with vinegar rice."},
        {"tag": "Infusion",
        "response": "An infusion is the flavor that is extracted from any ingredient such as tea leaves, herbs or fruit by steeping them in a liquid such as water, oil or vinegar."},
        {"tag": "Insalata",
        "response": "An Italian salad"},
        {"tag": "Insulated Baking Sheet",
        "response": "a cookie sheet with a space between its double layers to prevent hot spots"},
        {"tag": "Involtini",
        "response": "Thin slices of meat or fish which are stuffed and rolled. They may then be sauteed, grilled, or baked."},
        {"tag": "Jabalí",
        "response": "Wild boar"},
        {"tag": "Jaggery",
        "response": "Dried sugarcane juice, same meaning as gur"},
        {"tag": "Jalebi",
        "response": "Orange, sweet-crisp round whirls made from plain flour and water. Jalebi, a favorite Indian dessert, is deep fried and dipped in sugary syrup."},
        {"tag": "Jambalaya",
        "response": "A Creole version of paella, though more highly spiced. The only consistent ingredients among all of the jambalaya recipes are rice, tomatoes, peppers, and onions. Ingredients used for jambalaya are ham, oysters, chicken, Andouille sausage, duck, shrimp, and game birds."},
        {"tag": "Jambon",
        "response": "Ham"},
        {"tag": "Jamon",
        "response": "Ham"},
        {"tag": "Jamon De York",
        "response": "Mild,cured and cooked ham."},
        {"tag": "Jamon Iberico",
        "response": "Cured ham from the cerdo Ibérico – black hoofed (pata negra) pigs."},
        {"tag": "Jamon Iberico De Bellota",
        "response": "Dry cured ham from free range black hoofed Cerdo Ibérico pigs, who, prior to being sacrificed, are finished with an unlimited diet of acorns from holm oak and cork trees growing in the Dehesa forest / meadows."},
        {"tag": "Jamon Serrano",
        "response": "Dry cured mountain ham, similar to prosciutto, but has significantly less salt and fat. A staple of the Spanish diet."},
        {"tag": "Japanese Plum Wine",
        "response": "A popular, sweet, alcoholic drink made from plums."},
        {"tag": "Jardiniere",
        "response": "A fresh mix of vegetables cut into julienne"},
        {"tag": "Jarra Graduada",
        "response": "Measuring cup"},
        {"tag": "Jaune d’Oeuf",
        "response": "Egg yolk"},
        {"tag": "Jell",
        "response": "a solidifying process usually using gelatin"},
        {"tag": "Jerez",
        "response": "Sherry"},
        {"tag": "Jerusalem Artichoke",
        "response": "A tuber, also called sunchoke, with a very firm flesh and a flavor reminiscent of globe artichokes. These are used as a vegetable, in soups, or cooked and served in salads."},
        {"tag": "Ji",
        "response": "A prefix usually meaning “locally made or caught”"},
        {"tag": "Jicama",
        "response": "A large bulbous root vegetable with a thin brown skin and white crunchy flesh. Its sweet, nutty flavor is good both raw and cooked. It is a fair source for vitamin C and potassium."},
        {"tag": "Judias",
        "response": "White beans, similar to limas"},
        {"tag": "Jugo de Naranja",
        "response": "Orange Juice"},
        {"tag": "Jugo/Zumo",
        "response": "Juice"},
        {"tag": "Jugoso",
        "response": "Juicy"},
        {"tag": "Julienne",
        "response": "Foods that are cut in long, thin strips. The term is usually associated with vegetables, but may be applied to cooked meat or fish."},
        {"tag": "Jurel de castilla",
        "response": "Yellowtail"},
        {"tag": "Jus",
        "response": "A rich, lightly reduced stock used as a sauce for roasted meats, made from the juice of the meat itself. Obtained by deglazing the pan after cooking, and usually reduced to achieve the rich flavor desired. Jus lie is jus that has been slightly thickened with cornstarch or flour. Sometimes called “au jus,” although the term means “with juice.”"},
        {"tag": "Kachori",
        "response": "Deep-fried pastry patties made from white flour, ghee, and water. Typically stuffed with spiced mashed vegetables."},
        {"tag": "Kachumber",
        "response": "An Indian salad prepared with cucumbers, tomatoes, and onions. Seasoned with salt, sugar, and lemon juice."},
        {"tag": "Kaibashira",
        "response": "Large scallops; the shellfish valve muscles"},
        {"tag": "Kaiware",
        "response": "A Daikon-radish sprout roll"},
        {"tag": "Kajiki",
        "response": "Swordfish"},
        {"tag": "Kaki",
        "response": "Oysters"},
        {"tag": "Kakomi Sushi",
        "response": "The battleship roll; often used for oysters, quail eggs, Ikura, and Tobiko."},
        {"tag": "Kalakukko",
        "response": "A Finnish dish of bread filled with fish."},
        {"tag": "Kale",
        "response": "A ruffled-leafed green vegetable that is a member of the cabbage family."},
        {"tag": "Kalvan",
        "response": "Curry"},
        {"tag": "Kamaboko",
        "response": "Fish cake made from pounded whitefish that is mixed with cornstarch, formed into a sausage-shape, and cooked. Commonly used in California Rolls."},
        {"tag": "Kampyo",
        "response": "Dried Gourd prepared as long, translucent-brown fettuccine-shaped strips."},
        {"tag": "Kani",
        "response": "Cooked crab meat"},
        {"tag": "Kanpachi",
        "response": "Very young yellowtail"},
        {"tag": "Kanpyo",
        "response": "Dried Gourd prepared as long, translucent-brown fettuccine-shaped strips."},
        {"tag": "Kanpyo Maki",
        "response": "Pickled-gourd rolls"},
        {"tag": "Kappa Maki",
        "response": "Cucumber-filled Sushi rolls"},
        {"tag": "Kappa Sushi",
        "response": "Cucumber-filled Sushi rolls"},
        {"tag": "Kappa Zushi",
        "response": "Cucumber-filled Sushi rolls"},
        {"tag": "Karanji",
        "response": "Pastries made from whole-wheat flour. Filled with freshly grated coconut and sugar."},
        {"tag": "Karei",
        "response": "Sole, flounder, or flatfish"},
        {"tag": "Katsu",
        "response": "A cutlet; katsu refers to fried foods coated with bread crumbs, as opposed to Tempura, which is fried foods coated with batter."},
        {"tag": "Katsu Don",
        "response": "Deep-fried pork cutlet with cooked vegetables and egg served over a bed of rice."},
        {"tag": "Katsuo",
        "response": "Bonito; also known as skipjack tuna."},
        {"tag": "Kazunoko",
        "response": "Herring roe usually marinated in Sake, Broth, and Soy Sauce. Sometimes served raw."},
        {"tag": "Kebab",
        "response": "Marinated and spiced small pieces of poultry, fish, ground meat, or vegetables, skewered and grilled over a fire. Kebabs may also be shallow fried or grilled. Also spelled “kabob.”"},
        {"tag": "Kedgeree",
        "response": "A British variation of an Indian dish with rice, smoked fish, hard cooked eggs, and bechamel sauce flavored with curry. Finnan Haddie is most often used, but smoked sturgeon or salmon are excellent substitutes."},
        {"tag": "Kefir",
        "response": "A fermented milk drink similar to a lassi, flavored with salt or spices. Where available, kefir is made with camel milk."},
        {"tag": "Ketchup",
        "response": "A term derived from Asian cookery, this sauce is known to be a sweet sauce made from tomatoes. Other forms of ketchup are made from walnuts, mushrooms, and grapes."},
        {"tag": "Khasta Roti",
        "response": "A firmer variation of chapatti bread"},
        {"tag": "Kheema",
        "response": "Ground meat, raw or cooked."},
        {"tag": "Kheer",
        "response": "A rice pudding, served either hot or cold, made from rice, milk, sugar, and cardamom. Sometimes topped with nuts."},
        {"tag": "Khichadi",
        "response": "Mildly spiced rice and daal."},
        {"tag": "Khoya",
        "response": "An Indian cooking term that refers to the process of boiling milk and stirring continuously over a low flame. Reduces and thickens the food to a soft cream-cheese consistency. This method of cooking is used widely in desserts and sweet meats."},
        {"tag": "Kinome",
        "response": "Leaves of the Japanese prickly ash (Sanshoo) used to flavor soups and simmered foods."},
        {"tag": "Kirsch",
        "response": "A clear brandy distilled from cherry juice and pits. In cookery, it is most prominently known as a flavorful addition to fondue and cherries jubilee."},
        {"tag": "Kiwi",
        "response": "A fresh, egg-sized berry with a brown, furry skin and green flesh. Its flavor resembles berries and melons."},
        {"tag": "Knead",
        "response": "to press and fold dough in order to give it a smoother consistency needed for leavening"},
        {"tag": "Kobashiri",
        "response": "Small scallops similar to Kaibashira"},
        {"tag": "Kofta",
        "response": "alls, dumplings, or rolls made from spiced meat or vegetables."},
        {"tag": "Kohada",
        "response": "Japanese shad, gizzard shad, or young punctatus"},
        {"tag": "Koi",
        "response": "Saltwater carp"},
        {"tag": "Kokotxa",
        "response": "Gelatinous “cheeks” of hake, cod, (Basque)"},
        {"tag": "Kombu",
        "response": "Kelp, or a large type of seaweed, which may be dried and prepared in a sheet form. Also used as a soup stock or in Nabe (hot pot) dishes."},
        {"tag": "Kombu(Konbu)",
        "response": "A large edible seaweed used in Japanese cooking."},
        {"tag": "Konbu",
        "response": "Kelp, or a large type of seaweed, which may be dried and prepared in a sheet form. Also used as a soup stock or in Nabe (hot pot) dishes."},
        {"tag": "Korma",
        "response": "A rich curry sauce thickened with yogurt, nuts, or poppy seeds."},
        {"tag": "Kosher Salt",
        "response": "very coarse salt"},
        {"tag": "Kugelhopf",
        "response": "A yeast cake from Alsace baked in a large crown-like earthenware dish. It is similar to brioche, though less rich, and flavored with currants or golden raisins and almonds. This is mainly eaten for breakfast."},
        {"tag": "Kulcha",
        "response": "Flatbread often stuffed with onion or potatoes and seasoned with cilantro."},
        {"tag": "Kulfi",
        "response": "Sweet aromatic ice cream made from cream, milk, sugar, mango, pistachios, and saffron. The most popular are the mango kulfi, pista kulfi and the malai kulfi."},
        {"tag": "Kumquat",
        "response": "A round, small, Asian citrus fruit with a soft bright orange rind and slightly tart orange flesh. These are used in pastry making, preserves, and chutneys."},
        {"tag": "Kuro goma",
        "response": "Black sesame seeds"},
        {"tag": "Kurodai",
        "response": "Snapper"},
        {"tag": "Kuruma Ebi",
        "response": "Prawn"},
        {"tag": "Kuscus",
        "response": "Sweet Semolina and pistachio cake"},
        {"tag": "Lado",
        "response": "Side"},
        {"tag": "Laitue",
        "response": "Lettuce"},
        {"tag": "Lampuga",
        "response": "Dolphin"},
        {"tag": "Langosta",
        "response": "Lobster"},
        {"tag": "Langostino",
        "response": "A small 1-inch shellfish that has a strong shrimp flavor."},
        {"tag": "Langouste",
        "response": "The French name for the spiny lobster, differentiating from Maine lobsters in that they have no claws. Langoustes are warm water crustaceans that can be found in the south Atlantic Ocean, the Mediterranean Sea, and off the coasts of South America, Australia and the West Indies."},
        {"tag": "Langoustine",
        "response": "The French name for Dublin prawn. These are small pink crustaceans resembling crayfish, with a taste and texture closest to lobster. Their claws are quite long but have no edible meat in them. Like the langouste, these are found in warm waters."},
        {"tag": "Langue",
        "response": "tongue"},
        {"tag": "Lapin",
        "response": "rabbit"},
        {"tag": "Lard",
        "response": "bacon or salt pork"},
        {"tag": "Larder",
        "response": "A cool area for storing food."},
        {"tag": "Larding",
        "response": "A technique by which thin strips of back fat, or vegetables, are inserted into a piece of meat. These strips help the meat to remain juicy during cooking. Larding with vegetables gives the meat a contrast of color plus the addition of flavor. This practice is not used as often now because of the higher quality of meat available to us."},
        {"tag": "Lardons",
        "response": "Pieces of pork fat used as flavoring."},
        {"tag": "Lasagna",
        "response": "Wide, flat ribbon-shaped pasta sheets. Normally precooked and then baked in the oven between layers of sauce and ricotta cheese."},
        {"tag": "Lassi",
        "response": "A frothy yogurt drink, sweet or salty, flavored with pistachios, cardamom, cumin, or rose water."},
        {"tag": "Lata",
        "response": "Tin, can"},
        {"tag": "Latifundio",
        "response": "Large country estate"},
        {"tag": "Latte fritto",
        "response": "Fried custard dessert"},
        {"tag": "Latticini",
        "response": "Fresh cheeses; milk products"},
        {"tag": "Laurel",
        "response": "bayleaf"},
        {"tag": "Laurier",
        "response": "bay leaf"},
        {"tag": "Lavar",
        "response": "Wash"},
        {"tag": "Leaven",
        "response": "yeast: also the process of whipping egg whites that produces air bubbles and causes the rising of baked items"},
        {"tag": "Leche",
        "response": "Milk"},
        {"tag": "Leche Cuajada",
        "response": "Junket"},
        {"tag": "Lechoso",
        "response": "Milky"},
        {"tag": "Lechuga",
        "response": "Lettuce"},
        {"tag": "Lefse",
        "response": "A thin, flat potato pancake, about the consistency of a tortilla and cooked by similar method. Very mild, starchy, slightly sweet taste. Lefse is enhanced by the addition of peanut butter, brown sugar, or lutefisk."},
        {"tag": "Legumbres",
        "response": "Vegetables"},
        {"tag": "Lemon Grass",
        "response": "Resembling spring onion, this subtropical root imparts a delicious fresh lemon flavor to Southeastern Asian dishes."},
        {"tag": "Lengua",
        "response": "Tongue"},
        {"tag": "Lenguado",
        "response": "Flounder or Sole"},
        {"tag": "Lentamente",
        "response": "Gradually"},
        {"tag": "Lentejas",
        "response": "Lentils"},
        {"tag": "Lentils",
        "response": "Flat, disk-shaped dried beans that have a rich, somewhat sweet and peppery flavor when cooked. Brown lentils, the most popular variety and high in protein, are used in a wide number of food dishes, such as soups and stews."},
        {"tag": "Levadura",
        "response": "Baking Powder"},
        {"tag": "Liaison",
        "response": "The process of thickening a sauce, soup, or stew. This includes all rouxs, starch and water mixtures (slurries), beurre manié, and egg yolks with or without cream. Egg yolks must be tempered with hot liquid before adding to the liquid in order to prevent curdling."},
        {"tag": "Lie",
        "response": "slightly thickened"},
        {"tag": "Liebre",
        "response": "Hare"},
        {"tag": "Lier",
        "response": "To thicken (usually with egg yolk)"},
        {"tag": "Ligado",
        "response": "Thickened, bound with cream, egg yolk, or butter"},
        {"tag": "Light olive oil",
        "response": "Although light olive oil is paler in color and less flavorful than Virgin or regular olive oil, it is still 100 percent pure olive oil. It is used in salads and marinades when a rich, distinctive oil flavor is not desired."},
        {"tag": "Lima",
        "response": "Lemon"},
        {"tag": "Limón",
        "response": "Lime"},
        {"tag": "Limousin Beef",
        "response": "A breed of cattle which is naturally lower in fat and cholestrol. These cattle were brought to the United States from France around 1930."},
        {"tag": "Limpiar Con Agua",
        "response": "Rinse"},
        {"tag": "Limpiar Con Un Paño",
        "response": "Wipe"},
        {"tag": "Linguine",
        "response": "Thin, spaghetti-like pasta that has been flattened into an oval or ribbon shape."},
        {"tag": "Linzertorte",
        "response": "An Austrian pastry comprised of a short crust dough flavored with ground almonds and hazelnuts, cinnamon, and lemon zest. This is then spread with raspberry jam and topped with a cross-hatch of dough. Almond paste is sometimes layered underneath the raspberry jam. Other versions of this use fresh cranberries or apricots in the filling."},
        {"tag": "Lo Mein",
        "response": "In this dish, boiled and drained noodles are added to other ingredients, such as vegetables and/or meat, and briefly stir fried during the final stages of cooking. Consequently, these noodles have more flavor than Chow Mein, where the meat and vegetables are served over noodles that have been cooked separately."},
        {"tag": "Lobster Mushroom",
        "response": "A wild mushroom that has a firm texture and a red and orange color like lobster shells."},
        {"tag": "Lomo",
        "response": "Poin, usually pork"},
        {"tag": "Lomo Embuchado",
        "response": "Pork loin marinated in vinegar, pimentón and other spices"},
        {"tag": "London Broil",
        "response": "Commonly used to refer to boneless cuts, such as flank steak, beef top round steak, and the shoulder steak. It is marinated and then broiled or grilled."},
        {"tag": "Longaniza",
        "response": "A thin sausage from Cataluña"},
        {"tag": "Lotus",
        "response": "A water lily whose root can be stuffed with glutinous rice, steamed as a dessert, or sliced as a sweet fruit. Chinese chefs commonly wrap its leaves around food to impart a pleasant tea-like flavor. Finally, its seeds are can be used in sweet syrups, pastes, soups, rice desserts, and snacks."},
        {"tag": "Luchi",
        "response": "A Bengali form of the puffed deep-fried bread puri. Made with maida, or white flour."},
        {"tag": "Lychee",
        "response": "A plum-sized fruit that has a thin, hard, removable, rough shell. Its white, juicy flesh surrounds a large dark-brown stone."},
        {"tag": "Lyonnaise Sauce",
        "response": "A classic French sauce preparation made with sauteed onions, white wine and demi-glace. The sauce is strained before being served with meats and sometime poultry."},
        {"tag": "Lyonnaise, à la",
        "response": "A French term for “in the manner of Lyons” Dishes include onions which have been cooked golden brown and seasoned with wine, garlic, and parsley."},
        {"tag": "Macaire",
        "response": "A potato pancake made with seasoned potato puree."},
        {"tag": "Macaroni",
        "response": "Hollow, short pasta shapes. There are many versions varying in size and length."},
        {"tag": "Macaroon",
        "response": "A small round cookie that has a crisp crust and a soft interior. Many versions bought commercially have been thoroughly dried. These cookies may be made from almonds, though coconut is common in the US. The may also be flavored with coffee, chocolate, or spices. Amaretti, from Italy, are a type of macaroon."},
        {"tag": "Macedoine",
        "response": "A mixture of fruit or vegetables. Vegetable macedoine are cut into small dice and used as a garnish to meats. Fruit macedoine are cut in larger pieces and often marinated in sugar syrup with liqueur."},
        {"tag": "Macerate",
        "response": "Soaking fruit or vegetables in wine, liquor, or syrup so that they may absorb these flavors. Salt and sugar macerations are used to draw excess moisture out of the food for a secondary preparation. This is done for canning, jam and preserve making, and to remove bitter flavors from vegetables."},
        {"tag": "Machacar",
        "response": "Grind"},
        {"tag": "Mache",
        "response": "A wild lettuce with small round leaves that may be used for salads or cooked and used as you would spinach. The taste is a little less pronounced than spinach. Mache grows wild, and can be found in the fall. It is cultivated in France, Italy, and the US from September to April."},
        {"tag": "Madeleine",
        "response": "A small shell shaped cookie or cake made from a rich batter similar to g‚noise. These may be flavored with almonds, lemon, or cinnamon."},
        {"tag": "Maduro",
        "response": "Ripe"},
        {"tag": "Magdalena",
        "response": "Sweet breakfast cupcake"},
        {"tag": "Magret",
        "response": "The breast meat from a mallard or Barbary duck. These ducks are specially raised for foie gras. Their breasts are large and have a much thinner layer of fat than do the Peking or Long Island duckling."},
        {"tag": "Magro",
        "response": "Lean (meat)"},
        {"tag": "Maguro",
        "response": "Tuna. Unlike Toro, which is the tuna belly (the fatty part), maguro is the leaner flesh from the sides of the fish."},
        {"tag": "Maguro Temaki",
        "response": "Tuna Temaki"},
        {"tag": "Mahi Mahi",
        "response": "Warm water, flavorful fish with a medium textured dark flesh that browns when cooked."},
        {"tag": "Maida",
        "response": "Unbleached white flour"},
        {"tag": "Maigre",
        "response": "lean"},
        {"tag": "Mais",
        "response": "Maize, sweet corn"},
        {"tag": "Maitre d’Hotel",
        "response": "Restaurant manager"},
        {"tag": "Maitre d’Hotel Butter",
        "response": "This is the most common of all the compound butters. It is flavored with lemon and chopped parsley and used to garnish fish and grilled meats. Garlic may be added, but it would then be called escargot butter."},
        {"tag": "Maiz",
        "response": "Corn off the Cob"},
        {"tag": "Maíz Tierno",
        "response": "Sweet corn"},
        {"tag": "Majado",
        "response": "A mixture of spices, herbs, often added in the final stages of cooking, prepared in a mortar and pestle"},
        {"tag": "Makajiki",
        "response": "Blue marlin or swordfish"},
        {"tag": "Maki",
        "response": "A Japanese dish of Sushi rice and raw vegetables wrapped in a seaweed sheet. While most Maki rolls have the Nori sheets wrapped around the outside, some Sushi rolls (such as California and Rainbow Rolls), place the rice on the outside."},
        {"tag": "Maki Sushi",
        "response": "A Japanese dish of Sushi rice and raw vegetables wrapped in a seaweed sheet. While most Maki rolls have the Nori sheets wrapped around the outside, some Sushi rolls (such as California and Rainbow Rolls), place the rice on the outside."},
        {"tag": "Maki Zushi",
        "response": "A Japanese dish of Sushi rice and raw vegetables wrapped in a seaweed sheet. While most Maki rolls have the Nori sheets wrapped around the outside, some Sushi rolls (such as California and Rainbow Rolls), place the rice on the outside."},
        {"tag": "Manchego",
        "response": "Of the high mountain plane of La Mancha, sheep’s cheese from that reagion: queso manchego"},
        {"tag": "Mango",
        "response": "An oval, tropical fruit that has a very juicy, sweet flavored, orange flesh."},
        {"tag": "Manicotti",
        "response": "Large, tubular pasta that may have a ridged or smooth surface, and straight or diagonal ends. Generally filled with ricotta cheese and spinach, then baked. Similar to Cannelloni."},
        {"tag": "Manteca",
        "response": "Lard"},
        {"tag": "Mantecado",
        "response": "Christmas sweet made of almonds and lard. The most crumbly version is called polvoron"},
        {"tag": "Mantecato",
        "response": "Literally “whipped”; ice cream"},
        {"tag": "Mantequilla",
        "response": "Butter"},
        {"tag": "Manzana",
        "response": "Apple"},
        {"tag": "Manzanilla",
        "response": "A dry, light,crisp wine, similar to fino sherry, produced exclusively in Sanlucar de Barrameda; or chamomile for tea; or variety of table olive"},
        {"tag": "Maquereau",
        "response": "Mackerel"},
        {"tag": "Mar y Montaña",
        "response": "“sea and mountain,” any dish combining seafood and meat: “Surf & turf”"},
        {"tag": "Marble",
        "response": "to swirl or layer one food item into another to create a ribbon effect when cooked and sliced"},
        {"tag": "Marengo",
        "response": "A chicken stew made with wine, tomatoes, and garlic. The stew is served over toast, garnished with crayfish and fried eggs. The modern versions of this omit the eggs and substitute shrimp for the crayfish. Of course, other liberties have been taken with this recipe to include black olives, peppers, and veal. The dish is rumored to have been named for the dish served to General Bonaparte after his army s defeat of the Austrians in the battle of Marengo."},
        {"tag": "Margherita Pizza",
        "response": "An Italian flatbread pizza made of buffalo mozzarella cheese, red tomatoes, and green basil. Traditionally cooked in a wood burning oven."},
        {"tag": "Marinade",
        "response": "A liquid sauce that is used to soften and flavor meats before cooking. Marinades can contain vinegar, oil, lemon, wine, beer, or herbs and spices."},
        {"tag": "Marinar",
        "response": "To Marinate."},
        {"tag": "Marinara",
        "response": "A traditional Italian vegetable sauce made with tomatoes, onions, olive oil, and garlic."},
        {"tag": "Marinate",
        "response": "To soak in marinade (see above)."},
        {"tag": "Marinera",
        "response": "general term for seafood cookery, as in cocina marinera"},
        {"tag": "Marisco",
        "response": "shellfish"},
        {"tag": "Marmitako",
        "response": "Tuna and potato casserole from the Basque Country"},
        {"tag": "Marmite",
        "response": "Stockpot"},
        {"tag": "Marron",
        "response": "Chestnut"},
        {"tag": "Marsala",
        "response": "A sweet Italian dessert wine."},
        {"tag": "Marzipan",
        "response": "An almond paste with the addition of egg whites. This mixture is kneaded into a smooth paste and used to wrap or layer cakes and candies. Marzipan is also shaped into figures of animals, fruits, and vegetables, and sold in pastry or candy shops."},
        {"tag": "Masa",
        "response": "Dough"},
        {"tag": "Masago",
        "response": "Grilled Capelin roe often served as an appetizer."},
        {"tag": "Masala",
        "response": "The Hindi word for “spices”; a refined blend of spices, herbs, and other seasonings that flavor the Indian cuisine."},
        {"tag": "Mascarpone",
        "response": "A rich delicately flavored triple cream-cheese. Its unique sweetness makes it ideal for desserts. Mascarpone is an essential ingredient of Tiramisu and can be churned into a rich velvety ice cream."},
        {"tag": "Matafan",
        "response": "A thick pancake eaten sweet as a snack, or savory as an accompaniment to cheese. They are also made with bacon, spinach, and potatoes."},
        {"tag": "Matanza",
        "response": "Traditional sacrificing and processing of a pig"},
        {"tag": "Matar",
        "response": "Peas"},
        {"tag": "Matar Paneer",
        "response": "Curried peas with cubes of fried homemade cheese."},
        {"tag": "Matelote",
        "response": "A French fish stew made with wine. The Alsatian version of this dish is made with freshwater fish, Riesling wine, and thickened with cream and egg yolks. The Normandy version includes seafood and is flavored with cider and Calvados. These stews are normally embellished with pearl onions and mushrooms."},
        {"tag": "Mawa",
        "response": "An Indian cooking term that refers to the process of boiling milk and stirring continuously over a low flame. Reduces and thickens the food to a soft cream-cheese consistency. This method of cooking is used widely in desserts and sweet meats."},
        {"tag": "Mayonesa",
        "response": "Mayonnaise"},
        {"tag": "Mazapan",
        "response": "a Christmas sweet made solely of ground almonds and honey."},
        {"tag": "Medaillons",
        "response": "Round pieces of meat"},
        {"tag": "Medallion",
        "response": "a small piece of meat (beef, chicken, pork, veal) lightly pounded into an oval or a round"},
        {"tag": "Meji",
        "response": "Tuna. Unlike Toro, which is the tuna belly (the fatty part), maguro is the leaner flesh from the sides of the fish."},
        {"tag": "Mejillon",
        "response": "Mussel"},
        {"tag": "Mekajiki",
        "response": "Blue marlin or swordfish"},
        {"tag": "Melanger",
        "response": "To mix two or more ingredient"},
        {"tag": "Melaza",
        "response": "Molasses"},
        {"tag": "Melba",
        "response": "The name of a popular dessert invented by Auguste Escoffier. Poached peach halves are served with vanilla ice cream and topped with fresh raspberry sauce."},
        {"tag": "Melocotón",
        "response": "Peach"},
        {"tag": "Melón",
        "response": "Melon"},
        {"tag": "Membrillo",
        "response": "Quince"},
        {"tag": "Menestra",
        "response": "Vegetable medley made mostly in the spring, originally from Navarra. It may also contain lamb or chicken."},
        {"tag": "Menta",
        "response": "Mint"},
        {"tag": "Menthe",
        "response": "Mint"},
        {"tag": "Menu De Gustacion",
        "response": "Tasting menu"},
        {"tag": "Menudo",
        "response": "A soup similar to pozole with the addition of tripe and meat broth. This, too, is served with assorted condiments for the diners to choose from."},
        {"tag": "Merendero",
        "response": "Picnic site, snack bar"},
        {"tag": "Merienda",
        "response": "Afternoon snack"},
        {"tag": "Meringue",
        "response": "Whipped egg whites to which sugar has been added to form a stiff paste. These are used to lighten mousses, cakes, and pastry creams. Unsweetened versions are used to lighten forcemeats. Meringue is also baked in a very low oven, forming crisp shells which are filled with fruit or ice cream. Small dried meringue shells are called vacherin."},
        {"tag": "Merluche",
        "response": "Hake"},
        {"tag": "Merluza",
        "response": "Hake, served lightly fried in Andalucía, or with salsa verde (parsley and olive oil) in the North"},
        {"tag": "Mesclun",
        "response": "This is a mix of very young lettuces and greens. Often this mix is stretched with herb or flower sprigs and bitter greens. These greens should be dressed very lightly, with only best oil and vinegar, so that their flavor will not be masked."},
        {"tag": "Meshimono",
        "response": "Rice mixed with meat or vegetables"},
        {"tag": "Meuniere",
        "response": "A method of cooking in which the meat of fish is dredged in flour and shallow fried in butter & served with sauce meuniere"},
        {"tag": "Mezclar",
        "response": "Mix"},
        {"tag": "Mezzani",
        "response": "Long, tubular pasta"},
        {"tag": "Mi Nei Salad",
        "response": "Fresh green salad with house dressing"},
        {"tag": "Michirones",
        "response": "A recipe from Murcia made from dried broad beans."},
        {"tag": "Miel",
        "response": "honey"},
        {"tag": "Miel De Cana",
        "response": "Sugar cane syrup"},
        {"tag": "Migas",
        "response": "Fried bread crumbs with garlic, chopped panceta, tocino, red pepper."},
        {"tag": "Mignonette",
        "response": "This is a term used to describe coarsely ground pepper used for au poivre preparations and in bouquet garni. This is also used to describe small round pieces of meat or poultry."},
        {"tag": "Milanese",
        "response": "This is used to describe foods that are dipped in egg and bread crumbs, sometimes parmesan cheese, and fried in butter."},
        {"tag": "Mille-Feuille",
        "response": "Small rectangular pastries made of crisp layers of puff pastry and pastry cream. This may also include savory fillings of similar presentation. The word mille-feuille means a thousand leaves."},
        {"tag": "Mince",
        "response": "to chop into very fine pieces"},
        {"tag": "Mincemeat",
        "response": "A sweet spicy mixture of candied and fresh fruits, wine, spices, and beef fat. Earlier recipes for this used beef or venison meat and beef fat. It is used primarily as a filling for pies served during the Christmas holiday season."},
        {"tag": "Minestrone",
        "response": "An Italian vegetable soup with beans and pasta or rice. This may contain any number of vegetables, but for authenticity, meat is never added."},
        {"tag": "Mirepoix",
        "response": "A mixture of chopped onion, carrot, and celery used to flavor stocks and soups. Ham or bacon are sometimes added to a mirepoix, depending on the specific preparation."},
        {"tag": "Mirin",
        "response": "A non-alcoholic version of sake (rice wine). It is sweet and syrupy."},
        {"tag": "Mirugai",
        "response": "A long-neck, slightly crunchy sweet clam"},
        {"tag": "Mise en Place",
        "response": "‘Everything in its place.” A term used in professional kitchens to describe the proper planning procedure for a specific station."},
        {"tag": "Miso",
        "response": "A salty paste made from fermented soy beans. This is used in Japanese cooking for sauces and soups."},
        {"tag": "Mixed Herbs",
        "response": "A collection of commer­cially available dried herbs."},
        {"tag": "Mochi",
        "response": "Steamed rice pounded into a sweet glutinous cake. Used as a staple ingredient in a variety of Japanese dishes, including desserts."},
        {"tag": "Mochigome",
        "response": "Steamed rice pounded into a sweet glutinous cake. Used as a staple ingredient in a variety of Japanese dishes, including desserts."},
        {"tag": "Modak",
        "response": "Cone shaped dumplings made from rice flour. Filled with a cooked mixture of freshly grated coconut and sugar."},
        {"tag": "Mojama",
        "response": "Dry cured salted fish, usually tuna."},
        {"tag": "Mojo",
        "response": "Sauce from the Canary Islands,such as mojo picón (spicy), mojo verde with coriander."},
        {"tag": "Molasses",
        "response": "This is a syrup resulting from the crystallization of raw sugar from the sap. Additional processing results in darker and stronger tasting molasses called black strap."},
        {"tag": "Mole",
        "response": "An assortment of thick sauces used in Mexican cooking made of chiles. These sauces are made with one or many chiles, and flavored with cumin, coriander, cinnamon, nuts, seeds, and chocolate. Their flavor is rich, smoky, and very complex. Some recipes are made with fresh herbs and have a green color. Chicken, turkey, and pork are then simmered in this sauce."},
        {"tag": "Molido",
        "response": "Ground"},
        {"tag": "Mollejas",
        "response": "Sweetbreads"},
        {"tag": "Mollet",
        "response": "soft boiled egg"},
        {"tag": "Mollete",
        "response": "A Spanish bread roll."},
        {"tag": "Mona",
        "response": "An Easter speciality of Catalonia -authentixcally is a rich brioche"},
        {"tag": "Mongetes",
        "response": "Popular Catalán dish of white beans and grilled sausage."},
        {"tag": "Monosodium Glutamate",
        "response": "Sometimes called MSG. A sodium salt found in wheat, beets, and soy bean products. It is used extensively in Chinese cookery, and thought to help accentuate the flavors of certain foods. Many people suffer serious allergic reactions to this, so widespread use has been reduced to the commercial food processing industry."},
        {"tag": "Monter",
        "response": "The beating of cream, egg whites, etc"},
        {"tag": "Monter au Beurre",
        "response": "“to mount with butter” to thicken sauces with pieces of cold, whole butter"},
        {"tag": "Mora",
        "response": "Blackberry"},
        {"tag": "Morcilla",
        "response": "A Spanish blood sausage often used in stews and sliced and fried as an accompaniment to eggs or as an appetizer. Often combined with rice or onion."},
        {"tag": "Morcón",
        "response": "Blood sausage"},
        {"tag": "Morel Mushroom",
        "response": "This is a wild mushroom with a honeycomb cap and hollow stem. These are very dirty mushrooms and must be cleaned carefully. Morels possess a wonderful earthy flavor, making them good candidates for soups, sauces, and fillings."},
        {"tag": "Mornay Sauce",
        "response": "A bechamel sauce with Gruyere cheese, sometimes enriched with egg yolks. It is used mainly for fish and vegetable preparations."},
        {"tag": "Morros",
        "response": "Snout, “face” meat, usually of pork or beef."},
        {"tag": "Mortadella",
        "response": "Large,lightly smoked sausages made of pork, beef, or veal. These are specialties of Bologna, which is where the US version of this sausage gets its name. Mortadella is a very smooth, pink sausage with a subtle creamy texture. They are studded with cubes of pork fat and peppercorns."},
        {"tag": "Mortero",
        "response": "Mortar, usually used for crushing spices, garlic, or herbs"},
        {"tag": "Mostarda di Cremona",
        "response": "These are fruits cooked and marinated in a spicy, mustard flavored syrup. It is a classic accompaniment to bollito misto. These fruits are also used in sauces for veal, and assorted stuffed pasta fillings."},
        {"tag": "Mostaza",
        "response": "Mustard"},
        {"tag": "Moti Roti",
        "response": "A risen flatbread made from unbleached white flour, yogurt, and water dough. This bread is baked on a tawa."},
        {"tag": "Mount",
        "response": "the addition of small pieces of cold butter to a sauce as a finishing process"},
        {"tag": "Moussaka",
        "response": "A layered dish of eggplant and lamb with tomatoes and onions. This is all bound with bechamel sauce and cooked au gratin."},
        {"tag": "Mousse",
        "response": "Sweet or savory dishes made of ingredients which are blended and folded together. These mixtures may be hot or cold, and generally contain whipped egg whites to lighten them. Cream is also used to lighten these dishes, though when used in large quantities, these preparations are called mousselines."},
        {"tag": "Mousseline",
        "response": "As stated above, these are fine purees or forcemeats that have been lightened with whipped cream. The term is also used to describe a hollandaise sauce which has unsweetened whipped cream folded into it."},
        {"tag": "Mousseron Mushroom",
        "response": "A wild mushroom with an off-white to beige color. The flavor is full-bodied and the texture is fleshy like bolets."},
        {"tag": "Mouton",
        "response": "Mutton"},
        {"tag": "Moyashi",
        "response": "Bean sprouts"},
        {"tag": "Mozzarella",
        "response": "Fresh, soft, white, mild Italian cheese that has a creamy texture, and is widely used in pizzas, lasagnas, and toasted sandwiches."},
        {"tag": "MSG",
        "response": "A chemical food enhancer, extracted from seaweed and other vegetable matter, used to deepen and develop the natural flavors of foods."},
        {"tag": "Mulet",
        "response": "Mullet"},
        {"tag": "Mull",
        "response": "heating wine, cider, or juices with spices, citrus and sugar"},
        {"tag": "Mulligatawny",
        "response": "A curried chicken soup adapted by the British from India. Originally the soup was enriched with coconut milk and embellished with almonds and apples. Newer versions make a lighter broth and flavor this with curry and coconut."},
        {"tag": "Mung Bean Noodles",
        "response": "These thin, translucent, flavorless threads of noodle, made from green gram flour, provide texture to the base of soup and stir fried dishes."},
        {"tag": "Mung Beans",
        "response": "Small green beans frequently used when sprouted. Mung bean sprouts are one of the key ingredients in Chop Suey. Dried Mung beans are ground into flour, which can be used to make Mung Bean noodles."},
        {"tag": "Murasaki",
        "response": "The Japanese Sushi-bar term that refers to soy sauce."},
        {"tag": "Mure",
        "response": "Blackberry"},
        {"tag": "Murgh",
        "response": "Chicken"},
        {"tag": "Murgh Masala",
        "response": "Curried chicken"},
        {"tag": "Mushimono",
        "response": "A Japanese term that describes steamed foods."},
        {"tag": "Muslo De Pollo",
        "response": "Chicken drumstick"},
        {"tag": "Naan",
        "response": "An Indian leavened flatbread made from unbleached white flour, yogurt, and water. Baked in a tandoor, this appetizer cleanses the palette and complements the piquancy of a dish. Many variations of this popular bread exist."},
        {"tag": "Nabeyakiudon",
        "response": "Noodle soup with Tempura shrimp, chicken, and vegetables."},
        {"tag": "Nachos",
        "response": "Corn tortilla chips covered with melted cheese."},
        {"tag": "Nage",
        "response": "An aromatic broth in which crustaceans are cooked. The shellfish is then served with this broth. The most notable of these dishes is lobster la nage."},
        {"tag": "Nama",
        "response": "A prefix usually meaning “raw”."},
        {"tag": "Nama Tako",
        "response": "Fresh or raw octopus"},
        {"tag": "Nanami Togarashi",
        "response": "Mixed hot spices for table use. The flavors consist of red pepper (Togarashi), ground sansho pepper pods, dried mandarin orange peel, black hemp seeds or white poppy seeds, Nori seaweed bits, and white sesame seeds."},
        {"tag": "Nantua",
        "response": "A name given to dishes containing crayfish. This includes crayfish tails and sauces made with a crayfish fumet."},
        {"tag": "Nap",
        "response": "to cover a food item with a thin, even layer of sauce"},
        {"tag": "Napoletana",
        "response": "Neapolitan-style; typically implies the use of rich tomato sauce."},
        {"tag": "Napper",
        "response": "to coat with sauce"},
        {"tag": "Naranja",
        "response": "Orange"},
        {"tag": "Nasu",
        "response": "Eggplant"},
        {"tag": "Nata",
        "response": "Cream"},
        {"tag": "Nata Agria",
        "response": "Sour cream"},
        {"tag": "Nata Montada",
        "response": "Whipped cream"},
        {"tag": "Natto",
        "response": "Fermented soy beans that have a strong smell and taste."},
        {"tag": "Navarin",
        "response": "French stew made with mutton or lamb and onions, turnips, potatoes, and herbs."},
        {"tag": "Navet",
        "response": "Turnip"},
        {"tag": "Neapolitan Salami",
        "response": "A very spicy Italian dry sausage made from pork meat. Seasoned with pepper, chili flakes, garlic, and wine. This luncheon meat is ideal for spicy snacks, appetizers, and pasta dishes."},
        {"tag": "Necci",
        "response": "Crepes or waffles made from chestnut flour and often stuffed with ricotta cheese."},
        {"tag": "Nectarina",
        "response": "Nectarine"},
        {"tag": "Negi",
        "response": "A green Japanese onion that resembles a thin leek."},
        {"tag": "Negi Toro",
        "response": "Chopped and mixed Negi-onion and Toro."},
        {"tag": "Negitoro Maki",
        "response": "Scallion-and-tuna roll"},
        {"tag": "Neta",
        "response": "The Sushi-bar term that refers to the fish topping in Nigiri Sushi."},
        {"tag": "New York Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around sliced apple, sliced avocado, and smoked salmon."},
        {"tag": "Ni Ika",
        "response": "Squid simmered in a soy-flavored stock"},
        {"tag": "Nicoise",
        "response": "Foods cooked in the style of Nice. These dishes may include garlic, Nicoise olives, anchovies, tomatoes, and green beans. Salad Nicoise is the most famous of all these dishes, consisting of potatoes, olives, green beans, and vinaigrette dressing."},
        {"tag": "Nigiri",
        "response": "Small rice balls usually topped with fish and Wasabi. Although there are several varieties of Nigirizushi, the most common include tuna, shrimp, shellfish, eel, squid, and octopus."},
        {"tag": "Nigiri Sushi",
        "response": "Small rice balls usually topped with fish and Wasabi. Although there are several varieties of Nigirizushi, the most common include tuna, shrimp, shellfish, eel, squid, and octopus."},
        {"tag": "Nigiri Zushi",
        "response": "Small rice balls usually topped with fish and Wasabi. Although there are several varieties of Nigirizushi, the most common include tuna, shrimp, shellfish, eel, squid, and octopus."},
        {"tag": "Nihon Shu",
        "response": "A Japanese wine, sauce, or marinade, made from fermented rice."},
        {"tag": "Nimono",
        "response": "The Sushi-bar term that refers to simmered or boiled foods."},
        {"tag": "Niscalo",
        "response": "Catalán wild mushroom"},
        {"tag": "No Engordante",
        "response": "Non-fattening"},
        {"tag": "Noisette",
        "response": "A round piece of meat of veal or lamb tenderloin.(b)small potato balls"},
        {"tag": "Noisette Butter",
        "response": "Whole butter which has been cooked until it reaches a rich, nutty brown color and aroma."},
        {"tag": "Nopales",
        "response": "“Young” leaves of the Prickly Pear Cactus"},
        {"tag": "Noques",
        "response": "flour dumplings"},
        {"tag": "Noras",
        "response": "Round dried pepper, mildly spicy, used in the cuisine of eastern Spain and a key ingredient in romesco sauce. It lends an earthy taste to foods, are used in several rice dishes including Bacalao a la Vizcaino. Noras are difficult to get, other than on the internet The hot red peppers found in grocery stores in the Latin American section are significantly different and cannot serve as a valid substitute."},
        {"tag": "Nori",
        "response": "Thin sheets of dried seaweed used in the Japanese cuisine to wrap Maki (Japanese Sushi rolls) and/or garnish dishes."},
        {"tag": "Nori Maki",
        "response": "Sushi rice and seafood rolled in dried seaweed sheets."},
        {"tag": "Nori Seaweed",
        "response": "Thin dry sheets of seaweed used in Japanese cooking. It is mainly used to wrap sushi and as garnish for other cold presentations."},
        {"tag": "Nori Tama",
        "response": "Sweetened egg wrapped in dried seaweed"},
        {"tag": "Norimaki",
        "response": "Sushi rice and seafood rolled in dried seaweed sheets."},
        {"tag": "Nougat",
        "response": "A candy made from sugar and honey mixed with nuts. This mixture is then formed into slabs and sliced."},
        {"tag": "Nougatine",
        "response": "A darker candy, made of caramel syrup and nuts. This is rolled into thin sheets and formed into cups or bowls to serve as a vessel for other candy or fruit."},
        {"tag": "Nouilles",
        "response": "Noodles"},
        {"tag": "Nueces",
        "response": "Walnuts"},
        {"tag": "Nuez de Castilla",
        "response": "Walnuts"},
        {"tag": "Nuez De Mantequilla",
        "response": "Dollup of butter"},
        {"tag": "Nuez Moscada",
        "response": "Nutmeg"},
        {"tag": "Nuoc-Mam",
        "response": "This is a Vietnamese fish sauce made with fermented fish or shrimp. Another name for this is nam pla."},
        {"tag": "Nutella",
        "response": "A commercial brand of gianduja. This is a creamy paste of chocolate and hazelnuts treasured in Italy. This is used in candy making, for flavored milk drinks, and when thinned out, spread on bread as a quick snack."},
        {"tag": "Ocha",
        "response": "Tea"},
        {"tag": "Odori Ebi",
        "response": "Live, “dancing” shrimp; living Ama Ebi."},
        {"tag": "Oeuf",
        "response": "The French word for egg."},
        {"tag": "Oeuf a la Neige",
        "response": "Sweet meringue puffs that are poached in milk and chilled. When served, these puffs are drizzled with caramel and served with creme anglaise."},
        {"tag": "Offal",
        "response": "The internal organs of an animal (usually beef, pork, or sheep)."},
        {"tag": "Ohyo",
        "response": "Halibut"},
        {"tag": "Oie",
        "response": "Goose"},
        {"tag": "Oignon",
        "response": "onion"},
        {"tag": "Okonomi Sushi",
        "response": "Small rice balls usually topped with fish and Wasabi. Although there are several varieties of Nigirizushi, the most common include tuna, shrimp, shellfish, eel, squid, and octopus."},
        {"tag": "Okonomi Zushi",
        "response": "Small rice balls usually topped with fish and Wasabi. Although there are several varieties of Nigirizushi, the most common include tuna, shrimp, shellfish, eel, squid, and octopus."},
        {"tag": "Okonomiyaki",
        "response": "A thick pancake usually served with meat or seafood."},
        {"tag": "Olive Oil",
        "response": "Olive oil has a very distinctive flavor, and has become more prominent in American cooking today. Gradings of olive oils are determined by the methods of extraction and the acid content of the resulting oil. Virgin oils are those obtained from the first pressing of the olive without further refinement. The finest olive oil is extra virgin, with an acid content of 1%. Following this are superfine at 1.5%, fine at 3%, and virgin at 4%. Pure olive oils are those which have been extracted by heat. These are of 100% olive oil, but their flavor can result in a harsh, bitter aftertaste. Pomace olive oil is refined from the final pressings and under heat and pressure. The taste is inferior to other olive oils and should never be substituted for them. Olive oil becomes rancid very easily, more so when exposed to heat or light. Always store tightly sealed in a cool, dark place."},
        {"tag": "Olives",
        "response": "This is the edible fruit of the olive tree. Found in both green(unripe) and black(ripe) forms, each must undergo a process to remove the bitterness found in them. This curing process is done with brine solutions, salt curing, and drying."},
        {"tag": "Olla Podrida",
        "response": "A substantial cocido stew typical of Burgos"},
        {"tag": "Onigiri",
        "response": "A sticky rice ball often wrapped in Nori seaweed and filled with fish or pickled plum."},
        {"tag": "Opakapaka",
        "response": "Pink snapper. A local Hawaiian favorite, especially around the holidays."},
        {"tag": "Oregano",
        "response": "A robust, slightly bitter, and peppery herb that is often a key ingredient in tomato-based Italian pasta sauces."},
        {"tag": "Organic",
        "response": "grown or raised without chemicals or artificial growth enhancers, without chemical fertilizers or chemical pesticides."},
        {"tag": "Orzo",
        "response": "Small rice shaped pasta."},
        {"tag": "Oseille",
        "response": "French term for sorrel."},
        {"tag": "Oshi Sushi",
        "response": "Rice Sushi topped with fish. Made by pressing the rice with a box or mold."},
        {"tag": "Oshi Zushi",
        "response": "Rice Sushi topped with fish. Made by pressing the rice with a box or mold."},
        {"tag": "Oshibori",
        "response": "The wet towel that cleans one’s hands before the meal."},
        {"tag": "Oshinko",
        "response": "The general Japanese term usually referring to mixed pickles, mixed vegetables, Daikon rolls, or cucumbers."},
        {"tag": "Osso Buco",
        "response": "An Italian dish comprised of crosscut slices of the veal shank braised with vegetables, aromatics, and stock. Milanese style is served with saffron risotto and gremolata."},
        {"tag": "Ostiones",
        "response": "Oysters"},
        {"tag": "Otoro Maki",
        "response": "Fatty-tuna roll made from the lower belly"},
        {"tag": "Ouzo",
        "response": "A clear anise-flavored liqueur from Greece. It is generally mixed with water which turns it whitish and opaque."},
        {"tag": "Oven Bake",
        "response": "to cook foods surrounded by hot dry air"},
        {"tag": "Oven Broil",
        "response": "to cook with radiant heat from above"},
        {"tag": "Oven Poach",
        "response": "to cook in the oven with a small amount of water or another liquid"},
        {"tag": "Oyako Don",
        "response": "Cooked chicken, egg, and vegetables over rice"},
        {"tag": "Oyster Mushroom",
        "response": "A wild mushroom that grows in clusters on the side of trees. It is off-white to greyish in color and has a soft texture. These mushrooms have a very subtle flavor. They are also being cultivated in the US, making them readily available in markets and moderately priced."},
        {"tag": "Oyster Mushrooms",
        "response": "A fan-shaped mushroom that has white flesh and a grayish-brown exterior. This moist, peppery, and robust fungus is often served raw in salads. Oyster mushrooms, which have a softened flavor when cooked, are also a pleasant addition to casseroles, soups, or stir-fried dishes."},
        {"tag": "Oyster Sauce",
        "response": "A dark brown delicate sauce made from oysters and soy sauce. This staple condiment adds richness to dishes without diminishing their natural flavors."},
        {"tag": "Pa Amb Tomaquet",
        "response": "Catalan tapa: bread or toast rubbed with olive oil and fresh crushed tomato"},
        {"tag": "Paan",
        "response": "A thick, smooth, dark green leaf. In the Indian cuisine, this leaf is wrapped around fragrant spices, fennel seeds, slaked lime paste, tobacco leaves, colored shreds of coconut, and fine shreds of betel nut. Paan, which acts as a breath-freshener, digestive, antacid, and carminative, is eaten after a meal. It is garnished with Varak."},
        {"tag": "Paella",
        "response": "A Spanish rice dish originating in the town of Valencia. There are hundreds of recipes for paella, all claiming to be authentic. The only ingredients that are necessary for paella are rice, tomatoes, and saffron. Other ingredients are chicken, chorizo, mussels, squid, peppers, and beans. More elaborate preparations include shrimp, lobster, and duck."},
        {"tag": "Paillard",
        "response": "A piece of meat or fish that has been pounded very thinly and grilled or sauteed."},
        {"tag": "Pailles",
        "response": "Straw (straw potatoes)"},
        {"tag": "Pakoras",
        "response": "A, popular, sizzling, Indian crispy and spicy snack served with coriander chutney. Slices of potatoes, onion, chilies, spinach leaves, and eggplant are dipped in a batter, made from chickpea flour and dried spices, and then deep fried. Usually served with chai."},
        {"tag": "Paleta",
        "response": "Flavored Ice on a Stick"},
        {"tag": "Palitos De Queso",
        "response": "Cheese straws"},
        {"tag": "Palmier",
        "response": "A cookie made of sheets of puff pastry that are rolled in sugar and folded to resemble palm leaves. These cookies are baked until the sugar becomes caramelized."},
        {"tag": "Pan",
        "response": "Bread"},
        {"tag": "Pan Ázimo",
        "response": "Unleavened bread"},
        {"tag": "Pan Broil",
        "response": "cooking food in a heavy pan without added fat and removing any fat that is produced as you cook the item"},
        {"tag": "Pan De Molde",
        "response": "Sliced bread"},
        {"tag": "Pan Dulce",
        "response": "Sweet bread"},
        {"tag": "Pan Duro",
        "response": "Stale bread"},
        {"tag": "Pan Fry",
        "response": "to cook in a moderate amount of fat, uncovered"},
        {"tag": "Pan Integral",
        "response": "Whole wheat bread"},
        {"tag": "Pan-bagnat",
        "response": "A sandwich from southern France, consisting of small round loaves of bread which have been hollowed out and filled with onions, anchovies, black olives, and tuna, then drenched in extra virgin olive oil."},
        {"tag": "Panada",
        "response": "A thick paste used as a binding agent for forcemeats. Flour panadas are made in a style similar to choux paste. Other types use bread crumbs or potato puree."},
        {"tag": "Panade",
        "response": "a binding agent"},
        {"tag": "Pancarre",
        "response": "Sliced bread that is traditionally used for canapes and sandwiches."},
        {"tag": "Panceta",
        "response": "Cured pork belly"},
        {"tag": "Pancetta",
        "response": "Cured pork belly that is rolled and tied. Unlike American bacon, this is not smoked."},
        {"tag": "Pancotto",
        "response": "Literally “cooked bread”; this soup usually contains bread, olive oil, and cheese"},
        {"tag": "Paneer",
        "response": "A type of fresh, unaged cheese used in Indian and other South Asian cuisines, similar to queso blanco"},
        {"tag": "Panellets",
        "response": "Almond macaroons, often encrusted with pine nuts or other nuts, made in Catalonia for the feast of Epiphany"},
        {"tag": "Paner",
        "response": "to coat with bread crumbs"},
        {"tag": "Panera",
        "response": "Bread box"},
        {"tag": "Panforte",
        "response": "A rich dense torte made of candied fruit and nuts."},
        {"tag": "Panino",
        "response": "The Italian word for sandwich."},
        {"tag": "Panna cotta",
        "response": "A dessert made by dissolving unflavored gelatin in milk, then whisking the milk into sweetened heavy cream. Sometimes served with a caramel or strawberry topping."},
        {"tag": "Pannetone",
        "response": "An Italian cake made with a dough rich in egg yolks, traditionally served around Christmas time. The dough is studded with raisins, candied fruits, and occasionally pistachios."},
        {"tag": "Panzanella",
        "response": "A salad consisting of toasted cubes of bread tossed with vegetables and vinaigrette. The salad is then marinated for at least one hour. The bread should be very firm so that it will endure the soaking of dressing. Vegetables can include tomatoes, peppers, cucumbers, and onions. Lots of garlic, capers, black olives, and anchovies are added to the salad."},
        {"tag": "Papad",
        "response": "Thin, spicy, crisp wafer discs, about 4 to 8 inches in diameter, made from daal flour lentils, vegetables, potatoes, shrimp, and rice. The discs are deep-fried or dry roasted on an open flame and served as a crispy savory appetizer."},
        {"tag": "Papadam",
        "response": "Thin, spicy, crisp wafer discs, about 4 to 8 inches in diameter, made from daal flour lentils, vegetables, potatoes, shrimp, and rice. The discs are deep-fried or dry roasted on an open flame and served as a crispy savory appetizer."},
        {"tag": "Papas",
        "response": "Potatoes"},
        {"tag": "Papel De Cocina",
        "response": "Paper towel for the kitchen"},
        {"tag": "Papillote",
        "response": "a cooking method where a product is wrapped in a special paper or foil and baked so that the food cooks in its own juices."},
        {"tag": "Pappardelle",
        "response": "Wide flat pasta noodles served with rich, hearty sauces."},
        {"tag": "Paprika",
        "response": "Hungarian & Spanish red pepper"},
        {"tag": "Paratha",
        "response": "A whole-wheat unleavened flatbread. This bread, which resembles thick tortillas, may be deep-fried, shallow-fried, or baked in a tandoor. Slightly larger than chapatti, paratha is rolled, layered, folded, and basted with ghee during cooking. May be stuffed with meat and vegetables."},
        {"tag": "Parboil",
        "response": "to cook partially in a simmering or boiling liquid for a short period of time"},
        {"tag": "Parchment Paper",
        "response": "a special, non-stick, silicone coated, heat resistant paper used in cooking"},
        {"tag": "ParejAl",
        "response": "Parsley"},
        {"tag": "Parer",
        "response": "To trim meat"},
        {"tag": "Parfumer",
        "response": "a bouquet of aromatic herbs"},
        {"tag": "Pargo",
        "response": "Common sea bream"},
        {"tag": "Parmesan",
        "response": "A popular hard cheese that is usually grated over pasta dishes."},
        {"tag": "Pasa",
        "response": "Raisin"},
        {"tag": "Pasilla Chili Pepper",
        "response": "Called a chilaca in its fresh form. The mature chilaca turns from dark green to dark brown. After drying (when it becomes a pasilla) it changes to a blackish-brown. It has a rich hot flavor and is generally ground and used for sauces."},
        {"tag": "Passatelli",
        "response": "Homemade soup noodles made from eggs and bread crumbs."},
        {"tag": "Pasta",
        "response": "Pasta"},
        {"tag": "Pasta e Fagioli",
        "response": "A rich bean soup with pasta, in which a large sausage(such as cotechino) has been cooked. The soup is eaten first, followed by the sausage served with mustard and bread."},
        {"tag": "Pastel",
        "response": "Cake"},
        {"tag": "Pasteleria",
        "response": "Pastries"},
        {"tag": "Pastilla (Bistella)",
        "response": "A Moroccan pie made with chicken wrapped in phyllo dough. When finished cooking, the pastilla is dusted with sugar and cinnamon."},
        {"tag": "Pastina",
        "response": "Tiny pasta used in broths and soups."},
        {"tag": "Pastry Cream",
        "response": "A cooked custard thickened with flour. Some versions may use cornstarch or a mixture of the two starches."},
        {"tag": "Pata Negra",
        "response": "“Black hoof” The term refers to the fabled Iberian pig, and the hams produced from it. By association “pata egra” refers to anything of superlative quality"},
        {"tag": "Patata Frita",
        "response": "French fries"},
        {"tag": "Patatas",
        "response": "Potatoes"},
        {"tag": "Patatas Bravas",
        "response": "fried potato pieces with spicy sauce"},
        {"tag": "Patatas Fritas",
        "response": "French fries"},
        {"tag": "Pâté",
        "response": "A French term referring to pastes or pastry."},
        {"tag": "Pâté a Foncer",
        "response": "A shortcrust pastry dough made with butter and strengthened with water. Used as a lining for meat or fish pies."},
        {"tag": "Pâté Brisée",
        "response": "A short crust pastry dough made with butter and eggs."},
        {"tag": "Pâté Choux",
        "response": "A paste used to make cream puffs, eclairs, and other more elaborate pastries. It is made by adding flour to boiling water or milk, which has been enriched with butter. Eggs are then added into the paste to leaven it. Savory pastries such as gougere may also be made with this paste."},
        {"tag": "Pâté Feuilletae",
        "response": "A dough comprised of many alternating layers of butter and pastry. This is an extremely versatile dough though preparation of it is labor intensive and very difficult."},
        {"tag": "Pâté Sablée",
        "response": "Another type of sweet, short crust dough."},
        {"tag": "Pâté Sucrée",
        "response": "A sweet, short crust dough for tarts and tartlets."},
        {"tag": "Pato",
        "response": "Duck"},
        {"tag": "Paupiette",
        "response": "A thin slice of meat, like a scallopine, which is stuffed and rolled. These may also be made of fish or vegetables."},
        {"tag": "Pavo",
        "response": "Turkey"},
        {"tag": "Pay",
        "response": "Pie"},
        {"tag": "Paysanne",
        "response": "Triangular shaped slices of vegetables"},
        {"tag": "Peche",
        "response": "peach"},
        {"tag": "Pechuga De Pollo",
        "response": "Chicken breast"},
        {"tag": "Pecorino Romano",
        "response": "A popular Italian hard cheese that is similar to Parmesan Cheese, but saltier in flavor."},
        {"tag": "Pedazo Grande",
        "response": "Wedge"},
        {"tag": "Pedro Ximenez",
        "response": "A sweet sherry with a raisin like flavor, made from grapes of that name Used in cooking and as an after dinner aperatif."},
        {"tag": "Pelado",
        "response": "Peeled"},
        {"tag": "Pelar",
        "response": "Peel"},
        {"tag": "Pelar Papas",
        "response": "potato peeler"},
        {"tag": "Penne",
        "response": "Literally, “feathers” or “quills”; this pasta has a slanted, hollow, tubular form that is thinner than Rigatoni. Often used in dishes with chunky sauces."},
        {"tag": "Pepinillo",
        "response": "Pickle"},
        {"tag": "Pepino",
        "response": "Cucumber"},
        {"tag": "Pepitas De Pollo",
        "response": "Chicken nuggets"},
        {"tag": "Peppermint",
        "response": "A peppery, spicy, aromatic, refreshing mint used to flavor candies and baked foods."},
        {"tag": "Percebes",
        "response": "Goose barnacles scraped from the sheer granite cliffs of Galicia"},
        {"tag": "Perche",
        "response": "Perch"},
        {"tag": "Perdiz",
        "response": "Partridge"},
        {"tag": "Perejil",
        "response": "Parsley"},
        {"tag": "Perrunilla",
        "response": "Sugary biscuit, made with lard"},
        {"tag": "Persil",
        "response": "parsley"},
        {"tag": "Persillade",
        "response": "A mixture of chopped parsley and garlic, added to recipes at the end of cooking."},
        {"tag": "Pescado",
        "response": "fish"},
        {"tag": "Pesto",
        "response": "A sauce made of Basil, Garlic, Olive oil, Pignoli, and Parmesan cheese often served over pasta."},
        {"tag": "Pesto Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around pesto, turkey or chicken strips, and cream cheese strips."},
        {"tag": "Petits Fours",
        "response": "Small, fancy cookies or cakes, decorated and iced, served on elaborate buffets or at the end of a multi-course meal."},
        {"tag": "Pez Espada",
        "response": "Swordfish"},
        {"tag": "Philadelphia Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around thin-sliced smoked salmon, cucumber strips, and cream cheese strips."},
        {"tag": "Picada",
        "response": "Pounded mixture of herbs, spices, garlic, bread, biscuits, etc., characteristic of Catalan cooking"},
        {"tag": "Picante",
        "response": "Spicy, hot"},
        {"tag": "Picar",
        "response": "To chop"},
        {"tag": "Piccata",
        "response": "small veal cutlets"},
        {"tag": "Pickle",
        "response": "to preserve or flavor food in brine"},
        {"tag": "Pico",
        "response": "Small toasted bread sticks served with tapas"},
        {"tag": "Pico de Gallo",
        "response": "Literally meaning “rooster’s beak”, this is a very hot, raw salsa made of fresh chiles, onions, and tomatoes."},
        {"tag": "Piece montee",
        "response": "Centerpiece on a platter or buffet"},
        {"tag": "Piel",
        "response": "Skin"},
        {"tag": "Pignoli",
        "response": "These tiny cream colored pine nuts have a distinct tarry flavor and are the key component to the popular Italian Pesto Sauce."},
        {"tag": "Pilaf",
        "response": "a rice dish without meat"},
        {"tag": "Pimentón",
        "response": "Paprika"},
        {"tag": "Pimienta",
        "response": "Pepper"},
        {"tag": "Pimiento De Padron",
        "response": "Baby green pepper from Galicia, sauteed in extra virgin olive oil until blistered, and then sprikled with sea salt. Served as a tapa. Most of the identical little peppers are mild, but every fifth or sixth one is extremet hot! Some people call it Spanish roulette."},
        {"tag": "Pimiento De Piquillo",
        "response": "Small, red, peppers with a pointed end. The best come from Lodosa in Navarra. Eaten as tapas or stuffed with fish or meat"},
        {"tag": "Pimiento Rojo",
        "response": "Ped pepper"},
        {"tag": "Pimiento Verde",
        "response": "Green pepper"},
        {"tag": "Piña",
        "response": "Pineapple"},
        {"tag": "Pinch",
        "response": "a measurement of less than 1/16th of a teaspoon (same as “dash”)"},
        {"tag": "Piñones",
        "response": "pine nut"},
        {"tag": "Pintxo",
        "response": "The Basque word for tapas. The best come from towns along the coast stretching from Bilbao, Zarautz to San Sebastian"},
        {"tag": "Pipe",
        "response": "to squeeze a soft food item from a pastry bag to another food item, usually in a decorative manner"},
        {"tag": "Piperrada",
        "response": "Basque dish of peppers (capsicum), tomato, onion, etc."},
        {"tag": "Piroshki",
        "response": "Small Russian meat pies, like empanadas, eaten for lunch or snacks."},
        {"tag": "Pissaladiere",
        "response": "A southern French pizza consisting of a thick bread crust covered with cooked onions flavored with garlic. The pizza is then topped with black olives and anchovies."},
        {"tag": "Pisto",
        "response": "Originally from La Mancha, a more concentrated version of ratatouille made from fried peppers, onion, tomato, garlic, zucchini, eggplant."},
        {"tag": "Pit",
        "response": "to remove the center seed from fruits"},
        {"tag": "Pita Bread",
        "response": "Flat round bread made with or without a pocket."},
        {"tag": "Pizca",
        "response": "Pinch"},
        {"tag": "Plat",
        "response": "Plate or dish"},
        {"tag": "Plat du Jour",
        "response": "dish of the day"},
        {"tag": "Plátano",
        "response": "Banana"},
        {"tag": "Plato",
        "response": "Plate, dish, course"},
        {"tag": "Plato Principal",
        "response": "Main course"},
        {"tag": "Plongeur",
        "response": "Pot washer"},
        {"tag": "Plum Sauce",
        "response": "A thick, rich, sour fruit dipping sauce used to complement stir fried pork and deep fried appetizers."},
        {"tag": "Poach",
        "response": "To cook very slowly in simmering liquid."},
        {"tag": "Poblano Chili Pepper",
        "response": "A dark, sometimes almost black green chili pepper with a mild flavor. Best known for its use in “Chili Rellenos”, a Mexican stuffed pepper."},
        {"tag": "Pochar",
        "response": "To fry until soft"},
        {"tag": "Poire",
        "response": "Pear"},
        {"tag": "Poisson",
        "response": "fish"},
        {"tag": "Poivre",
        "response": "Pepper"},
        {"tag": "Polenta",
        "response": "A cornmeal dish that is generally enriched with eggs, butter, cream, or cheese."},
        {"tag": "Pollo",
        "response": "Chicken"},
        {"tag": "Pomme",
        "response": "Apple"},
        {"tag": "Pomme de terre",
        "response": "Potato"},
        {"tag": "Poner",
        "response": "Arrange"},
        {"tag": "Poner Trocitos Encima",
        "response": "dot with (butter)"},
        {"tag": "Ponzu",
        "response": "Sauce made with Japanese citron."},
        {"tag": "Porc",
        "response": "pork"},
        {"tag": "Posole",
        "response": "A Mexican soup containing hominy served with various ingredients to be added by each diner. The base of the soup is water flavored with onions, tomatoes(or tomatillos), and herbs. Hominy is cooked into this broth and condiments include minced onion, avocado, lime wedges, oregano, queso fresco, and fried pork skin. A similar soup to this is menudo. Without the pork skin, this makes a perfect vegetarian soup."},
        {"tag": "Postre",
        "response": "Dessert"},
        {"tag": "Pot-au-feu",
        "response": "Rich soup with bountiful meats and vegetables"},
        {"tag": "Potage",
        "response": "Soup"},
        {"tag": "Potaje",
        "response": "Leek and potato soup, or a similar stew"},
        {"tag": "Potiron",
        "response": "pumpkin"},
        {"tag": "Poule",
        "response": "Hen"},
        {"tag": "Poussin",
        "response": "Young chicken"},
        {"tag": "Praline",
        "response": "In French cookery this is a powder or paste made of caramelized almonds and/or hazelnuts. American cookery refers to a candy consisting of caramel and pecans."},
        {"tag": "Precook",
        "response": "to partially cook food before final cooking process"},
        {"tag": "Preheat",
        "response": "to heat an oven (or sometimes a pan) to a recommended temperature before cooking in it"},
        {"tag": "Pressure Cooking",
        "response": "using steam under a locked lid to produce high temperatures to accomplish a fast cooking time"},
        {"tag": "Primavera",
        "response": "A pasta sauce made with vegetables, such as carrots, celery, and bell peppers."},
        {"tag": "Pringa",
        "response": "Cabbage, bean, and meat stew typical of Western Asturias"},
        {"tag": "Profiterole",
        "response": "A small puff made with pate choux usually filled an served as an appetizer."},
        {"tag": "Profiteroles",
        "response": "Small balls made out of choux"},
        {"tag": "Proof",
        "response": "a cooking term used for the growth of yeast dough’s rise"},
        {"tag": "Prosciutto",
        "response": "Salted, air cured ham served in thin slices."},
        {"tag": "Provolone",
        "response": "An Italian curd cheese often used in Cannelloni and Ravioli."},
        {"tag": "Prune",
        "response": "plum"},
        {"tag": "Puchero",
        "response": "Formerly a trial sample of sausage mixture fried up for Text_Dicting at the matanza, now has become a dish in its own right"},
        {"tag": "Puerco",
        "response": "Pork"},
        {"tag": "Puerros",
        "response": "Terra cotta cooking pots, also Andalusian one-pot stew, similar to cocido"},
        {"tag": "Pugliese",
        "response": "Soft and chewy olive oil bread with a thin crust. Although this bread is best eaten warm on the day of baking, it makes fine Crostini, (Italian open sandwiches made on thin slices of toast) the next day."},
        {"tag": "Pulao",
        "response": "Delicately flavored rice, sauteed in ghee and flavored with cumin and cloves."},
        {"tag": "Pulpo A Feria",
        "response": "Gallego term referring to places serving octopus (pulperia in Castilian)"},
        {"tag": "Pulse",
        "response": "A classification of legumes, including beans, chickpeas, and lentils, among others."},
        {"tag": "Pumate",
        "response": "Italian for sun-dried tomatoes."},
        {"tag": "Puñado",
        "response": "Gallego specialty, boiled and sliced octopus with cooked potato, olive oil, pimenton, and sea salt, served on a wooden plate"},
        {"tag": "Punto De Bullición",
        "response": "Handful"},
        {"tag": "Punto De Fusión",
        "response": "Boiling point"},
        {"tag": "Purée",
        "response": "The action of mashing a food until it has a thick, smooth consistency; usually done by a blender or food processor. Alternatively, the food can be pushed through a colander."},
        {"tag": "Puri",
        "response": "An unleavened whole-wheat flatbread usually around 4 inches in diameter. This “puffed” bread, which is rolled out and deep-fried, expands when cooked."},
        {"tag": "Puttanesca",
        "response": "A piquant pasta sauce made of tomatoes, onions, black olives, capers, anchovies, and chile flakes. The hot pasta is tossed in this sauce prior to serving. Some recipes leave the ingredients raw, allowing the heat of the pasta to bring out the flavors."},
        {"tag": "Pyramide Cheese",
        "response": "A truncated pyramid is the shape of this small French chevre that is often coated with dark gray edible ash. The texture can range from soft to slightly crumbly and depending upon it’s age, in flavor from mild to sharp. It is wonderful served with crackers or bread and fruit."},
        {"tag": "Quahog",
        "response": "The American Indian name for the East Coast hard shell clam. It is also used to describe the largest of these hard shell clams. Other names used are, chowder or large clam."},
        {"tag": "Quartier",
        "response": "to quarter"},
        {"tag": "Quatre-epices",
        "response": "A French spice mixture containing ground cinnamon, nutmeg, cloves, and pepper. This mixture is used to season stews and pâtes."},
        {"tag": "Quenelle",
        "response": "A dumpling made from fish or meat forcemeat."},
        {"tag": "Quenelles",
        "response": "dumplings made of different meats"},
        {"tag": "Quesadilla",
        "response": "Originally a corn masa empanada filled with meat then deep fried. Modern versions found throughout restaurants in the US are made with flour tortillas that are filled with cheese and folded over when cooked."},
        {"tag": "Queso",
        "response": "Cheese"},
        {"tag": "Queso Manchego",
        "response": "Authentic Manchego cheese is made only from the whole milk of Manchega sheep reared in the La Mancha region. This semifirm cheese has a rich yet mellow flavor, and is used universally with ham, membrillo, sherry, almonds, olives."},
        {"tag": "Quiche",
        "response": "An open top pie made of eggs, milk or cream, and anything else within reach. The most famous of these is the quiche Lorraine, made with bacon and Gruyere cheese."},
        {"tag": "Quince",
        "response": "This yellow-skinned fruit looks and tastes like a cross between an apple and a pear. Its texture and flavor make it better cooked than raw. Its high pectin content make it ideal for use in jams, jellies, and preserves."},
        {"tag": "Quinoa",
        "response": "Pronounced (KEEN-wah). A natural whole grain grown in South America. Originally used by the Incas, it can be substituted for rice in most recipes. It is a unique grain in that it serves as a complete protein containing essential amino acids."},
        {"tag": "Raan",
        "response": "A leg of lamb marinated in yogurt-based masala."},
        {"tag": "Rábano",
        "response": "Radish"},
        {"tag": "Rabo De Buey",
        "response": "Oxtail"},
        {"tag": "Radicchio",
        "response": "A member of the chicory family with red and white leaves. The different varieties range from mild to extremely bitter. The round Verona variety are the most common in the US. Radicchio is used most often in salads, but is quite suitable to cooked preparations."},
        {"tag": "Radis",
        "response": "Radish"},
        {"tag": "Rafano",
        "response": "Horseradish"},
        {"tag": "Ragout",
        "response": "A French term for stew made of meat, fish, or vegetables."},
        {"tag": "Ragu",
        "response": "Meat sauce for pasta; sometimes refers to other hearty sauces."},
        {"tag": "Railfort",
        "response": "Horseradish"},
        {"tag": "Rainbow Roll",
        "response": "A Maki roll, typically consisting of Nori seaweed and rice, wrapped around seafood with diagonal strips of fish across the top."},
        {"tag": "Raita",
        "response": "A cooling vegetable and yogurt salad served as an accompaniment to hot and spicy dishes."},
        {"tag": "Rallado",
        "response": "Shredded"},
        {"tag": "Ramekin",
        "response": "a very small dish used for individual portions"},
        {"tag": "Ramen Noodles",
        "response": "An Asian, off-white, wheat-based noodle that can be boiled and seasoned, then added to soups, salads, meat, vegetables, and side dishes."},
        {"tag": "Ramequin",
        "response": "A dish in which food is cooked and served"},
        {"tag": "Ramita",
        "response": "grated"},
        {"tag": "Rape",
        "response": "Monkfish"},
        {"tag": "Rapini",
        "response": "Vegetable of the turnip family whose stems, tender leaves, and buds are usually boiled to decrease their bitterness, then sauteed. Referred to as broccoli raab in the United States."},
        {"tag": "Ras el Hanout",
        "response": "This is a powdered spice mixture, used in Arabic and north African cooking, with a sweet and pungent flavor. See the definition under charmoula for a description of the ingredients and its applications."},
        {"tag": "Rasgulla",
        "response": "One of the most famous Indian sweets that originated from east India, they consist of paneer flavored with cardamom, and served chilled."},
        {"tag": "Ratatouille",
        "response": "A vegetable stew consisting of onions, eggplant, sweet peppers, zucchini, and tomatoes flavored with garlic, herbs, and olive oil. Traditionally simmered until all of the vegetables are quite soft and the flavor has blended into one, ratatouille takes on the appearance of marmalade. Newer versions reduce the cooking time, allowing the vegetables to retain some of their original identity."},
        {"tag": "Ratio De Toro",
        "response": "bull’s tail"},
        {"tag": "Ravioli",
        "response": "An Italian pasta filled with meat or cheeses"},
        {"tag": "Rebozar",
        "response": "To coat ingredients such as meat, fish, vegetables in flour, egg, and breadcrumbs before frying"},
        {"tag": "Receta",
        "response": "Recipe"},
        {"tag": "Reconstitute",
        "response": "a dried food product is returned to its original form by adding a liquid, hot or cold"},
        {"tag": "Red Dates",
        "response": "Dried fruit of the Chinese jujube tree that have a bright red crinkly skin."},
        {"tag": "Reduce",
        "response": "to cook by simmering or boiling until its volume is decreased in order to concentrate flavors"},
        {"tag": "Reducir",
        "response": "Reduce"},
        {"tag": "Reduction",
        "response": "The result of reducing by boiling down sauces to increase consistency, richness and flavor"},
        {"tag": "Refrescos",
        "response": "Soft Drinks"},
        {"tag": "Refresh",
        "response": "to stop the cooking process by submerging in or spraying with cold water; common with vegetables and pasta"},
        {"tag": "Reginelle",
        "response": "Pasta strips with curly edges."},
        {"tag": "Rehogar",
        "response": "Previously cooked vegetables in olive oil sauteed"},
        {"tag": "Rellenar",
        "response": "To sauce, toss in oil"},
        {"tag": "Relleno",
        "response": "Stuffed, filled"},
        {"tag": "Remoulade",
        "response": "This classic French sauce is made by combining mayonnaise (usually homemade) with mustard, capers and chopped gherkins, herbs and anchovies. It is served chilled as an accompaniment to cold meat, fish and shellfish."},
        {"tag": "Rennet",
        "response": "An extract from the stomach of lambs and calves used in cheese making to coagulate milk. There are also rennets obtained from vegetables such as cardoons."},
        {"tag": "Repollo",
        "response": "Cabbage"},
        {"tag": "Requeson",
        "response": "A fresh cheese that is similar to ricotta or cottage cheese."},
        {"tag": "Restaurante",
        "response": "restaurant"},
        {"tag": "Revuelto",
        "response": "Scrambled eggs"},
        {"tag": "Ribeiro",
        "response": "White wine from Galicia"},
        {"tag": "Ricciarelli",
        "response": "Almond cookies that are typically covered with a layer of powdered sugar."},
        {"tag": "Rice Paper",
        "response": "A thin, crispy wrap made from rice flour and water used to wrap spring rolls. These wraps, available in either round or triangular form, can be used as a vegetarian substitute for egg roll skins since it does not contain eggs."},
        {"tag": "Rice Vermicelli",
        "response": "Thin, translucent, rice-flour noodles used to garnish stir fried dishes and soups."},
        {"tag": "Rice Vinegar",
        "response": "Aromatic, light, and delicately flavored vinegar distilled from white rice."},
        {"tag": "Rice Wine",
        "response": "A dry, strong, flavorful, clear Chinese cooking wine made from fermented rice. This sherry flavored wine is used in Chinese stir fried and steamed dishes."},
        {"tag": "Rice-flour Noodles",
        "response": "These noodles, made with rich flour and water, range from thin Rice Vermicelli to the thick broad flat noodles. A traditional ingredient in chicken salads, soups, and stir-fries."},
        {"tag": "Ricotta",
        "response": "Fresh, smooth, soft, and slightly salty Italian cheese that is similar in texture to cottage cheese. Used in a variety of dishes, including lasagnas and pizzas."},
        {"tag": "Ricotta salata",
        "response": "Ricotta cheese that has been drained, cured in brine, and aged for a few days and then grated like Pecorino Romano."},
        {"tag": "Rigatoni",
        "response": "Large, hollow, ridged pasta tubes commonly used with chunky sauces. Interchangeable with Ziti."},
        {"tag": "Rijsttafel",
        "response": "A Dutch word, meaning “rice table”. It is a Dutch version of an Indonesian meal consisting of hot rice accompanied by several (sometimes 20 or 40) small, well-seasoned side dishes of seafoods, meats, vegetables, fruits, sauces, condiments, etc."},
        {"tag": "Rillette",
        "response": "A coarse, highly spiced spread made of meat or poultry and always served cold. This is called potted meat because rillettes are often covered with a layer of lard and stored for a period of time to age the mixture."},
        {"tag": "Riñon",
        "response": "kidney"},
        {"tag": "Ris de Veau",
        "response": "sweetbreads"},
        {"tag": "Risaia",
        "response": "Rice paddy"},
        {"tag": "Risotto",
        "response": "A traditional Italian dish made with Arborio rice, saffron, broth, onions, and garlic. Meat, vegetables, cheese, and seasonings are often added. The best known version of this dish is risotto ala Milanese, with saffron and Reggiano parmesan cheese."},
        {"tag": "Rissole",
        "response": "Small pies similar to empanadas and piroshki. They are filled with meat, vegetables, or cheese and deep fried."},
        {"tag": "Roast",
        "response": "to cook foods by surrounding them with hot, dry air in an oven (uncovered) or on a spit over an open fire"},
        {"tag": "Robiola",
        "response": "Mild and buttery cheese used in various pastas, appetizers, and salads."},
        {"tag": "Rociando",
        "response": "Basting"},
        {"tag": "Rock Sugar",
        "response": "Crystallized raw sugar that is less sweet than refined sugar."},
        {"tag": "Roe",
        "response": "The generic Japanese term that refers to fish eggs, flying fish, smelt, salmon, and other Sushi."},
        {"tag": "Rogan Josh",
        "response": "Rich lamb curry"},
        {"tag": "Rolling Boil",
        "response": "boiling water at very high heat so that even if stirred the water continues to boil (bubble)"},
        {"tag": "Rollito",
        "response": "To smooth out pastry dough to an even thickness with a rolling pin. Always roll in one direction, not backward and forward, turning the dough frequently."},
        {"tag": "Romaine",
        "response": "Cos lettuce"},
        {"tag": "Romana",
        "response": "Rome-style; a term whose definition varies with each dish"},
        {"tag": "Romanello",
        "response": "Hard, grated skim-milk cheese"},
        {"tag": "Romero",
        "response": "Rosemary"},
        {"tag": "Romesco",
        "response": "A sauce made of pounded almonds, hazelnuts, garlic, tomato, olive oil typical of Tarragona"},
        {"tag": "Ron",
        "response": "Rum"},
        {"tag": "Rondelle",
        "response": "Round or bias-rond cuts, varied diameter or thickness."},
        {"tag": "Roquefort",
        "response": "A blue semi-soft French cheese"},
        {"tag": "Rosemary",
        "response": "A fresh, bittersweet herb that resembles short pine needles."},
        {"tag": "Rosolio",
        "response": "A delicate, sweet, and unique liqueur made by macerating rose petals in an alcoholic infusion. Served with dessert."},
        {"tag": "Rosquilla",
        "response": "Doughnut"},
        {"tag": "Rosti",
        "response": "A Swiss potato pancake made from cooked potatoes, sometimes flavored with bacon."},
        {"tag": "Rosumada",
        "response": "Milanese eggnog that is traditionally prepared with red wine. Water or milk is sometimes substituted."},
        {"tag": "Rotelle",
        "response": "Wheel-shaped, cork-screwed pasta that most sauces cling to easily"},
        {"tag": "Roti",
        "response": "The Hindi term for bread. “Tandoori Roti” is baked in a tandoor; “Rumali Roti” is very thin and large, usually cooked on a griddle."},
        {"tag": "Rotini",
        "response": "Wheel-shaped, cork-screwed pasta that most sauces cling to easily"},
        {"tag": "Rotir",
        "response": "to roast"},
        {"tag": "Rotisseur",
        "response": "Roast cooking method"},
        {"tag": "Rouget",
        "response": "red mullet"},
        {"tag": "Rouille",
        "response": "A thick sauce similar to aioli, made of dried chiles, garlic, and olive oil. Rouille is traditionally served with bouillabaisse and soup de poisson. Other recipes also add saffron and tomatoes."},
        {"tag": "Roux",
        "response": "A mixture of flour and fat used to thicken sauces, soups, and stews. Though usually made with butter, rouxs are also made with bacon or poultry fats, margarine, and vegetable oil. The mixture is cooked for a brief time to remove the raw taste of the starch from the flour. Longer cooking results in a darker color, which is favorable in Creole cooking where rouxs are cooked for long periods until they reach a dark brown color."},
        {"tag": "Royale",
        "response": "Type of custard cut into different shapes, used to garnish consomme"},
        {"tag": "Russe",
        "response": "Stew pan"},
        {"tag": "Saag",
        "response": "An aromatic curried dish made from greens"},
        {"tag": "Saba",
        "response": "Lightly salted and marinated mackerel"},
        {"tag": "Sabayon",
        "response": "An Italian custard made with egg yolks and wine or juices, which are beaten vigorously over hot water to form a rich, creamy dessert. The custard can then be poured into glasses and chilled to be eaten later, or eaten warm with fresh fruit. Marsala is the most common wine used, though any sweet wine such as Madeira, Champagne, or Sauterne may be used. Also called zabaglione."},
        {"tag": "Sabji",
        "response": "A general Indian term to describe vegetables.See also sabzi."},
        {"tag": "Sable",
        "response": "A rich short cookies similar to shortbread."},
        {"tag": "Sabzi",
        "response": "A general Indian term to describe vegetables. The same as sabji, but from northern India."},
        {"tag": "Sachet",
        "response": "a small bag usually made of cheesecloth containing herbs and spices and is placed into soups, stews, stocks and sauces while cooking for added flavor and is removed when the item is finished cooking"},
        {"tag": "Saffron",
        "response": "A sharp, orange-red color spice made from the dry stigmata of the flower of the crocus plant. A common ingredient in Risottos."},
        {"tag": "Sagne",
        "response": "Nickname for Lasagna"},
        {"tag": "Saisir",
        "response": "to sear meat surfaces in hot fat"},
        {"tag": "Sake",
        "response": "A Japanese wine, sauce, or marinade, made from fermented rice."},
        {"tag": "Sal",
        "response": "Salt"},
        {"tag": "Salamandre",
        "response": "Salamander- Broiler; top fired grill"},
        {"tag": "Salchicha",
        "response": "Sausage"},
        {"tag": "Salchichon",
        "response": "Applied to any food preserved in salt, en salazon."},
        {"tag": "Salmon Teriyaki",
        "response": "Broiled salmon with teriyaki sauce"},
        {"tag": "Salmorejo",
        "response": "Gazpacho thickened with bread."},
        {"tag": "Salpicon",
        "response": "a mixture of finely diced meat of ham and mushrooms in sauce"},
        {"tag": "Salsa",
        "response": "A sauce mixed with tomatoes, onions, chili, and cilantro. Traditionally served as a side dip to most Mexican dishes."},
        {"tag": "Salsa Verde",
        "response": "Green sauce."},
        {"tag": "Salt Cod",
        "response": "Cod that has been salted and dried to preserve it for long periods of time. Salt cod is evident in cuisines of the Mediterranean and Caribbean Seas. To reconstitute the fish, you must soak it in many changes of fresh water to remove the excess salt. You may then poach the fish until it is just flaking off the bone, or use it raw for other preparations."},
        {"tag": "Salteado",
        "response": "to sauté."},
        {"tag": "Saltimbocca",
        "response": "An Italian dish comprised of thin slices of veal, rolled around ham and cheese, seasoned with sage and braised until tender."},
        {"tag": "Saltpeter",
        "response": "The name for potassium nitrate, which is used primarily in the meat industry to help preserve cured meats. It gives a distinctive pink color to hams and bacon. There are recent reports from the USDA that nitrates, and nitrites are carcinogenic."},
        {"tag": "Sambhar",
        "response": "Lentil curry served as a complement to idli."},
        {"tag": "Sambuca",
        "response": "An Anise flavored liqueur served as an after dinner drink to help digestion."},
        {"tag": "Samfaina",
        "response": "Sauted"},
        {"tag": "Samosa",
        "response": "Crispy, deep-fried triangular pastries filled with spiced potatoes, vegetables, or meat. Served as an appetizer."},
        {"tag": "Sandía",
        "response": "Watermelon"},
        {"tag": "Sangria",
        "response": "Spanish drink made from sweet red wine, pieces of fresh fruit (usually orange and lemon), spices (cinnamon,cloves)"},
        {"tag": "Sansho",
        "response": "Japanese pepper made from the leaf of the prickly ash."},
        {"tag": "Sashimi",
        "response": "Assorted slices of fresh raw fish traditionally served with pickled ginger, soy sauce, and Wasabi. Unlike sushi, it is usually prepared without rice."},
        {"tag": "Sashlik",
        "response": "An Indian cooking term meaning “grilled”."},
        {"tag": "Satay",
        "response": "Also spelled sat‚ and sateh. These are pieces of meat or fish threaded onto skewers and grilled over a flame. Several variations of these are seen throughout Southeast Asia. A spicy peanut sauce is served with meat satay in Vietnam and Thailand."},
        {"tag": "Sauce",
        "response": "a liquid that adds flavor and moisture to foods"},
        {"tag": "Sauge",
        "response": "sage"},
        {"tag": "Saumon",
        "response": "Salmon"},
        {"tag": "Saute",
        "response": "A French word that describes a method for cooking foods in a shallow pan using high heat. The food is cooked in an uncovered pan and a small quantity of butter or oil. Unlike stir-frying where the food is continuously turned, sauteed food is turned only once in the pan in order to cook both sides. If the food, such as a thin cut of meat, is turned more than once, the cooking method is considered stir-frying or pan-frying rather than sauteing."},
        {"tag": "Sauteuse",
        "response": "Shallow pan with sloping sides (often confused with a saute pan)"},
        {"tag": "Sautoir",
        "response": "Round shallow heavy pan with straight walls & long handle"},
        {"tag": "Savarin",
        "response": "A ring-shaped cake made of a rich yeast dough, soaked with a rum syrup, and filled with pastry or whipped cream."},
        {"tag": "Sawara",
        "response": "Spanish mackerel"},
        {"tag": "Sazonar",
        "response": "To season."},
        {"tag": "Scald",
        "response": "to heat a liquid just below boiling with bubbles around the edges"},
        {"tag": "Scallion",
        "response": "very young onions picked when beds of onions need to be thinned. Both the shallot and the green onion, which have small bulbs, are also known as scallions"},
        {"tag": "Scallop",
        "response": "to bake food with a sauce or other liquid in a casserole"},
        {"tag": "Scampi",
        "response": "Another word for langoustine. This word is used in the US as a description of shrimp broiled with butter, lemon, and garlic."},
        {"tag": "Scone",
        "response": "A small, lightly sweetened pastry similar to American biscuits, often flavored with currants."},
        {"tag": "Score",
        "response": "tenderizing meats or seafood by slicing with a knife"},
        {"tag": "Sea Urchin",
        "response": "A round spiny creature found off the coasts of Europe and America. The only edible portion is the coral, usually eaten raw with fresh lemon juice."},
        {"tag": "Seafood Sunomono",
        "response": "Assorted seafood and cucumber with vinegar sauce."},
        {"tag": "Seafood Tempura",
        "response": "Assorted seafood and vegetables lightly deep-fried in batter."},
        {"tag": "Seafood Teriyaki",
        "response": "Broiled shrimp, fish, and scallops with vegetables and teriyaki sauce."},
        {"tag": "Sear",
        "response": "to seal in the juices of meat by quickly browning it on all sides in a very hot pan"},
        {"tag": "Season",
        "response": "enhancing the flavor of food by adding ingredients such as herbs and spices; cooking term also means to oil a pan and slowly warm it and then wipe it"},
        {"tag": "Seaweed Salad",
        "response": "Fresh green seaweed salad"},
        {"tag": "Seekh Kabab",
        "response": "Literally, “skewer kababs”; these kababs, served on skewers, are usually made from ground lamb, mixed with various spices, and cooked in a tandoor."},
        {"tag": "Seigo",
        "response": "Young sea bass"},
        {"tag": "Selle",
        "response": "Saddle of lamb"},
        {"tag": "Semifreddo",
        "response": "Meaning “half cold”, this is gelato with whipped cream folded into it."},
        {"tag": "Semolina",
        "response": "Coarse, pale flour traditionally used in pasta and pizza dough. This flour is high in fiber and protein, and gives pasta and pizza its chewy characteristic."},
        {"tag": "Senbei",
        "response": "Thin, crisp, rice crackers flavored with soy sauce or other seasonings."},
        {"tag": "Serrano",
        "response": "“Of the mountain,” e.g. Jamon Serrano"},
        {"tag": "Sesame Seeds",
        "response": "Tiny, nutty-flavored oval seeds used to flavor meat, poultry, stir-fries and popular desserts."},
        {"tag": "Set",
        "response": "to allow food to solidify"},
        {"tag": "Set Meal Service",
        "response": "All customers eat at one time. Often called quantity cooking b/c large batches are prepared in advance. Ie: school cafeterias, banquets, employee dining rooms."},
        {"tag": "Setas",
        "response": "Wild mushrooms."},
        {"tag": "Sev",
        "response": "A thin stringy fried snack made from gram flour."},
        {"tag": "Seviche",
        "response": "A Spanish dish of raw fish, scallops, or shrimp marinated in citrus juices until the flesh becomes “cooked”. Onions, peppers, and chiles are then added to finish the dish."},
        {"tag": "Shako",
        "response": "Mantis shrimp"},
        {"tag": "Shaoxing",
        "response": "A dry, strong, flavorful, clear Chinese cooking wine made from fermented rice. This sherry flavored wine is used in Chinese stir fried and steamed dishes."},
        {"tag": "Shari",
        "response": "A Sushi bar term for Sushi rice"},
        {"tag": "Shichimi Togarashi",
        "response": "Mixed hot spices for table use. The flavors consist of red pepper (Togarashi), ground sansho pepper pods, dried mandarin orange peel, black hemp seeds or white poppy seeds, Nori seaweed bits, and white sesame seeds."},
        {"tag": "Shiitake Mushroom",
        "response": "A flavorful, fleshy Chinese black mushroom widely used in the Chinese cuisine."},
        {"tag": "Shima Aji",
        "response": "Striped jack fish. Common in sushi and sashimi."},
        {"tag": "Shime Saba",
        "response": "Marinated mackerel"},
        {"tag": "Shiratake",
        "response": "Translucent rubbery noodles"},
        {"tag": "Shirley Temple",
        "response": "A popular children’s non-alcoholic cocktail made with ginger ale, colored with grenadine syrup, and garnished with a maraschino cherry."},
        {"tag": "Shiro Goma",
        "response": "White sesame seeds"},
        {"tag": "Shiro Maguro",
        "response": "Albacore tuna; white tuna."},
        {"tag": "Shiro miso",
        "response": "White soy bean paste"},
        {"tag": "Shiromi",
        "response": "Seasonal “white meat” fish served as Sushi/sashimi which is relatively white in color, for example, Hirame and Karei."},
        {"tag": "Shirumono",
        "response": "Generic Japanese term for soup."},
        {"tag": "Shiso",
        "response": "Japanese mint; the leaf of the Perilla plant. Used frequently in Maki Sushi and Sashimi."},
        {"tag": "Shochu",
        "response": "A distilled, clear alcoholic beverage made from a variety of different ingredients, including potatoes, rice, barley, buckwheat, and/or sugar."},
        {"tag": "Shoga",
        "response": "Ginger root"},
        {"tag": "Shortbread",
        "response": "A butter-rich cookie from Scotland, often seasoned with lemon, cinnamon, ginger, almonds, and cumin."},
        {"tag": "Shoyu",
        "response": "Japanese for Soy Sauce."},
        {"tag": "Shred",
        "response": "to tear or cut food into narrow strips"},
        {"tag": "Shrimp Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around shrimp and cream cheese strips."},
        {"tag": "Shrimp Tempura",
        "response": "Shrimp and vegetables lightly fried and served with dipping sauce."},
        {"tag": "Shrimp Teriyaki",
        "response": "Broiled shrimp with teriyaki sauce."},
        {"tag": "Shuck",
        "response": "to remove the shells from clams and oysters; also to remove the husks from corn"},
        {"tag": "Siago",
        "response": "An Italian cheese from the Veneto region. After it has aged, it has a piquant, salty flavor and is usually used for grating and cooking."},
        {"tag": "Sichuan Cuisine",
        "response": "One of the most famous Chinese cuisines in the world. Characterized by its spicy and pungent flavors, the Sichuan cuisine emphasizes the use of chili. Pepper, garlic, ginger, fermented soybean, and prickly ash produce this cuisine’s exciting tastes. Frying, frying without oil, pickling, and braising are used as basic cooking techniques."},
        {"tag": "Sichuan Pepper",
        "response": "Hot, peppery dried red berries that are roasted and ground to produce a pungent and aromatic seasoning. Sichuan pepper is one of the spices of Chinese five-spice powder."},
        {"tag": "Sidra",
        "response": "A hard, very dry cider that is the typical drink of Asturias in northern Spain, often replacing wine as a lunch or dinner accompaniment. It is also used to make sauces for meat and fish. As a substitute for cooking in the USA use only hard cider available in liquor stores. It is a bit sweeter than the Asturian cider but works very well in cooking. In addition, sidra describes a sparkling cider imported from Spain is often found in Spanish markets. This product is quite sweet and meant to be used like champagne, not as a cooking liquid."},
        {"tag": "Sieve",
        "response": "to press a food through a strainer to break it up"},
        {"tag": "Sift",
        "response": "to remove lumps from certain foods while aerating it"},
        {"tag": "Simmer",
        "response": "To cook food gently in liquid that bubbles steadily, just below boiling point, so that the food cooks in even heat without breaking up."},
        {"tag": "Simple Syrup",
        "response": "two parts water and one part sugar cooked together"},
        {"tag": "Skate Wings",
        "response": "This is the edible portion of the skate. The flesh, when cooked, separates into little fingers of meat and has a distinctive rich, gelatinous texture. The taste is similar to that of scallops."},
        {"tag": "Skim",
        "response": "removing fat or impurities that have risen to the top of a liquid being cooked"},
        {"tag": "Slivered",
        "response": "thin slices about 1/4 inch by 1/8 inch"},
        {"tag": "Small Dice",
        "response": "1/4 in x 1/4 in x 1/4 in cube."},
        {"tag": "Smoked Salmon Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around smoked salmon, cream cheese strips, and cucumber strips."},
        {"tag": "Smoking Point",
        "response": "the temperature at which fat breaks down and starts smoking"},
        {"tag": "Smorgasbord",
        "response": "A Swedish buffet of many dishes served as hors d oeuvres or a full meal. Similar buffets are served throughout Scandinavia, as well as the Soviet Union. Common elements of a smorgasbord are pickled herring, marinated vegetables, smoked and cured salmon and sturgeon, and a selection of canapés."},
        {"tag": "Smothering",
        "response": "Smothering a dish consists of slowly simmering it in a covered pan with a small amount of liquid."},
        {"tag": "Soba",
        "response": "Japanese buckwheat noodles served in a soy-flavored broth made from fish and seaweed stock."},
        {"tag": "Soba Noodle",
        "response": "Buckwheat noodles resembling spaghetti, used in Japanese cooking."},
        {"tag": "Sobrassada",
        "response": "Pork sausage from the Balearic Islands, of a spreading consistency, cured with large amounts of pimenton"},
        {"tag": "Socarrat",
        "response": "Highly valued by connoisseurs of paella, the rice at the center of the pan’s base, which becomes caramelized or lightly burned during cooking"},
        {"tag": "Soft Shell Crab",
        "response": "Fried, marinated soft shell crab served with dipping sauce."},
        {"tag": "Soft Taco",
        "response": "A warm soft flour tortilla filled with seasoned beef, shredded lettuce and grated cheese. Commonly topped with salsa, sour cream, or guacamole."},
        {"tag": "Solomillo",
        "response": "Sirloin, fillet."},
        {"tag": "Somen",
        "response": "White, threadlike wheat noodles."},
        {"tag": "Sopa",
        "response": "Soup."},
        {"tag": "Sorbet",
        "response": "a water ice served between meals to stimulate appetite"},
        {"tag": "Sorrel",
        "response": "Low perennial herb with acid leaves. It is used to flavor sauces."},
        {"tag": "Sous Chef",
        "response": "Assistant to Executive"},
        {"tag": "Soy Sauce",
        "response": "A highly flavored, salty, tangy, brown liquid brewed from fermented soybeans and salt. Darker, stronger sauces are used for cooking while lighter ones are used as sauces and seasonings. Chinese dishes are traditionally called red-cooked when soy sauce is used or white-cooked when soy sauce is omitted. Japanese soy sauce is called shoyu."},
        {"tag": "Soya Bean Paste",
        "response": "A hot aromatic sauce made from seasoned ground Soya beans, chilies, peppers, sugar, and salt."},
        {"tag": "Spaghetti",
        "response": "Resembling “little strings”, spaghetti is made from durum wheat and remains one of the most popular types of pasta today."},
        {"tag": "Spatzle",
        "response": "This is a coarse noodle from Alsace and Germany made of flour, eggs, oil, and water. The soft dough is dropped into boiling water(with a spatzle press) and poached until cooked through. The noodle is then fried in butter or oil and served as a side dish to meat dishes. Spatzle may also be flavored with cheese, mushrooms, and herbs."},
        {"tag": "Speck",
        "response": "Cured and smoked pork flank."},
        {"tag": "Spiedini",
        "response": "An Italian word for skewers of meat or fish grilled over a flame or under a broiler."},
        {"tag": "Spring Roll",
        "response": "Thin sheets of dough which are filled with meat, seafood, or vegetables and rolled into logs. Spring rolls are most often deep fried, though they may also be steamed. Chinese versions use wheat doughs, while the Vietnamese and Thai versions use a rice paper wrapper."},
        {"tag": "Spumoni",
        "response": "Three flavors of ice cream, with a fruit and/or nut layer between each flavor. The flavors are cherry, pistachio, and either chocolate or vanilla."},
        {"tag": "Steam",
        "response": "to cook by direct contact with steam"},
        {"tag": "Steel",
        "response": "a dowel-shaped tool used to sharpen knives"},
        {"tag": "Steep",
        "response": "to soak dry ingredients in water or another liquid until the flavor is infused into the liquid"},
        {"tag": "Stew",
        "response": "to gradually cook ingredients in a covered pot for a long time (until tender)"},
        {"tag": "Stir Fry",
        "response": "fast frying in a small amount of oil over very high heat while continuously stirring ingredients"},
        {"tag": "Stock",
        "response": "A flavored broth from meats, fish, shellfish, and vegetables. These are the basis of sauce and soup making."},
        {"tag": "Strain",
        "response": "to separate and reserve the liquid contents from a cooking process such as straining the liquid from the bones and vegetables for stock"},
        {"tag": "Stromboli",
        "response": "A stuffed pizza dish."},
        {"tag": "Strudel",
        "response": "Paper thin pastry rolled around sweet fillings of fruit, nuts, or cheese. Savory versions of this are similar to the Russian coulibiac."},
        {"tag": "Su",
        "response": "Rice vinegar"},
        {"tag": "Sucs",
        "response": "dehydrated solids of concentrated flavor left in the bottom of a pan after cooking meats; adding water dissolves the sucs, creating the fond base liquid"},
        {"tag": "Sudare",
        "response": "A mat made from bamboo strips to create Maki Sushi."},
        {"tag": "Sugar Syrup",
        "response": "Differentiating from natural syrups, this term refers to a solution of sugar and water. Simple syrups are made with equal quantities of water and sugar. Heavy syrup is made with twice as much sugar as water. These types of syrups are used in making sorbets, soft drinks, and for soaking cakes."},
        {"tag": "Suimono",
        "response": "Clear soup"},
        {"tag": "Sukiyaki",
        "response": "Thin-sliced beef, Tofu, noodles, and vegetables cooked in sukiyaki sauce"},
        {"tag": "Sumashi Soup",
        "response": "Clear soup with mushroom and scallions"},
        {"tag": "Summer Melon Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around Prosciutto and melon strips."},
        {"tag": "Supreme",
        "response": "Breast of chicken, bone in"},
        {"tag": "Sushi",
        "response": "The sweetened, sticky Japanese rice; the fish is Sashimi. However, when rice is wrapped around raw fish, restaurants refer to this roll as Sushi. It is important to understand that the term “sushi” refers to rice rolls, not fish fillings. These rolls are typically served with Wasabi, wrapped with thin Nori seaweed and a layer of rice on the outside, and filled with raw fish."},
        {"tag": "Suzuki",
        "response": "Sea bass"},
        {"tag": "Sweat",
        "response": "to cook in a very small amount of fat over low heat (sometimes covered) without browning to release flavors and moisture"},
        {"tag": "Sweetbread",
        "response": "The culinary term for the thymus gland of an animal. Those of veal and lamb are most commonly eaten. The pancreas is also considered a sweetbread, but its taste and texture is inferior to that of the thymus gland."},
        {"tag": "Syllabub",
        "response": "An English dessert comprised mainly of whipped cream sweetened with sugar and flavored with sherry, brandy, or cointreau. Lemon zest, fruit preserves or puree may also be swirled into the cream."},
        {"tag": "Szechuan Cuisine",
        "response": "One of the most famous Chinese cuisines in the world. Characterized by its spicy and pungent flavors, the Sichuan cuisineemphasizes the use of chili. Pepper, garlic, ginger, fermented soybean, and prickly ash produce this cuisine’s exciting tastes. Frying, frying without oil, pickling, and braising are used as basic cooking techniques."},
        {"tag": "Szechuan Pickle",
        "response": "A hot, salty, peppery pickle often used to intensify the spiciness of a dish."},
        {"tag": "Tabasco Sauce",
        "response": "A thin spicy sauce made of vinegar, red peppers, and salt, developed in America by Edmund McIlhenny at his home on Avery Island before the U.S. Civil War. McIlhenny Company is the sole supplier of Tabasco® Pepper Sauce to this day. This sauce is commonly used with Creole food, chili con carne, and eggs."},
        {"tag": "Tabbouleh",
        "response": "A Lebanese salad made of softened bulghur tossed with vegetables and seasoned with lemon and mint."},
        {"tag": "Table d’Hote",
        "response": "the set menu at a fixed price"},
        {"tag": "Tadka",
        "response": "A melange of spices, herbs, oil, and vegetables that flavors many Indian dishes."},
        {"tag": "Tagine",
        "response": "A Moroccan dish named after the cooking utensil in which it has been cooked. These stews may contain poultry, fish, meat, or vegetables and are highly spiced with sweet overtones common in North African cuisine."},
        {"tag": "Tagliarini",
        "response": "A flat ribbon pasta, narrower than tagliatelle, measuring approximately 3mm across."},
        {"tag": "Tagliatelle",
        "response": "Ribbon-shaped noodles that are popularly served plain or with spinach. Often used interchangeably with Fettuccine."},
        {"tag": "Tahini",
        "response": "A paste made from sesame seeds, used primarily in hummus and baba ganoush."},
        {"tag": "Tai",
        "response": "Porgy or red snapper"},
        {"tag": "Tako",
        "response": "Cooked octopus"},
        {"tag": "Talana",
        "response": "An Indian cooking term meaning “deep-fried in oil or ghee”."},
        {"tag": "Tamago",
        "response": "Sweet egg custard wrapped in dried seaweed"},
        {"tag": "Tamago yaki",
        "response": "Sweet egg omelet"},
        {"tag": "Tamal",
        "response": "A flavorful corn husk stuffed with chicken or shredded beef. Smothered with cheese and a red chili sauce."},
        {"tag": "Tamari",
        "response": "Thick and dark sauce made from soybeans."},
        {"tag": "Tamarind",
        "response": "This is the fruit pod of trees originally from Africa, now common in Asia, India, and the West Indies. The taste is bittersweet with citrus overtones. The pulp is very sticky and difficult to work with. Common forms sold are syrups and bricks of the pulp. It is used extensively in dishes of these regions as well as in candy and drinks."},
        {"tag": "Tandoor",
        "response": "The traditional, tall, cylindrical Indian clay oven. This clay pot, which has a deep sunken neck, is heated by hot charcoal. Long iron rods are used to stir the contents. The tandoor oven enhances the delectable flavors and aromas of Indian dishes."},
        {"tag": "Tandoori",
        "response": "An Indian method of cooking. Tandoori spices, including ginger, cumin, coriander, paprika, turmeric, and cayenne, are mixed with pureed garlic, ginger, lemon juice, and oil. After this red-orange sauce coats the food, it is cooked in the tandoor. Tandoori spices may be added to yogurt or used in a marinade."},
        {"tag": "Tandoori Murgh",
        "response": "Tandoori chicken marinated with spices, red peppers, and yogurt."},
        {"tag": "Tapadera",
        "response": "Seive."},
        {"tag": "Tapas",
        "response": "Hors d’ouvres"},
        {"tag": "Tapenade",
        "response": "A paste made from cured black olives seasoned with olive oil, garlic, anchovies, capers, lemon, and marc or cognac. This is common in Provence, where it is served with croutons and raw vegetables to dip. This also makes a good sauce for grilled meats and strong flavored fish."},
        {"tag": "Taquitos",
        "response": "Rolled crispy deep-fried corn tortillas filled with meat."},
        {"tag": "Taramasalata",
        "response": "A Greek dip made of olive oil and fish roe with the consistency similar to that of mayonnaise. American versions commonly use salmon, whitefish, or carp roe. This is served with raw vegetables and bread or croutons."},
        {"tag": "Tarka",
        "response": "A mixture of whole spices and/or garlic rapidly cooked over high heat. Usually added as a final seasoning or tempering to Indian dishes."},
        {"tag": "Tarta De Queso",
        "response": "Cheese Cake"},
        {"tag": "Tartare",
        "response": "This is a term which has several meanings. It is often used to describe the preparation of raw beef called steak tartare. Raw beef is chopped finely and served with minced onion, parsley, capers, and seasoned with anything from Worcestershire sauce to Tabasco sauce. Tartare sauce describes a mayonnaise based sauce with capers, onion, hard cooked eggs, cornichons, and herbs."},
        {"tag": "Tarte Flambé",
        "response": "An Alsatian pizza with a thin crust topped with fresh white cheese, onions, and bacon. This is also called an Alsatian firepie."},
        {"tag": "Tarte Tatin",
        "response": "A type of tart in which the pastry is baked on top of the fruit, then inverted when finished baking. Apples are traditionally used, becoming soft and caramelized during baking."},
        {"tag": "Tartufo",
        "response": "A chocolate ice cream dessert molded into a truffle."},
        {"tag": "Tasse",
        "response": "served in a cup"},
        {"tag": "Tataki",
        "response": "A cooking term that describes a food grilled on the surface, then chopped or pounded."},
        {"tag": "Tawa",
        "response": "A thick griddle"},
        {"tag": "Taza Para Medir",
        "response": "Measuring cup."},
        {"tag": "Tazuna Sushi",
        "response": "A Maki roll, typically consisting of Nori seaweed and rice, wrapped around seafood with diagonal strips of fish across the top."},
        {"tag": "Teapot Seafood Soup",
        "response": "A Japanese soup consisting of shrimp, scallop, crabmeat, fish cake, and vegetables."},
        {"tag": "Tekka Don",
        "response": "Fresh tuna served on a bed of Sushi rice"},
        {"tag": "Tekka Maki",
        "response": "Deep-fried Tempura vegetables and seafood."},
        {"tag": "Tekkappa",
        "response": "A mixture of both tuna and cucumber rolls."},
        {"tag": "Temaki",
        "response": "Literally “hand rolls”; cones made from dried Nori seaweed and most commonly wrapped around Sushi rice, seafood (salmon, Natto, Negi Toro, Ume Shiso,) and vegetables."},
        {"tag": "Temakizushi",
        "response": "Literally “hand rolls”; cones made from dried Nori seaweed and most commonly wrapped around Sushi rice, seafood (salmon, Natto, Negi Toro, Ume Shiso,) and vegetables."},
        {"tag": "Temper",
        "response": "to slowly introduce a hot liquid or batter component to a mix containing eggs; to prevent cooking an egg-base through slow incorporation of a hot component that must be added to a dish containing eggs"},
        {"tag": "Tempura",
        "response": "A popular Japanese dish consisting of seafood and vegetables deep fried in a light batter."},
        {"tag": "Teriyaki",
        "response": "A Japanese dish that has been marinated in a mixture of soy sauce, sugar, ginger, and seasonings before being grilled, broiled, or fried. The sugary marinade coats the cooked food with a slight glaze."},
        {"tag": "Teriyaki Chicken",
        "response": "Broiled chicken served with sweet soy Teriyaki sauce."},
        {"tag": "Ternera",
        "response": "Veal"},
        {"tag": "Ternera Picada",
        "response": "minced beef"},
        {"tag": "Terrine",
        "response": "earthenware casserole"},
        {"tag": "Texas Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around sliced cooked beef, cucumber strips, and spinach leaves."},
        {"tag": "Thin",
        "response": "reducing the thickness of a liquid by adding more liquid"},
        {"tag": "Thon",
        "response": "tuna fish"},
        {"tag": "Tibio",
        "response": "Beef"},
        {"tag": "Tierno",
        "response": "Tender, fresh."},
        {"tag": "Tikka",
        "response": "Skewered boneless cubes of meat, poultry, or seafood. Usually marinated and cooked in a tandoor. A type of kebab."},
        {"tag": "Tiramisu",
        "response": "A sweet, rich, layered dessert made from sponge cake, and Mascarpone cheese, brandy, and Espresso. Shavings of chocolate or cocoa are sprinkled on top."},
        {"tag": "Toad in the Hole",
        "response": "An English dish consisting of pieces of meat or sausages covered with batter and baked in the oven."},
        {"tag": "Tobiko",
        "response": "Flying fish roe. This red, crunchy fish is often served as part of Maki Sushi and Nigiri Sushi."},
        {"tag": "Tocino",
        "response": "Bacon"},
        {"tag": "Tocino De Cielo",
        "response": "“Heavenly bacon,” a sweet made of egg yolks and sugar"},
        {"tag": "Tofu",
        "response": "Obtained from the milky liquid extracted from soy beans. This high-protein, low-fat food is a popular meat substitute for vegetarians and health-conscious diners."},
        {"tag": "Togarashi",
        "response": "Hot, dried Japanese chili peppers"},
        {"tag": "Tomate",
        "response": "Tomato"},
        {"tag": "Tonkatsu",
        "response": "A tasty pork cutlet that is breaded then fried. Usually served on a bed of rice."},
        {"tag": "Tori",
        "response": "Chicken"},
        {"tag": "Torigai",
        "response": "Japanese cockle, or black and white shell fish."},
        {"tag": "Toro",
        "response": "The fat belly of tuna."},
        {"tag": "Toronja",
        "response": "Grapefruit"},
        {"tag": "Torta Del Casar",
        "response": "An extraordinary sheep’s milk cheese shaped like a pie or tart, made only in Casar, a village near Caceres in Extremadura. Popular since medieval times, it is very soft and creamy, perfect to dip into with crusty bread."},
        {"tag": "Torta Rustica",
        "response": "A large pie similar to coulibiac, filled with salmon, cabbage or spinach, eggs, and mushrooms. Other versions use meat or sausage in the filling. The crust is usually made of bread dough and sprinkled with salt before using."},
        {"tag": "Tortas",
        "response": "Large Mexican sandwich rolls often filled with generous servings."},
        {"tag": "Tortellini",
        "response": "Small rings of pasta stuffed with cheese, meat, or vegetables; generally found in soup, but sometimes served with a sauce."},
        {"tag": "Tortelloni",
        "response": "This is a larger version of the tortellini."},
        {"tag": "Tortilla",
        "response": "An egg and potato based omelet"},
        {"tag": "Tortilla De Patatas",
        "response": "Spanish potato omelet"},
        {"tag": "Tortillita De Camaron",
        "response": "Shrimp egg fritters, made with a thin batter and sizzled a la plancha"},
        {"tag": "Toss",
        "response": "mixing ingredients by gently tossing together with an upward motion"},
        {"tag": "Tostada",
        "response": "A thin, flat, crispy, corn tortilla layered with ground beef or shredded chicken, lettuce, diced tomato, and melted cheese. Usually loaded with guacamole, sour cream, and salsa."},
        {"tag": "Tournedo",
        "response": "A slice of beef from the heart of the tenderloin, approximately an inch thick. This term is rarely used in America today, being replaced by filet of beef or filet mignon."},
        {"tag": "Tournedos",
        "response": "a small steak from the center of the tenderloin"},
        {"tag": "Tourner",
        "response": "To turn, To shape vegetables or potatoes with a knife"},
        {"tag": "Tourte",
        "response": "Similar to pâté en croute, these are pies made in a round shape and served cold. They are generally highly seasoned and preparations are indicative to the region they are from."},
        {"tag": "Trancher",
        "response": "to carve or slice"},
        {"tag": "Trenne",
        "response": "Short, triangular, hollow pasta used with thick sauces. Similar to Penne, Ziti, and Rigatoni."},
        {"tag": "Trennette",
        "response": "Flat noodles, wider than fettuccine, that have one flat edge and one scalloped edge."},
        {"tag": "Tripe",
        "response": "The stomach of beef, pork, and sheep."},
        {"tag": "Trucha",
        "response": "Trout"},
        {"tag": "Truffle",
        "response": "This is a mushroom of unusual flavor and aroma. It is savored in Italian and French cookery, and due to its scarcity, draws a very high price. The black truffle of Perigord and the white truffle of Piedmont, in particular, are highly prized for their exceptional flavors. Black truffles are best served cooked; white truffles are best shaved directly on the dish before eating."},
        {"tag": "Tsubugai",
        "response": "Japanese shellfish"},
        {"tag": "Tuffolone",
        "response": "Large tubes of pasta that are typically stuffed and baked."},
        {"tag": "Tuiles",
        "response": "Crisp, paper thin cookies named for their tile-like appearance. They are often flavored with almond slices, lemon, and vanilla."},
        {"tag": "Tumeric",
        "response": "A bright yellow spice used primarily in commercial curry powder. It is also used in sweet pickles and for various dishes requiring a yellow color. This is used as a coloring substitute for saffron."},
        {"tag": "Tuna Salad Roll",
        "response": "A Sushi roll, typically consisting of Nori seaweed and rice, wrapped around tuna salad and lettuce leaves."},
        {"tag": "Turmeric",
        "response": "A bright yellow, bitter, flavorful spice commonly used in curry sauces."},
        {"tag": "Turron",
        "response": "An almond and honey confection of Arab origin now made in Jijona, Alicante and other regions. It comes as “Duro” a hard crunchy brittle (Alicante style) and “blando” in a soft halvah like bar (Jijona style). Available all year, but especially consumed during the Christmas season."},
        {"tag": "Txakoli",
        "response": "Acidic white wine from Basque country"},
        {"tag": "Txistorra, Chistorra",
        "response": "Long thin sausage sold in coils, of Basque/Navarrese origin."},
        {"tag": "Txoko",
        "response": "A Basque gastronomic society"},
        {"tag": "Tzatziki Sauce",
        "response": "Dipping sauce derived from yogurt, garlic, cucumber, olive oil and lemon juice. Served with calamari."},
        {"tag": "Tzimmes",
        "response": "Traditionally served on Rosh Hashana, this sweet Jewish dish consists of various combinations of fruits, meat and vegetables. All are flavored with honey and often with cinnamon as well. The flavors of this casserole-style dish develop by cooking it at a very low temperature for a very long time."},
        {"tag": "Udon",
        "response": "Long, thick, white, buckwheat Japanese noodles."},
        {"tag": "Ugli",
        "response": "A citrus fruit hybrid between a grapefruit and a tangerine native to Jamaica. It is available around the country from Winter to Spring. It has an acid-sweet flavor and is an excellent source of vitamin C."},
        {"tag": "Ume Shu",
        "response": "A popular, sweet, alcoholic drink made from plums."},
        {"tag": "Unagi",
        "response": "Freshwater eel; grilled and brushed with a Teriyaki-flavored sauce."},
        {"tag": "Unaju",
        "response": "Broiled eel on rice with pickles"},
        {"tag": "Uni",
        "response": "The sexual organs (gonads/ovaries) of the hermaphroditic sea urchin."},
        {"tag": "Unleavened",
        "response": "baked items that have no ingredients to give them volume (no yeast, no eggs, no baking powder for example)"},
        {"tag": "Upma",
        "response": "Spiced semolina, which may be cooked with tiny cubed potatoes and peas, then garnished with freshly grated coconut and cilantro."},
        {"tag": "Urta",
        "response": "fish common on the coast of Cadiz, most often prepared a la rotena (in the style of Rota) with peppers, tomato, and potato"},
        {"tag": "Usukuchi shoyu",
        "response": "Light Japanese Soy Sauce."},
        {"tag": "Uvas",
        "response": "Grapes"},
        {"tag": "Vacherin",
        "response": "A crisp, sweet meringue shell used as a serving vessel for fruit and ice cream."},
        {"tag": "Vaciar",
        "response": "empty"},
        {"tag": "Vadas",
        "response": "A round deep-fried savory snack made from lentils and potatoes. Served with chutneys."},
        {"tag": "Vainilla",
        "response": "Vanilla"},
        {"tag": "Vanilla",
        "response": "A plant native to Mexico now common in areas throughout the West Indies and Indian Ocean. The pod is used to make extracts which we use in cooking. The whole pod may also be purchased and used as a fragrance or split and scraped to allow the tiny seeds to flavor the dish. It is generally thought of as a sweet spice, used in custards, creams, and cakes. It is also used in savory dishes with vegetables or seafood. There are also imitation vanilla flavorings using synthetically produced vanillin. These can be found in liquid and powder forms."},
        {"tag": "Vapor",
        "response": "steamer"},
        {"tag": "Varak",
        "response": "Fine, thin, edible, silver foil used to garnish Indian desserts and paan. Known to help digestion."},
        {"tag": "Veau",
        "response": "veal"},
        {"tag": "Vegetable Tempura",
        "response": "Vegetables lightly fried in Tempura batter and served with dipping sauce."},
        {"tag": "Vegetable Teriyaki",
        "response": "Mixed vegetables with Teriyaki sauce"},
        {"tag": "Veggie Roll",
        "response": "A vegetarian roll, typically consisting of Nori seaweed and rice, wrapped around pesto, cucumber strips, tomato strips, and mushroom strips."},
        {"tag": "Veloute",
        "response": "a roux thickened white stock; chicken, fish, or veal. “One of the mother sauces”"},
        {"tag": "Venta",
        "response": "roadside locale combining elements of restaurant, shop, bar, and gas station, common in the south of Spain"},
        {"tag": "Vermicelli",
        "response": "A very fine round noodle which means “small worms”. These are thinner than spaghetti and thicker than capellini."},
        {"tag": "Verter",
        "response": "pour"},
        {"tag": "Vialone Nana",
        "response": "A plump grain, or firm inner starch rice, that makes a Risotto dish have a firm bite."},
        {"tag": "Viande",
        "response": "Meat"},
        {"tag": "Vichyssoise",
        "response": "A chilled soup of potatoes and leeks. Other versions now use zucchini, apples, and carrots."},
        {"tag": "Victual",
        "response": "Food or other provisions."},
        {"tag": "Vieiras",
        "response": "Gallego term for scallops"},
        {"tag": "Vinagre",
        "response": "normally a white wine vinegar made of sherry"},
        {"tag": "Vinaigrette",
        "response": "A sauce commonly used to dress salads, comprised of oil and vinegar. Emulsified vinaigrettes use egg and/or mustard to stabilize the dressing. Other combinations using acids other than vinegar, such as wine or citrus juice, are also called vinaigrettes."},
        {"tag": "Vindaloo",
        "response": "Spicy meat, marinated in garam masala (cumin, mustard seeds, ginger, onion, garlic, cinnamon, and cloves), then cooked in vinegar, mustard oil, and red pepper."},
        {"tag": "Vino Blanco",
        "response": "White Wine"},
        {"tag": "Vino de ChampaAa",
        "response": "Champagne"},
        {"tag": "Vino Malaga",
        "response": "An intense raisin-flavored fortified Spanish wine, generally served as a dessert wine or between meals. Strictly speaking, true Malaga wine is aged only in th province of Malaga."},
        {"tag": "Vino Rosado",
        "response": "Rose Wine"},
        {"tag": "Vino Tinto",
        "response": "Red Wine"},
        {"tag": "Virgin olive oil",
        "response": "A robust fruity flavored olive oil made from the pulp of the highest quality olives. It adds a distinctive flavor to salad dressings and is used in dishes where strong flavored oil is needed."},
        {"tag": "Vitello Tonnato",
        "response": "Thinly sliced roast or braised veal, served cold with a creamy, piquant tuna sauce. This combination may sound a bit unusual, but is surprisingly delicious."},
        {"tag": "Vol-au-vent",
        "response": "Puff pastry in a shell in which ragout or fricassee is served"},
        {"tag": "Volaille",
        "response": "Poultry"},
        {"tag": "Volver",
        "response": "turn"},
        {"tag": "Vuelta Y Vuelta",
        "response": "over easy"},
        {"tag": "Wakame",
        "response": "Dark green, dried, lobe-leafed strands of seaweed often used in Miso soup or Sunomono salads."},
        {"tag": "Wasabi",
        "response": "Called Japanese horseradish, this is a root that is dried and ground to a fine powder. This powder is then reconstituted and used for dipping sauce with soy sauce when eating sushi and sashimi."},
        {"tag": "Washi",
        "response": "Japanese rice paper"},
        {"tag": "Washoku",
        "response": "Literally meaning “Japanese-style food”, this comprehensive term refers to any Japanese dish that reflects the uniqueness, creativity, and diversity of the cuisine."},
        {"tag": "Water Bath",
        "response": "The French call this cooking technique bain marie. It consists of placing a container of food in a large, shallow pan of warm water, which surrounds the food with gentle heat. The food may be cooked in this manner either in an oven or on top of a range. This technique is designed to cook delicate dishes such as custards, sauces and savory mousses without breaking or curdling them. It can also be used to keep foods warm."},
        {"tag": "Water Chestnut",
        "response": "A crisp walnut-sized bulb with brownish-green skin."},
        {"tag": "Waterzooi",
        "response": "A rich Flemish stew with chicken or fish and assorted vegetables. The sauce is enriched with a liaison of cream and egg yolks."},
        {"tag": "Welsh Rarebit",
        "response": "Often confused as Welsh rabbit, this is a cheese sauce made with ale and seasoned with dry mustard, black pepper, and Worcestershire sauce. This is traditionally served over toast, with or without crumbled bacon. It is also a good variation of fondue and goes well with beer and ale."},
        {"tag": "Whelk",
        "response": "A small marine snail. Whelks are poached and served hot or cold."},
        {"tag": "Whipped Butter",
        "response": "Light, easily-spread butter that has been beaten with air to increase the volume."},
        {"tag": "Whipped Cream",
        "response": "An ideal cream to create a light frothy topping for a variety of desserts."},
        {"tag": "Whisk",
        "response": "to quickly mix air into ingredients; also the name of a cooking tool"},
        {"tag": "Wiener Schnitzel",
        "response": "Thin slices of veal or pork breaded and fried in butter. Traditional garnishes are lemon butter, anchovies, and capers."},
        {"tag": "Wok",
        "response": "A cone-shaped utensil with a rounded bottom, which encourages ingredients to return to the center. This utensil, which is used to cook most Chinese dishes, preserves the natural quality of the food."},
        {"tag": "Wonton",
        "response": "A Chinese dumpling made from egg-noodle dough. These wontons, which are usually filled with seafood, meat, or vegetables, may be boiled, deep-fried, or steamed. Commonly prepared in soups."},
        {"tag": "Wonton Wrappers",
        "response": "Thin sheets of dough made from flour, eggs, and salt. Used for small meat and vegetable filled dumplings known as pot stickers and wontons."},
        {"tag": "Worcestershire Sauce",
        "response": "A condiment developed in England from flavors discovered in India. It is used as a sauce, a seasoning, and a condiment. It is made of a very odd assortment of ingredients including anchovies, tamarind, vinegar, molasses, and cloves."},
        {"tag": "WPRW",
        "response": "Wash, peel, rewash"},
        {"tag": "Xanthan Gum",
        "response": "Produced from the fermentation of corn sugar. It is most commonly used as a stabilizer, emulsifier and thickener in foods such as yogurt, sour cream and salad dressings."},
        {"tag": "Yagi",
        "response": "Japanese for goat."},
        {"tag": "Yakidofu",
        "response": "Grilled Tofu"},
        {"tag": "Yakisoba",
        "response": "Sauteed Japanese noodles with shrimp and vegetables"},
        {"tag": "Yakitori",
        "response": "Charcoal-grilled chicken served on skewers and sauteed with Teriyaki sauce."},
        {"tag": "Yakiudon",
        "response": "Sauteed Japanese noodles with shrimp and vegetables"},
        {"tag": "Yakumi",
        "response": "Strongly flavored seasonings, such as Shichimi Togarashi, grated Daikon, and fine chopped Negi. A typically substitute for Wasabi in Nigiri, Katsuo, and Aji dishes."},
        {"tag": "Yard of Ale",
        "response": "An elongated glass, measuring approximately 26 inches long holding 42 fluid ounces."},
        {"tag": "Yema",
        "response": "egg yolk, also refers to a convent sweet made of soft yolk and sugar"},
        {"tag": "Yuzu",
        "response": "Japanese citrus fruit that adds zest to many dishes."},
        {"tag": "Zabaglione",
        "response": "An Italian custard made with egg yolks and wine or juices, which are beaten vigorously over hot water to form a rich, creamy dessert. The custard can then be poured into glasses and chilled to be eaten later, or eaten warm with fresh fruit. Marsala is the most common wine used, though any sweet wine such as Madeira, Champagne, or Sauterne may be used. Also called Sabayon."},
        {"tag": "Zakuski",
        "response": "The Russian version of tapas involving a lot of food and vodka."},
        {"tag": "Zampone",
        "response": "A specialty of the town of Modena in northern Italy, this consists of a hollowed and stuffed pig trotter which is poached and served as a part of a traditional bollito misto."},
        {"tag": "Zanahoria",
        "response": "carrot"},
        {"tag": "Zante Grapes",
        "response": "Tiny seedless grapes with a sweet flavor."},
        {"tag": "Zeppole",
        "response": "Fried dough, or a sweet fritter, made with a simple batter of flour and sugar."},
        {"tag": "Zest",
        "response": "The outer rind of citrus fruit"},
        {"tag": "Ziti",
        "response": "Long, thin, tubular-shaped pasta that is similar to Rigatoni or Penne."},
        {"tag": "Zitoni",
        "response": "Wide, hollow, tubular pasta. A larger version of Ziti pasta."},
        {"tag": "Zorongollo",
        "response": "a Murcian dish of zucchini, onion, and egg"},
        {"tag": "Zucchini Squash",
        "response": "A cylindrical summer squash with a dark green skin covering a whitish flesh. Similar to a cucumber in size and shape."},
        {"tag": "Zuccotto",
        "response": "An Italian dessert consisting of triangles of sponge cake that have been moistened with a Curacao liqueur. Traditionally, the cake is placed around the inside of a bowl to form a shell, filled with whipped cream, and topped with bits of chocolate, caramel, hazelnuts, almonds, and an additional layer of cake. It is presented in a dome shape, supposedly inspired by the design of an Italian cathedral."},
        {"tag": "Zuppa",
        "response": "Italian soup"},
        {"tag": "Zuppa Inglese",
        "response": "Literally translated as “English soup”, this Italian dish is, in fact, a refrigerated dessert similar to the British favorite, trifle. It is made with rum sprinkled slices of sponge cake layered with a rich custard or whipped cream (or both) and candied fruit or toasted almonds (or both)."},
        {"tag": "Zurrukutuna",
        "response": "a soup of salt cod, pepper, and egg"}
]
}


        